[{"handle":"voxdotcom","text":"Could Clarence Thomas’s Dobbs concurrence signal a future attack on LGBTQ rights? https://t.co/aRJNQ93U6m","date":"Sat Jun 25 21:58:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"There have only been three justices in American history who were appointed by a president who lost the popular vote, and confirmed by a bloc of senators who represent less than half the country. \n\nAll three of them sit on the Supreme Court right now. https://t.co/Zh22bnFmti","date":"Sat Jun 25 21:11:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"More than 80 elected prosecutors have argued that enforcing abortion bans would be a bad use of limited criminal justice resources https://t.co/OSfQ2ueDpx","date":"Sat Jun 25 20:05:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A push toward a national ban is the next front in Republicans’ war on abortion https://t.co/1hEg9obCxE","date":"Sat Jun 25 17:20:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Google searches for abortion pills are spiking. Know your options, and the laws in your state: https://t.co/J7KpVGSM92","date":"Sat Jun 25 16:55:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In May, 55% of Americans identified as \"pro-choice,\" the highest level since 1995. \n\nDespite this, the US Supreme Court overturned #RoeVsWade.\n\nhttps://t.co/c3tTSc6oET https://t.co/I9bJokLTBk","date":"Sat Jun 25 16:05:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The #RoeVsWade decision isn't the only reason to take a more critical eye to the courts. \n\nThis institution has not served the American people well, and it’s time to start treating it that way, writes @imillhiser. https://t.co/UrcRlZ0hcT https://t.co/BtRRts3Jmj","date":"Sat Jun 25 15:45:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The #SupremeCourt on June 24 voted to strike down #RoeVsWade, the 1973 decision that established a constitutional right to an abortion.\n\nThe decision will result in fragmented abortion access across the country. \n\nhttps://t.co/b9dQl3LPYD https://t.co/iblbPtYQoA","date":"Sat Jun 25 15:05:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What we’re seeing now with the Supreme Court is a particularly important example of the degree to which America’s democratic institutions are degrading — and even at risk of failure, writes @zackbeauchamp. https://t.co/MqY6yeeYjb","date":"Sat Jun 25 14:55:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The FDA made mail-order abortion pills legal. Access is still a nightmare. https://t.co/sbAkurG22l","date":"Sat Jun 25 13:55:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Almost a year after Kabul’s fall and the US’s withdrawal, the economy remains in free fall, and the country faces a near-constant humanitarian disaster. https://t.co/FoO6BXMQ9H","date":"Sat Jun 25 13:00:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Being able to access abortion is about all kinds of justice — economic justice included. https://t.co/uYffspuKfT","date":"Sat Jun 25 12:30:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The case against the Supreme Court of the United States https://t.co/3fvxqk8pcQ","date":"Sat Jun 25 12:00:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Normal” has become something of a useless word in meteorology — and “extreme,” something of a mundane one — as fossil fuels continue to heat up the planet. \n\nIn the years to come, heat waves like these are likely to get worse, not better. https://t.co/SlLMlD5QhA","date":"Sat Jun 25 11:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Democrats don’t have a quick fix for the end of Roe because there isn’t one. https://t.co/tTDpQ3EIBB","date":"Sat Jun 25 07:10:42 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Over the past half-century, the US’s political parties polarized on abortion — even as most Americans stayed in the middle. https://t.co/NXhz1zkIuh","date":"Sat Jun 25 06:09:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The dire health consequences of denying abortions, explained https://t.co/3p2uK4eOK0","date":"Sat Jun 25 05:07:40 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The end of Roe will mean more children living in poverty https://t.co/oNUfiBTTZO","date":"Sat Jun 25 04:04:44 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How “pro-life” states are failing new parents and babies. https://t.co/jJp96pSjJZ","date":"Sat Jun 25 02:57:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The politics and process that led us here, today, to the end of #RoeVsWade, has repeatedly exposed the Court as a vessel for politics by other means. https://t.co/hQ87cQafoe","date":"Sat Jun 25 01:55:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why do Americans no longer see the Court as above politics? Blame Republicans — and the Court itself. https://t.co/x3kiriXtY8","date":"Sat Jun 25 00:46:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Providing abortion services during the late 1960s and early 1970s was a political act. It was also a criminal one. \n\nA new HBO documentary, The Janes, explores this harrowing era of illegal abortions. https://t.co/qme3Zknhtt","date":"Fri Jun 24 23:45:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"#RoeVsWade is now overruled. Are access to contraception, same-sex marriage, and even the right to choose your own sex partners next?https://t.co/GeMtZUaXAw","date":"Fri Jun 24 22:35:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"With the end of #RoeVsWade, how — and why — should we be talking to kids about abortion? https://t.co/dycXAsJyGH","date":"Fri Jun 24 22:05:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court’s legitimacy relies on the perception that it’s not a political body. \n\nBut since 2016, Republicans have taken a series of steps that have made it hard for anyone to see the Court as standing above politics. https://t.co/00x64qhIn2","date":"Fri Jun 24 21:55:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The end of Roe was decades in the making, but Republicans aren’t stopping there.  https://t.co/R7C00kpUrn","date":"Fri Jun 24 21:50:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"I drive for work, now what? https://t.co/ao2xHyHmzh","date":"Fri Jun 24 21:30:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"To understand what's behind the Supreme Court's decision to overturn #RoeVsWade — and how we got to this moment — listen to these Vox podcast episodes: https://t.co/4iG1H48ftg","date":"Fri Jun 24 21:24:42 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Roe is gone, and beyond urging pro-abortion rights Americans to elect pro-abortion candidates, a dissonance is emerging between how national Democrats are behaving and the fear that many Americans feel. https://t.co/tSPJ4YQ97W","date":"Fri Jun 24 20:46:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Almost half the US is ready to outlaw abortion now that #SCOTUS has overruled #RoeVsWade. \n\nBut many of those states are not willing to give new babies and their families the educational, medical, or financial support they need to lead a healthy life. https://t.co/yWdCA7r97M","date":"Fri Jun 24 20:27:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What’s in the bipartisan gun control bill? The bill incentivizes red flag laws, narrows the “boyfriend loophole,” and more.\nhttps://t.co/NPvgEGo6xA","date":"Fri Jun 24 19:25:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Correction: An earlier tweet called Thomas's opinion a \"dissent.\" He voted with the 6-3 majority.","date":"Fri Jun 24 19:00:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Clarence Thomas’s argument for overturning rights to birth control and same-sex marriage exposed a flaw in the majority opinion overturning #RoeVsWade. https://t.co/CFJOXMoElf","date":"Fri Jun 24 18:52:48 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How the Uvalde police failed https://t.co/pQMZAgu7U8","date":"Fri Jun 24 18:40:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What does change is that accessing an abortion safely and legally will become more complicated and risky for people in nearly half the states in the US now that #RoeVsWade has been overturned. \n\nhttps://t.co/b9dQl3uf75","date":"Fri Jun 24 18:26:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Criminalizing abortion historically hasn’t stopped people from seeking one. \n\nResearch has found no statistically significant difference in rates of abortion between countries that do and do not broadly allow the procedure, according to @Guttmacher. https://t.co/b9dQl3uf75","date":"Fri Jun 24 18:25:44 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"There’s also an open question about whether other rights, such as the right to same-sex marriage or contraception, are in danger. \n\nMany of the Court’s decisions protecting a right to sexual, romantic, or bodily autonomy rely on similar reasoning to Roe. https://t.co/YpZltd0KK7","date":"Fri Jun 24 18:18:22 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Many of these laws are now in effect, after the #SCOTUS decision overruling Roe, but some of these states have “trigger” provisions that do not take effect until a certain condition is met — such as after 30 days pass from the Dobbs decision.","date":"Fri Jun 24 18:14:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What happens now that #RoeVsWade has been overruled? \n\nAbortion will very soon be illegal in at least 18 states, and will be banned very early in pregnancy in at least four more. https://t.co/b9dQl3uf75 https://t.co/UFPowD6zcz","date":"Fri Jun 24 18:10:30 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The House just passed a bipartisan gun safety package 234-193, one day after the bill cleared the Senate.\n\nThe last time Congress passed a major piece of gun legislation was in 1994, when it enacted a now-expired 10-year ban on assault weapons. https://t.co/d00BBVIq3Q","date":"Fri Jun 24 18:01:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"BREAKING: Congress passes a landmark gun control package https://t.co/08q0QI5EtO","date":"Fri Jun 24 17:59:40 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Which rights are next on the Supreme Court’s chopping block now that Roe v. Wade is overruled? https://t.co/VUUuDdJa0r","date":"Fri Jun 24 17:50:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"As of May 2022, 55% of Americans identify as \"pro-choice,\" the highest level since 1995, despite the US Supreme Court's decision to overturn #RoeVsWade.\n\nhttps://t.co/c3tTSc6oET https://t.co/gEFI0WTSH3","date":"Fri Jun 24 17:49:35 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The legitimacy of the Supreme Court has been slowly eroded in recent years. Overturning #RoeVsWade may push it over the edge.\n\nWith an election looming in 2024, that’s a recipe for disaster, warns @imillhiser. https://t.co/FrUFEPaf8t","date":"Fri Jun 24 17:48:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The US Supreme Court ruling to overturn Roe v. Wade, clearing the way for states to outlaw abortion, goes against majority opinion on ending a pregnancy. \n\nAmericans overwhelmingly want legal access to abortion, at least in some situations. \n\nhttps://t.co/c3tTSc6oET https://t.co/pR3Ae8D0Zd","date":"Fri Jun 24 17:24:46 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court has not served the American people well, and it’s time to start treating it that way, argues @imillhiser.\n\nRead \"The case against the Supreme Court of the United States\" https://t.co/UrcRlYIGll https://t.co/xK0Bf55do2","date":"Fri Jun 24 17:08:31 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How we got here: Roe v. Wade from 1973 to today https://t.co/kiYHdIO4Ua","date":"Fri Jun 24 16:47:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Over decades, conservative attorneys brought cases that undermined Roe with the hope that, by chipping away at the ruling, #SCOTUS would eventually feel comfortable striking it down.\n\nThis timeline puts it in perspective: https://t.co/rQeeZLKBFw","date":"Fri Jun 24 16:46:39 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What has shifted dramatically is America's politics. \n\nAnd with the Supreme Court’s decision in Dobbs v. Jackson Women’s Health Organization — which effectively overturned Roe — reality has shifted as well. No longer is abortion protected at the federal level.","date":"Fri Jun 24 16:40:56 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In 1976, just a few years after the Supreme Court handed down its opinion in #RoeVsWade, most Americans thought abortion should be legal in at least some circumstances. \n\nThose numbers haven’t changed much over almost 50 years. https://t.co/rQeeZLt0NY https://t.co/PuQjDuPypk","date":"Fri Jun 24 16:39:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Overwhelmingly, the states that are least capable of supporting any uptick in births are the ones on the brink of outlawing abortion, writes @dylanlscott.\n\nFamilies and children will pay the price. https://t.co/rrIbTQISts","date":"Fri Jun 24 16:25:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"These 22 states are likely to quickly ban all or nearly all abortions, now that #SCOTUS has overturned #RoeVsWade.\n\nhttps://t.co/TjPZYAcU66 https://t.co/2Tam65Efxn","date":"Fri Jun 24 15:56:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court has overturned #RoeVsWade. Now, there is no longer any constitutional right to an abortion.\n\nHere’s what to expect from the states, and from Democrats and Republicans. https://t.co/0CL9SWBe5o","date":"Fri Jun 24 15:46:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Read: The Supreme Court overturns Roe v. Wade https://t.co/tSWJGWErvx","date":"Fri Jun 24 14:28:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What’s the best way to help extremely poor people? After 20 years, the evidence is in. https://t.co/pEDO2JgCyR","date":"Fri Jun 24 13:01:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"You can be a good friend while taking care of yourself. https://t.co/KCFdJADwEI","date":"Fri Jun 24 12:01:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The vast majority of Americans support abortion https://t.co/sVNGJaHPPP","date":"Fri Jun 24 11:00:55 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Senate has passed a bipartisan gun deal — the first in decades  — following a streak of recent mass shootings, including in Uvalde, Texas, and Buffalo, New York. https://t.co/Xlm1ZFnbFV","date":"Fri Jun 24 02:38:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Donald Trump’s cuckoo coup  https://t.co/dYNSr4Nixw","date":"Fri Jun 24 01:13:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The FDA has ordered JUUL to pull all of its vaping products from the US market. Our video from 2018 breaks down the company's role in addicting a new generation to nicotine.\n\nhttps://t.co/Y4kxqARSEY","date":"Thu Jun 23 21:55:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Jeffrey Clark gets his moment in the spotlight Thursday in front of the January 6 committee. https://t.co/PXTUIpzBHH","date":"Thu Jun 23 19:30:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court’s new gun ruling means virtually no gun law is safe https://t.co/rSBSrezjKa","date":"Thu Jun 23 19:00:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Watch the video to get an in-depth look on how we got here and how this technology works:\n\nhttps://t.co/NnYAoCuQKD","date":"Thu Jun 23 18:47:40 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"While big companies like Google, OpenAI, and Facebook may have not released their models to the public, there are plenty of open source models you may have heard of like Midjourney, which we used, or DALL-e mini. \n\nhttps://t.co/WPNl3OKejM https://t.co/nZumJu2k69","date":"Thu Jun 23 18:47:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Over the past year, the technology has advanced in leaps and bounds from blurry, indistinct images to highly detailed renders in varying styles and expressions. https://t.co/otl2LWx9M2","date":"Thu Jun 23 18:46:49 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"These models weren’t always capable of generating such rich, detailed images. https://t.co/WPNl3OKejM https://t.co/J41omaB4BB","date":"Thu Jun 23 18:46:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Advances in AI research have produced many tools capable of generating images from simple text prompts, turning every person into an art director. https://t.co/WPNl3OKejM https://t.co/jNtxg2yUdn","date":"Thu Jun 23 18:45:32 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Searching for fossils on the beach at Lyme Regis with waves crashing,” “A Manhattan evening by Arshile Gorky,” “A coral reef by Gustav Klimt.”\n\nThese people didn’t paint these pictures. They prompted an AI to bring their words to life. https://t.co/NnYAoCuQKD https://t.co/NVU2TSxe6c","date":"Thu Jun 23 18:45:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Hollywood loves a good guy with a gun. It only makes the myth stronger. https://t.co/guld5XJl1D","date":"Thu Jun 23 17:10:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Blue states’ gun control efforts hinge on the Supreme Court  https://t.co/kXSgUKJJcw","date":"Thu Jun 23 13:20:10 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Despite being produced over two decades ago, Chungking Express (Wong Kar-Wai) and Rebels of the Neon God (Tsai Ming-Liang) are films that capture the ennui-afflicted mood of 2022. https://t.co/uztMvMZIKS","date":"Thu Jun 23 12:01:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Afghanistan’s staggering set of crises, explained https://t.co/HZUkTrAd3o","date":"Thu Jun 23 11:30:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"I drive for work, now what?  https://t.co/RUX3kc41eQ","date":"Thu Jun 23 11:00:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"America is about to meet Jeffrey Clark, the one DOJ official willing to do Trump’s coup https://t.co/N2Ae67a1D3","date":"Thu Jun 23 09:00:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Elon Musk the Twitter celebrity vs. Elon Musk the boss https://t.co/8OHWqo0nOz","date":"Wed Jun 22 17:30:43 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"This summer is already hot. It doesn’t get better from here. https://t.co/qGrFAghJ41","date":"Wed Jun 22 17:00:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A new right-wing super PAC is attacking Liz Cheney as a “DC diva” https://t.co/8Iho9CID8H","date":"Wed Jun 22 16:10:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Mars was once a very different planet, with rivers, lakes, and — potentially — life. \n\nNASA’s latest Mars rover is on a mission to find traces of past life. What happens if it does? \n\nListen to Unexplainable, a science show about everything we don’t know: https://t.co/b5QkmPaSRl","date":"Wed Jun 22 14:43:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Minions are immortal agents of the capitalist machine. We must free them. https://t.co/vzBbk7xiHc","date":"Wed Jun 22 13:01:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The hottest party accessory? Covid tests. https://t.co/mrokv2cqbm","date":"Wed Jun 22 12:01:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Should you keep abortion pills at home, just in case? https://t.co/y11BRoqu6R","date":"Wed Jun 22 11:30:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s TikTok’s world. Can TV live in it? https://t.co/nZYF09bPMz","date":"Wed Jun 22 10:30:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Primaries in Virginia and DC, as well as runoffs in Georgia and Alabama, saw big wins for Donald Trump and Stacey Abrams.\n\nRead more on that, and all about the June 21 elections’ other winners and losers. https://t.co/5I9TpA3VtP","date":"Wed Jun 22 04:30:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What Eric Greitens’s “RINO hunting” ad means for the Missouri Senate race https://t.co/0Oj5ZiRV7V","date":"Tue Jun 21 23:51:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Here are answers to 4 questions about vaccines for babies, toddlers, and little kids. https://t.co/yXXjdg9zSb","date":"Tue Jun 21 23:30:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Gas prices are plastered everywhere, but they are a particularly poor measure of the economy. There’s a better way of understanding them. https://t.co/MhahfSszTo","date":"Tue Jun 21 23:00:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Tuesday’s January 6 hearing revealed an under-discussed threat to democracy https://t.co/g9YhiaSciq","date":"Tue Jun 21 22:11:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A new Supreme Court decision has ominous implications for LGBTQ discrimination https://t.co/WiEKjMproU","date":"Tue Jun 21 20:50:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3 takeaways from the January 6 hearing with state election officials https://t.co/Q32ejCgvLe","date":"Tue Jun 21 19:40:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court tears a new hole in the wall separating church and state. https://t.co/F0W2COVZc8","date":"Tue Jun 21 17:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“We’ve forgotten what the word democracy means”\n\n@TimothyDSnyder talks to Vox’s @seanilling about the war in Ukraine and the future of global democracy https://t.co/L93M9Rog5Y","date":"Tue Jun 21 17:20:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What the case of Happy the elephant tells us about ourselves https://t.co/dB80uvM0fe","date":"Tue Jun 21 13:01:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Biden distanced himself from Saudi Arabia — until gas prices got bad  https://t.co/fngXdh02rJ","date":"Tue Jun 21 12:20:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The SEC did a sensible thing on climate change. A right-wing campaign is trying to kill it. https://t.co/EottXvpe5G","date":"Tue Jun 21 11:00:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why grain can’t get out of Ukraine https://t.co/ScXJ6wQyOZ","date":"Mon Jun 20 12:01:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s time to rethink household chores. https://t.co/OB708ENHqj","date":"Mon Jun 20 11:00:30 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"As Americans celebrate Juneteenth this year, it is difficult not to wonder whether freedom is merely delayed or will be eternally denied for Black Americans.\n\nThat question is exactly why Americans, Black and otherwise, need to honor #Juneteenth. https://t.co/HAfrP5CihC","date":"Sun Jun 19 17:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Juneteenth flag is red, white, and blue.\n\nBen Haith, its creator, said it's a reminder that Black Americans descended from enslaved people are exactly that: American. @KenyaTheHunter spoke with Haith to learn more about the flag’s history. https://t.co/LgMNOZ7NB5","date":"Sun Jun 19 14:00:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Raising Raffi” is a portrait of the artist as a dedicated if harried father https://t.co/7ojuSPhVUr","date":"Sun Jun 19 13:00:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Incarceration is one of the most glaring examples of how fragile freedom can be for Black Americans.\n\n@ChrisCarrega asks how the land of the free continues to lead the world in putting its residents — predominantly Black men and women — behind bars. https://t.co/7mlmcQXuRs","date":"Sun Jun 19 13:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Remembering Vincent Chin — and the deep roots of anti-Asian violence https://t.co/IMnYtvwkkq","date":"Sun Jun 19 12:00:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s estimated that racism has caused the loss of $70 trillion in wealth for Black Americans.\n\n@FabiolaCineas revisits reparations and the movement demanding a federal commission by #Juneteenth.  https://t.co/nNBazzngt2","date":"Sun Jun 19 12:00:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"From bucket hats to cooler cans, Julia Craven writes that crass attempts at Juneteenth merch serve as a reminder: “Black people who want to savor America’s sweetest dream must pay for it, again and again.” https://t.co/fyOQ0SzzXr","date":"Sun Jun 19 11:00:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In a time of renewed threats to the sense of safety among African Americans, @jewelwickershow speaks with the founders of a place dubbed Freedom, Georgia, a model of Black self-determination that could soon be the latest idyllic Black settlement community. https://t.co/cDyC72Iwbo","date":"Sun Jun 19 11:00:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Being a good father means rethinking masculinity https://t.co/U8AvNGcZAu","date":"Sat Jun 18 13:00:56 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"If aliens attack, it might come with a phishing attack, not a UFO armada https://t.co/87POOhSuSr","date":"Sat Jun 18 12:00:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The debut novel THE IMMORTAL KING RAO draws the line from the East India Company to technocapitalism in its portrait of a world ruled by a tech CEO. Join the conversation with the #VoxBookClub. https://t.co/pGxv8obFTH","date":"Fri Jun 17 18:00:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Meta is getting data about you from some surprising places https://t.co/9Y9WIG3R2f","date":"Fri Jun 17 17:00:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The two main issues holding up the bipartisan gun deal, briefly explained https://t.co/7kTJfRrF51","date":"Fri Jun 17 16:40:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Flooding in Yellowstone is a disaster for people and their livelihoods. The park’s iconic animals, however, are doing just fine. https://t.co/HoyzbGyPRR","date":"Fri Jun 17 15:57:46 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Gas prices are plastered everywhere, but they are a particularly poor measure of the economy. There’s a better way of understanding them. https://t.co/sOkM9r1fxV","date":"Fri Jun 17 15:40:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@Recode Are you a current or former Amazon employee with thoughts or tips on this topic? \n\nPlease email Jason Del Rey at jason@recode.net or jasondelrey@protonmail.com. His phone number and Signal number are available upon request by email.","date":"Fri Jun 17 15:33:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@Recode Besides changing termination or retention policies, increasing pay is another obvious lever that Amazon could pull to expand its labor pool. \n\nEvery dollar added above minimum wage adds 7% more workers to its potential hiring pool, the report found. \n\nhttps://t.co/z1JtDoneHj","date":"Fri Jun 17 15:32:49 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@Recode Only a series of sweeping changes to how the company does business and manages its workforce of more than 1 million people will significantly alter the timeline, Amazon staff predicted.\n https://t.co/z1JtDoneHj","date":"Fri Jun 17 15:32:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A leaked Amazon memo obtained by @Recode reveals a looming crisis for the tech giant: It could run out of people to hire in its US warehouses by 2024.\n\nhttps://t.co/z1JtDoneHj https://t.co/7xky3P7Xko","date":"Fri Jun 17 15:31:32 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“I’m sure when we get to the less-than-5-year-olds, [uptake] will be less than 30%,” said Kristin Moffitt, a @BostonChildrens doctor.\n\nIn such an environment, cases could still spike among toddlers and babies, especially as kids go to school. https://t.co/yXXjdg9zSb","date":"Fri Jun 17 15:19:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"But does that mean American parents will vaccinate their kids en masse? \n\nSo far, for kids ages 5 to 11, the Covid-19 vaccination rate has barely topped one-third, reports @umairfan. https://t.co/yXXjdg9zSb","date":"Fri Jun 17 15:18:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Our expectation is that within weeks, every parent who wants their child to get vaccinated will be able to get an appointment,” according to White House Covid-19 response coordinator Ashish Jha. https://t.co/yXXjdg9zSb","date":"Fri Jun 17 15:17:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The FDA has authorized emergency use of Covid-19 vaccines for infants and toddlers. Here's what it could mean for the next stage of the pandemic. https://t.co/yXXjdg9zSb","date":"Fri Jun 17 15:17:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How the US got so dependent on baby formula  https://t.co/xvjhpj0K8I","date":"Fri Jun 17 13:01:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Lightyear plays it safe while being about a hero who famously doesn’t https://t.co/2Ko8zFXGhJ","date":"Fri Jun 17 12:30:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Now might be a good time to think about crypto insurance https://t.co/MOV2k8rJj0","date":"Fri Jun 17 12:10:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"One Good Thing: Musician Ethel Cain is a Lana Del Rey who’s being raptured https://t.co/4LcdsUZDOw","date":"Fri Jun 17 12:00:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"\"America’s ‘Black taxes’ are a glimpse into the ways our capital has been demanded, despite our labor never being properly compensated.\" https://t.co/fyOQ0ShYyR https://t.co/laoBwsrHIj","date":"Fri Jun 17 12:00:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"As the end of Roe likely approaches, how — and why — should we be talking to kids about abortion? https://t.co/e4oELyAeOt","date":"Fri Jun 17 11:30:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Leaked Amazon memo warns the company is running out of people to hire https://t.co/y2WulBbzE1","date":"Fri Jun 17 11:01:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Trump called his vice president a “wimp” for failing to do his coup https://t.co/Fio3ZDaFSh","date":"Thu Jun 16 21:55:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What if there had been no adults in the room on January 6? https://t.co/gG9Dqo37sN","date":"Thu Jun 16 21:51:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Happening now: listen to Vox's Senior Policy Reporter @rmc031 in conversation live on @TwitterSpaces https://t.co/yKGoZ81iKT","date":"Thu Jun 16 21:36:49 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Since #Juneteenth was codified as a federal holiday, companies like Walmart and Target have begun commercializing the holiday by selling shoddy merch, making it clear they see Juneteenth “as little more than a cash grab,” Julia Craven writes for Vox. https://t.co/fyOQ0ShYyR https://t.co/XzscWvBAJP","date":"Thu Jun 16 21:30:57 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In many of these sorts of stores, race continues to shape #economicinequality as many of the Black people who work in them are promoted less and have lower wages, worse benefits, and higher job instability than their white peers. https://t.co/fyOQ0ShYyR","date":"Thu Jun 16 21:30:57 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s a stark reminder that, for many Black Americans, “The country’s capitalist system is no small tormentor,” Craven says. https://t.co/fyOQ0ShYyR","date":"Thu Jun 16 21:30:57 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Elon Musk addressed Twitter’s employees for the first time today in a Q&amp;A session about how he’ll run the company. The meeting comes after weeks of uncertainty about whether the deal is happening at all.\n\nRead the leaked transcript of the meeting.\nhttps://t.co/0be0iZAwaz","date":"Thu Jun 16 20:51:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"While Musk provided few details that would assuage those at Twitter who fear his self-labeled free speech ideology and management style — it was one of the most substantial conversations Musk has had yet about how he actually plans to change the company. https://t.co/0be0iZAwaz","date":"Thu Jun 16 20:51:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Leaked transcript: Inside Elon Musk’s first meeting with Twitter employees https://t.co/btYCWFmmTL","date":"Thu Jun 16 20:40:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Musk said that while people should have a right to freedom of speech, they don’t necessarily have “freedom of reach,” meaning that Twitter doesn’t have to amplify ideas like Holocaust denial on the platform. https://t.co/C3WwfghStu","date":"Thu Jun 16 20:21:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"According to a recording of the meeting obtained by @Recode, Musk seemed to back away from a more absolutist stance toward “freedom of speech” on the platform. https://t.co/C3WwfghStu","date":"Thu Jun 16 20:21:52 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Elon Musk talked to Twitter's employees for the first time today in a Q&amp;A session. \n\nInside the meeting where employees asked Musk tough questions he still doesn't have all the answers to https://t.co/C3WwfghStu","date":"Thu Jun 16 19:44:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why we do assume sleeping in separate beds signals trouble in a relationship? It really doesn't have to. It can even be a good thing. https://t.co/dN7Y9NAXBJ","date":"Thu Jun 16 19:30:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What you need to know about Elon Musk’s big meeting with Twitter employees  https://t.co/RUlsUffMUg","date":"Thu Jun 16 19:25:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Climate change still threatens polar bears, but a new study complicates the story — and offers a glimmer of hope. https://t.co/rZtSJrz4L8","date":"Thu Jun 16 18:00:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"🗣 Calling all video fans! 📣\n\nHere’s your opportunity to be in a Vox video: https://t.co/X5WnTzJKVp \n\nCheck out our form and give us an assignment. We’re experimenting with a brand new format and we need your help. https://t.co/m3uymFlhFi","date":"Thu Jun 16 15:55:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A new study asks: What if the US had Medicare-for-all during the pandemic? https://t.co/albdJxnkWg","date":"Thu Jun 16 15:50:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Actually, maybe don’t learn to code. https://t.co/BYhux2cW9t","date":"Thu Jun 16 12:01:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The pandemic’s invisible influence over the midterm elections  https://t.co/c7bCVPMyr1","date":"Thu Jun 16 10:30:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Vox reporter @FabiolaCineas spoke with advocates and racial justice leaders to learn about the reparations movement gaining momentum at the local level. https://t.co/nNBazzngt2 https://t.co/B4LrG9Bs6t","date":"Wed Jun 15 21:50:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The demand, continued organizing for racial justice, and the recent recognition of #Juneteenth as a day of national importance calling for solemnity as well as celebration, have all brought a new wave of urgency to the centuries-long reparations debate.⁠ https://t.co/nNBazzngt2","date":"Wed Jun 15 21:50:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The effort would have redistributed land previously owned by the Confederates, giving the formerly enslaved a chance to own their own land and become economically self-sufficient. But the government reneged after Lincoln’s assassination.⁠ https://t.co/nNBazzngt2","date":"Wed Jun 15 21:50:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"When slavery ended, the federal government promised to provide “40 acres and a mule” — an idea proposed by Black leaders at the time — to nearly 4 million recently freed men and women. https://t.co/nNBazzngt2","date":"Wed Jun 15 21:50:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"That early proposal helped establish the concept of reparations as compensation to be paid to Black Americans for slavery.  https://t.co/nNBazzngt2","date":"Wed Jun 15 21:50:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The growing call for reparations that began at the close of the Civil War continues to this day. ⁠https://t.co/nNBazzngt2 https://t.co/qooZrUijce","date":"Wed Jun 15 21:50:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In the decade after President Obama introduced DACA protections for Dreamers, the immigrant rights movement has endured plenty of heartache. @greisamartinez speaks with @realcpaz about what comes next. https://t.co/NyyTepYjoY","date":"Wed Jun 15 20:59:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Shipping container homes are the next big trend on AirBnB, but architects are slamming them as \"garbage.\" The verdict?\n\nhttps://t.co/KBzAHnLHVL","date":"Wed Jun 15 20:35:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Prices are going to get worse before they get better (but for different things!) https://t.co/7eipSVM69v","date":"Wed Jun 15 18:12:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4 big questions about Covid-19 vaccines for babies and toddlers https://t.co/z4JKNBkmVV","date":"Wed Jun 15 17:00:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Juneteenth flag is red, white, and blue.\n\nBen Haith, its creator, said it's a reminder that Black Americans descended from enslaved people are exactly that: American. @KenyaTheHunter spoke with Haith to learn more about the flag’s history. https://t.co/LgMNOZ7NB5","date":"Wed Jun 15 15:14:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Through our words, and with imagery by @KaCeyKal, Vox and @CapitalBNews honor Juneteenth and hope that, one day, it will be a yearly celebration observed by a truly free people. https://t.co/HAfrP5kGT2","date":"Wed Jun 15 15:14:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@imillhiser writes on the ways the nation’s founding documents have continually rigged the game for Black Americans. \n\nHe also offers reasons we should remain hopeful about efforts to ensure fairness for future generations. https://t.co/1bqtxIg1qL","date":"Wed Jun 15 15:14:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Incarceration is one of the most glaring examples of how fragile freedom can be for Black Americans.\n\n@ChrisCarrega asks how the land of the free continues to lead the world in putting its residents — predominantly Black men and women — behind bars. https://t.co/7mlmcQXuRs","date":"Wed Jun 15 15:14:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In a time of renewed threats to the sense of safety among African Americans, @jewelwickershow speaks with the founders of a place dubbed Freedom, Georgia, a model of Black self-determination that could soon be the latest idyllic Black settlement community. https://t.co/cDyC72Iwbo","date":"Wed Jun 15 15:14:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s estimated that racism has caused the loss of $70 trillion in wealth for Black Americans.\n\n@FabiolaCineas revisits reparations and the movement demanding a federal commission by Juneteenth. https://t.co/nNBazzngt2","date":"Wed Jun 15 15:14:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Vox has partnered with @CapitalBNews to commemorate Juneteenth by exploring the complex relationship Black Americans have with freedom. https://t.co/HAfrP5kGT2 https://t.co/27Do7Q2VAx","date":"Wed Jun 15 15:14:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"From bucket hats to cooler cans, Julia Craven writes that crass attempts at Juneteenth merch serve as a reminder: “Black people who want to savor America’s sweetest dream must pay for it, again and again.” https://t.co/fyOQ0ShYyR","date":"Wed Jun 15 15:14:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"As Americans celebrate Juneteenth this year, it is difficult not to wonder whether freedom is merely delayed or will be eternally denied for Black Americans.\n\nThat question is exactly why Americans, Black and otherwise, need to honor #Juneteenth. https://t.co/HAfrP5kGT2","date":"Wed Jun 15 15:14:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The federal government started New Mexico’s largest wildfire. It had good intentions. https://t.co/2Pnpr4gmxJ","date":"Wed Jun 15 15:10:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“It’s over-the-top, it’s colorful, it’s excessive, it’s campy.” — @ChrisDStedman https://t.co/SC6fiU9A9Y","date":"Wed Jun 15 13:00:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A person might develop a routine for the sake of accomplishment or productivity. Rituals, on the other hand, encourage mindfulness toward simple tasks. https://t.co/LGHxTRFSzZ","date":"Wed Jun 15 12:01:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The new frontier of “responsible” investing is a bit of a mess. https://t.co/Ial8EkePZO","date":"Wed Jun 15 11:30:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"No, an AI model has not become sentient — but the controversy over Google’s LaMDA model shows why we need to start thinking through what interacting with digital minds will really mean, says @dylanmatt https://t.co/vK0AdevDeq","date":"Wed Jun 15 11:01:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Incarceration is one of the most glaring examples of how fragile freedom can be for Black Americans. https://t.co/CN6bpLoq3r","date":"Wed Jun 15 10:42:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Podcast pioneer Bill Simmons on how to stay relevant https://t.co/D26ZsjyUM7","date":"Wed Jun 15 10:30:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4 winners and 2 losers from the Maine, Nevada, North Dakota, South Carolina primaries. https://t.co/VrQnUHVnLL","date":"Wed Jun 15 05:58:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Finding the anger and purpose in protest, explained by an ACT UP veteran https://t.co/Pl82YNAK70","date":"Tue Jun 14 17:10:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why the return to the office isn’t working https://t.co/q0xQZTp9AP","date":"Tue Jun 14 15:34:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Since 1980, the number of refugees admitted into the US has generally declined, even though the need for resettlement has skyrocketed. https://t.co/XeeHvz3lMs https://t.co/s63dbbxCqD","date":"Tue Jun 14 12:01:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The scandal embroiling Washington’s most venerable think tank, explained https://t.co/wTMkudmGNE","date":"Tue Jun 14 11:30:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Many workers are now back to the office — and they’re not happy about it.\n\nThat’s partly because many return to office rules don’t make sense, and people are only coming in because they have to, not because there’s a good reason to go in. Learn more: https://t.co/DG5cRkpiTG https://t.co/HdELHJrGD1","date":"Tue Jun 14 11:00:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Apple and Google are coming for your car  https://t.co/oO6BmP1T6O","date":"Tue Jun 14 11:00:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Evictions are life-altering — and preventable https://t.co/zzQGO6NMih","date":"Tue Jun 14 10:30:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The January 6 Committee calls Trump out for his scams https://t.co/5sWiVLXI52","date":"Mon Jun 13 21:02:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"No one can be expected to take on climate change alone.\n\n3 ways to drive change, when fossil fuel companies and our leaders won't: https://t.co/gDueK5Hlny https://t.co/yvj4dOjHXj","date":"Mon Jun 13 20:36:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4 things we learned from Monday’s January 6 hearing https://t.co/gjASMFFJZz","date":"Mon Jun 13 20:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Fighting climate change isn’t about what you buy, it’s about how you show up, writes @rebleber.\n\nA citizen's guide to actually making a difference on climate change — in 3 steps: https://t.co/ZfgAZ9G901","date":"Mon Jun 13 20:26:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"This is not another story about why you should feel bad about your carbon footprint.\n\nIt's also not another post about how individuals don’t matter in the fight against climate change. Learn more: https://t.co/gDueK5Hlny https://t.co/BF8pCMTmGA","date":"Mon Jun 13 20:20:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Action protects people from burnout, nihilism, and despair over feeling helpless to stop climate change. \n\nJust as importantly, grassroots power builds collective strength and hope. https://t.co/NPmag0AVWf","date":"Mon Jun 13 20:20:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"After finding some allies in your fight, think about your goal. Your community can help you work backward to figure out what it would take to win. \n\nThinking in terms of power has guided climate campaigners in cities like New York to fight to keep gas out of new buildings. https://t.co/PczZvnb6kN","date":"Mon Jun 13 20:20:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"First, break out of a consumer-only mindset and think about your identities, your workplace, your network, and your privileges.\n\nThis will help you find the appropriate community to link up with. This is important; you can always do more by not acting alone. https://t.co/bYzV3Hs3eS","date":"Mon Jun 13 20:20:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Climate change is all about power. You have more than you think.\n\nHere are 3 ways you can actually effect change —  as a citizen, worker, and community member. https://t.co/are48fdonZ","date":"Mon Jun 13 20:20:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court saved a man from execution in 2020. \n\nIt just took that back. https://t.co/ztwdRZL5hF","date":"Mon Jun 13 19:50:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"To feed, sea lampreys latch onto fish, bore into them, and start sucking down blood and body fluids, often killing their prey in the process. \n\nA single lamprey can kill up to 40 pounds of fish. Learn more: https://t.co/4pFIxlVjxK","date":"Mon Jun 13 19:10:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"They have the body of an eel, the mouth of a sarlacc, and the diet of a vampire.\n\nSea lampreys are blood-hungry parasites native to the Atlantic Ocean and the rivers that flow into it. But more than a century ago, they found their way into the Great Lakes, where they multiplied. https://t.co/T4dyoQbR60","date":"Mon Jun 13 19:09:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The January 6 committee’s first hearing evoked the day of the Capitol attack, held in the same building before a roomful of people who had been there. \n\nThe result was an eerie tension. #January6thHearings https://t.co/NE6DWSRWNM","date":"Mon Jun 13 16:43:52 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Companies have been able to maneuver around this by replacing cold, faceless banks with likable celebrities, who consumers may be more open to.\n\nIt may make consumers overlook the stakes too, even in spaces where the stakes are high, @EmilyStewartM writes. https://t.co/haBbRdF5bR","date":"Mon Jun 13 14:30:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Celebs back financial products and services often, but them doing so specifically with regard to money is worth dwelling on.\n\nWhy is this happening in the first place? In part, because there’s been a decline in trust in traditional financial institutions. https://t.co/haBbRdF5bR","date":"Mon Jun 13 14:29:22 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Amid the current crypto crash, many people are miffed at the celebs who've been shilling for this stuff only to go quiet now.\n\nIf crypto were so likely to make you money, why would it need this many celebrity endorsements? After all, money is the most famous celebrity there is. https://t.co/vS2aVSpFzF","date":"Mon Jun 13 14:27:35 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Don’t let burnout sabotage your job search. https://t.co/erzjI5RA3H","date":"Mon Jun 13 12:01:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How @jaydeitcher almost destroyed his first wedding ceremony — and found joy and connection in the second https://t.co/pWVhedYXz2","date":"Sun Jun 12 12:30:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“We’re expected to be human shields”: Teachers are unprotected — and scared  https://t.co/vg2jfw5qtN","date":"Sun Jun 12 12:00:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The power and limits of using executive orders to protect abortion rights https://t.co/7bJwb64W8K","date":"Sat Jun 11 21:06:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Trying the case at the scene of the crime https://t.co/oIuC0Ylrve","date":"Sat Jun 11 12:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Are corporations and price gouging the inflation enemy Democrats have been looking for? https://t.co/wsPTncCLDd https://t.co/pDG7bkaw5Z","date":"Sat Jun 11 12:00:52 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"We deleted an earlier tweet that included the original headline for this story. We’ve changed the headline for clarity. https://t.co/7VKLTwLsKf","date":"Fri Jun 10 21:03:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"We just got the most comprehensive study of pandemic learning loss https://t.co/7VKLTwupIf","date":"Fri Jun 10 21:03:32 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"No one can be expected to take on climate change alone. Tips from @rebleber on how to make a difference:\n\n1. Think about how your skillset and interests can contribute to climate action\n2. Identify your target\n3. Bring climate change discourse offline https://t.co/ZfgAZ9oxBr","date":"Fri Jun 10 19:46:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The January 6 hearings showed why it’s reasonable to call Trump a fascist https://t.co/SAuYprTfmD","date":"Fri Jun 10 16:20:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ Emotional granularity could make us more aware of our subjective experiences, which in turn makes it easier for us to regulate our emotions and maintain equanimity.\n\nLearn more: https://t.co/HlRlBKgqQO","date":"Fri Jun 10 16:09:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ Psychologists have adopted a term for the ability to distinguish between feelings in an nuanced way: They call it \"emotional granularity.\" \n\nSeveral studies suggest that increasing emotional granularity is good for our mental and physical health. https://t.co/Ll9NcrMihf","date":"Fri Jun 10 16:09:32 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ Words like the ones we highlighted are tantalizing because they're more than words. They're lexical powerhouses that seem to contain entire worldviews.\n\nThey let us see how other cultures parse their experiences, offering more options for how we might understand and live ours. https://t.co/txX9JcPBWU","date":"Fri Jun 10 16:09:31 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ Lomas says people in the West aren't as happy as they could be, in part because they have a limited definition of happiness.\n\nCultures have varying concepts of well-being, but because they're said in languages we may not understand, we're missing out on their insights. https://t.co/wqt0zoezbj","date":"Fri Jun 10 16:09:30 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ Americans are only becoming more miserable, according to the World Happiness Report. Could a few words change that?\n\nPsychologist Tim Lomas claims that learning \"untranslatable words\" from other cultures may be a key to being happy. https://t.co/a0cw1VXu1T","date":"Fri Jun 10 16:09:29 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Jan. 6 hearings opened with new footage of the attack, live witness testimony, and a big focus on Trump. Here's what we learned. https://t.co/FGEyZOxale https://t.co/1NXE1B4Mh1","date":"Fri Jun 10 15:59:51 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The first hearing of the January 6 select committee lived up to the ample hype surrounding it, providing a cogent case — with compelling new details — for Donald Trump’s culpability in the violent effort to overturn the 2020 election. https://t.co/FGEyZOxale","date":"Fri Jun 10 15:55:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Look at what's happening at your state and local level,” says @ACLU's @chasestrangio, and “push your government to be better.”\n\nOn Vox Conversations, Chase and @emilyvdw discuss the assault on the rights of trans Americans taking place in many states.\n\nhttps://t.co/0SyRzlU9XU","date":"Fri Jun 10 15:21:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In 2020 and 2021, Georgia’s grassroots groups helped Democrats win the White House and Senate. \n\nIn 2022, they face their biggest test yet. https://t.co/hrd5BDooCF","date":"Fri Jun 10 13:01:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What happens if you clone Jurassic Park https://t.co/8jieBfVThP","date":"Fri Jun 10 12:01:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Miracles sometimes happen”: The Senate hasn’t given up on gun control — yet https://t.co/jbuakqGL28","date":"Fri Jun 10 11:30:23 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Everyone’s unhappy and no one is showing up: a look at the return to the office https://t.co/aiNRXBQzgU","date":"Fri Jun 10 11:01:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The first January 6 hearing served up surprising revelations — that all point to Trump https://t.co/UfjxsbXxRx","date":"Fri Jun 10 04:29:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The House committee on the Capitol riot hopes for a public reckoning on the events that culminated in the attack.  \n\nTonight's hearing will be the first installment in a series of hearings throughout this month and perhaps into the summer. Follow @Bencjacobs for live updates.","date":"Thu Jun 09 23:55:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The January 6 hearings begin tonight.\n\nFollow @Bencjacobs for live updates.\nhttps://t.co/R82EsHyVJ9","date":"Thu Jun 09 23:35:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Climate change is all about power. You have more than you think\nhttps://t.co/B8Xz7pJTPs","date":"Thu Jun 09 22:09:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"No one can be expected to take on climate change alone. Tips from @rebeleber on how to make a difference:\n\n1. Think about how your skillset and interests can contribute to climate action\n2. Identify your target\n3. Bring climate change discourse offline https://t.co/ZfgAZ9oxBr https://t.co/xmnFT5I3NO","date":"Thu Jun 09 21:43:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Almost no countries in the Global South have signed onto sanctions against Russia. 3 buckets help explain why:\n\n1. Economics and trade\n2. Remaining skepticism toward the US and NATO\n3. Enduring solidarity with Russia https://t.co/QziSuYGnix","date":"Thu Jun 09 21:23:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"\"We have to change the world that we're living in. We have to make more space for people to be open to the possibility that they could self-determine their identity and meaning attached to their bodies in new ways.\" —@ACLU's @chasestrangio","date":"Thu Jun 09 17:56:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"One way all Americans can help protect trans people? Challenge some fundamental assumptions in our culture. \n\nOn Vox Conversations, @emilyvdw talks with @chasestrangio about the assault on the rights of trans Americans.\n\nhttps://t.co/cVPb7jLLFD","date":"Thu Jun 09 17:56:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"But as 3s have become so prevalent in recent years, fans are criticizing the league for being oversaturated with them.\n\nCritics worry that the game is on the verge of becoming boring because everyone is trying to do the same thing. Watch to learn more: https://t.co/2HwdQGkC94","date":"Thu Jun 09 16:36:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Statistic-obsessed sports executive Daryl Morey used the D-league Rio Grande Valley Vipers as a testing ground to see if volume shooting 3s netted better results than shooting 2s.\n\nAnd it worked. https://t.co/Am2Dsjnpgb","date":"Thu Jun 09 16:35:46 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The math says scoring a third of your shots from behind the 3-point line is as good as scoring half of your shots from within. \n\nIn other words: shooting as many 3s as possible will likely lead to a higher score. https://t.co/Am2Dsjnpgb","date":"Thu Jun 09 16:35:46 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"During the 1999 @NBA playoffs, @orlandomagic attempted only 29% of their overall shots behind the 3-point line, the most of any team for that playoff season.\n\nIn 2019, the @houstonrockets shot 51% behind the line. What changed? An understanding of simple statistics. https://t.co/OT1B0haXnS","date":"Thu Jun 09 16:33:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s worth containing monkeypox, even if the latest outbreak hasn’t killed anyone yet https://t.co/ngne4V2u5B","date":"Thu Jun 09 13:37:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Ex-Google CEO Eric Schmidt’s new investment firm deepens his ties to the US military https://t.co/f0K4oRjG89","date":"Thu Jun 09 12:30:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why some countries don’t want to pick a side in Russia’s war in Ukraine https://t.co/CDSis7GQdB","date":"Thu Jun 09 12:20:10 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Parisian Agency is a luxury real estate show featuring the Kretzes, a French family of agents who actually get along. https://t.co/KP24BhRerZ","date":"Thu Jun 09 12:00:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Fighting climate change isn’t about what you buy, it’s about how you show up. https://t.co/xaIr0r3Jvm","date":"Thu Jun 09 11:30:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How do you raise kids in a country that seems to hate them? https://t.co/lTgUFGuFDW","date":"Thu Jun 09 11:00:49 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Much of the advice in the personal finance industry doesn’t account for our human side: the parts of us that crave connection, new experiences, and fitting in.\n\nUnderstanding the emotional side of money is key to financial wellness. https://t.co/K1S7QFQxfy","date":"Thu Jun 09 06:30:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Being a supportive influence when it comes to food becomes even more essential as children become young adults.\n\nA tip from an expert: Make sure your kids know they don’t have to be trying to accomplish anything with food: “You can just eat and exist.” https://t.co/pXXyCXOJBd","date":"Thu Jun 09 05:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"FTC Chair Lina Khan’s plan to take on Big Tech, in 9 questions https://t.co/v8InQBv0do","date":"Thu Jun 09 04:00:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Take a deep breath: it's ok to just have a few close friends. \n\nExperts explain the power of nurturing just a few close friendships for yourself and for your mental wellbeing. https://t.co/TVmaeLMszX","date":"Thu Jun 09 03:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Synthetic fibers come off in the wash and pass through to sewage treatment plants. Treated wastewater is then  often dumped into rivers or the sea.\n\nHere is how many of these fibers could be shed in the wash. #WorldOceansDay https://t.co/sKKNqSRkEb","date":"Wed Jun 08 20:36:22 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Worldwide, there are robust efforts to reduce plastic use.\n\nAs we seek solutions to the overall issue of plastic pollution, we need to recognize that our clothing is a major part of the problem and will need to be part of the solution as well. Learn more: https://t.co/2VaHTsZTNh","date":"Wed Jun 08 20:31:55 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Polyester, nylon, acrylic, and other synthetic fibers are all forms of plastic.\n\nThey can eventually reach the ocean, adding to the microplastic pollution that's accumulating in the food chain and being ingested by marine wildlife, and even us. https://t.co/2VaHTsZTNh","date":"Wed Jun 08 20:30:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Today is World Oceans Day — and 60% of all clothing worldwide is made from plastic. They leach into the environment just by being washed.\n\nEstimates vary, but it's possible that a single laundry load could release hundreds of thousands of plastic fibers into the water supply. https://t.co/NqODKk8jo2","date":"Wed Jun 08 20:28:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Read more about the solutions @umairfan explored in the @TwitterSpaces in this piece on the air conditioning paradox. https://t.co/AvAwFsLBUc","date":"Wed Jun 08 19:53:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Have questions? Join us now with Vox reporters @neel_dhan, @rebleber, and @umairfan for a discussion hosted by @nhassenfeld ⬇️ https://t.co/yqw9B8NQXv","date":"Wed Jun 08 19:53:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In Vox's @TwitterSpaces, @neel_dhan discussed the low-tech, time-tested, and far less sexy climate solution: insulation. https://t.co/3OAw8WQTJJ","date":"Wed Jun 08 19:53:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Here's the conversation @rebleber mentioned in the Spaces with @ericdeanwilson on the argument that in the US, and even around the world, a big cultural shift could lead to a more communal idea of cooling. https://t.co/pzQOitjepf","date":"Wed Jun 08 19:53:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Humans are relying on air conditioning more in a warming world. Paradoxically, AC is making the climate crisis worse.\n\nJoin us now with Vox reporters @neel_dhan, @rebleber, and @umairfan for a discussion hosted by @nhassenfeld on how to break the cycle. https://t.co/rtSaf0d1en","date":"Wed Jun 08 19:33:42 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The close primary race to be Los Angeles’ mayor is going to a runoff. That might be bad news for the former Republican-turned-Democrat billionaire developer trying to win. https://t.co/xlBxMrcmbD","date":"Wed Jun 08 19:00:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Humans are relying on air conditioning more in a warming world. Paradoxically, AC is making the climate crisis worse.\nJoin Vox reporters @neel_dhan, @rebleber, and @umairfan for a discussion hosted by Unexplainable's @nhassenfeld on how to break the cycle. https://t.co/rtSaf0d1en","date":"Wed Jun 08 17:18:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court gives federal law enforcement sweeping immunity from lawsuits. https://t.co/xCseRbQ1Rm","date":"Wed Jun 08 17:00:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why Joe Biden is invoking a war power to build heat pumps and solar panels https://t.co/WHBIg3Gn9W","date":"Wed Jun 08 16:01:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Have questions you want our reporters to answer? Fill out this form. https://t.co/7g0HkIacgC","date":"Wed Jun 08 15:59:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Humans are relying on air conditioning more in a warming world. Paradoxically, AC is making the climate crisis worse.\n\nJoin @neel_dhan, @rebleber, and @umairfan on @TwitterSpaces today at 3:30 pm ET for a discussion on how we can break the cycle. https://t.co/rtSaf0d1en","date":"Wed Jun 08 15:59:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Comprehensive, chronological and thorough”: The January 6 committee seeks a full reckoning with its slew of summer hearings https://t.co/169W3ppBpa","date":"Wed Jun 08 14:25:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Was there a technologically advanced species living on Earth long before humans? And if one had existed, how would we know?\n\nListen to the first episode of Unexplainable's new three-part series, Lost Worlds, wherever you find podcasts: https://t.co/ou9O3ZqhPB https://t.co/8UZxdds6PX","date":"Wed Jun 08 13:50:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Red states aren’t following Florida’s lead on gun control https://t.co/BdLlSlAljF","date":"Wed Jun 08 13:30:29 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5 winners and 2 losers from the California, Iowa, Mississippi, Montana, New Jersey, New Mexico, and South Dakota primaries https://t.co/HNNZbveVhw","date":"Wed Jun 08 13:22:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why teenage fangirls are dismissed as hysterical https://t.co/UNvNjpcTTx","date":"Wed Jun 08 13:01:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A new novel strives to split the difference between being a good artist and a good person. https://t.co/4tIDBOeeS0","date":"Wed Jun 08 12:30:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Stop telling kids that climate change will destroy their world  https://t.co/uRTiK4Sulq","date":"Wed Jun 08 12:10:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The depressing truth about the January 6 committee’s public hearings https://t.co/sWBUXaX9dx","date":"Wed Jun 08 12:01:46 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Is the economy actually bad, or is it just bad vibes? https://t.co/IETveHdLFb","date":"Wed Jun 08 11:30:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Much of the advice in the personal finance industry doesn’t account for our human side: the parts of us that crave connection, new experiences, and fitting in.\n\nUnderstanding the emotional side of money is key to financial wellness. https://t.co/nmFod5zm1O","date":"Wed Jun 08 10:30:35 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Are we done talking about Web3 already? https://t.co/0trlAjDZWr","date":"Wed Jun 08 10:30:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"You don’t need a roster dozens deep to enjoy the fruits of friendship. Realizing the potential of fostering a few, intimate relationships, can be empowering. \n\n@allieevolpe examines why you need fewer friends than you think. https://t.co/qZJxR3pCCE","date":"Wed Jun 08 10:00:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Being a supportive influence when it comes to food becomes even more essential as children become young adults.\n\nA tip from an expert: Make sure your kids know they don’t have to be trying to accomplish anything with food: “You can just eat and exist.” https://t.co/8VHHFjvLcM","date":"Wed Jun 08 10:00:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Take a deep breath: it's ok to just have a few close friends. \n\nExperts explain the power of nurturing just a few close friendships for yourself and for your mental wellbeing. https://t.co/26ohPm2XwR","date":"Tue Jun 07 23:50:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s time for a new objective when it comes to food, especially for tweens and teens.\n\nFor Vox’s new section Even Better, @ahazlett talks to experts about how to help kids have a peaceful relationship with their bodies and what they eat. https://t.co/aeafQQYHb4","date":"Tue Jun 07 22:46:48 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"No amount of nitty-gritty knowledge about interest rates will change the fact that most of our decisions around money are emotional.\n\nFor Vox’s new section Even Better, @mindmnybalance explains how to think about your financial decisions. https://t.co/ICrtEtdT99","date":"Tue Jun 07 21:46:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ As Smalls tries to expand his campaign on a national level, he says the ALU is making changes to become more of a \"bona fide union.\"\n\nLearn more: https://t.co/DWwqLuDeOf","date":"Tue Jun 07 21:30:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ Workers at about 100 Amazon warehouses in the US have contacted the Amazon Labor Union asking how they can start their own union campaigns, Smalls says, and he wants to lead them. \n\nTo do that, he’ll need more support — politically, financially, and logistically. https://t.co/WtxAmR1aK8","date":"Tue Jun 07 21:30:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ The stakes are incredibly high. \n\nAmazon is the nation’s second-largest private employer, and it helps set the standard for baseline labor conditions at many companies across the US. https://t.co/jsuMG452S9","date":"Tue Jun 07 21:30:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ In an interview with @Recode senior reporter @shiringhaffary, Smalls reveals what's next for the face of America's new labor movement. https://t.co/xtaMDjzkzQ","date":"Tue Jun 07 21:30:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ Meet @Shut_downAmazon, a leader of the Amazon Labor Union.\n\nThe former Amazon warehouse manager was fired during the pandemic. He is now now leading a resurgent labor movement sweeping the country. https://t.co/RJzNMbcVBq","date":"Tue Jun 07 21:30:23 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The new novel Immortal King Rao is sprawling, gripping, and ambitious. Join the Vox Book Club in reading it this June. https://t.co/TkinQi64hv","date":"Tue Jun 07 20:30:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Have questions you want our reporters to answer? Fill out this form. https://t.co/48tvYzVGsW","date":"Tue Jun 07 19:45:54 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Buildings account for 40% of all US energy use, more than half of which goes toward heating and cooling.\n\nIt's time we start thinking more about a low-tech, time-tested, and far less sexy solution: insulation, @neel_dhan writes. https://t.co/3OAw8WQTJJ","date":"Tue Jun 07 19:45:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Here, @umairfan reports on how tactics for cooling can end up worsening the very problem they’re trying to solve. And the people who stand to experience the most extreme heat are often those least able to cool off. https://t.co/AvAwFsLBUc","date":"Tue Jun 07 19:45:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The rise of ACs has an enormous cost. @rebleber spoke to @ericdeanwilson about the argument that in the US, and even around the world, a big cultural shift could lead to a more communal idea of cooling. https://t.co/pzQOitjepf","date":"Tue Jun 07 19:45:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Humans are relying on air conditioning more in a warming world. Paradoxically, AC is making the climate crisis worse. \n\nJoin Vox reporters @neel_dhan, @rebleber, and @umairfan on @TwitterSpaces for a discussion on how we can break the cycle. https://t.co/rtSaf0d1en","date":"Tue Jun 07 19:45:52 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Amazon fired Chris Smalls. Now the new union leader is one of its biggest problems. https://t.co/KRgfXNOxwj","date":"Tue Jun 07 18:46:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"To do that, @Shut_downAmazon and the ALU will need more support — politically, financially, and logistically — to face the uphill battle to unionize Amazon. \n\nThe stakes are incredibly high. https://t.co/DWwqLulDpF","date":"Tue Jun 07 18:43:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"If the ALU can win more warehouses, it could propel a growing class of workers who are forming unions — not just at Amazon, but at other major employers like Starbucks, Apple, and Dollar General — to demand a better quality of life from their employers. https://t.co/DWwqLulDpF","date":"Tue Jun 07 18:43:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Just days after the second union vote, Smalls testified before Congress about Amazon’s union-busting tactics.\n\nHis performance in DC revealed how, despite having no formal media training or background, he has captured the entire country’s attention. https://t.co/DWwqLulDpF","date":"Tue Jun 07 18:43:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"However, the ALU faces significant challenges. If it doesn’t successfully pressure Amazon to deliver on some of the ambitious demands it campaigned on, it could lose the momentum it took a year to build.\n\n“We’ve got 10,000 people’s lives in our hands.” https://t.co/DWwqLulDpF","date":"Tue Jun 07 18:43:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Amazon workers at about 100 Amazon warehouses in the US have contacted the ALU asking how they can start their own union campaigns, and Smalls wants to be the one to lead them. https://t.co/DWwqLulDpF https://t.co/Xo1wcuRxQl","date":"Tue Jun 07 18:43:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Chris Smalls and his former colleagues, organizing under the banner of the newly formed Amazon Labor Union, surprised the world in early April by doing what many thought was impossible: leading the first successful US union campaign at Amazon. https://t.co/DWwqLulDpF https://t.co/EGoTn4e5Xn","date":"Tue Jun 07 18:43:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A few days later, the ALU lost its second vote at Amazon’s Staten Island LDJ5 warehouse — in large part, @Shut_downAmazon said, due to Amazon’s ramped-up anti-union campaigning. \n\nIt hasn’t minimized Smalls’s or the ALU’s ambitions. https://t.co/DWwqLulDpF","date":"Tue Jun 07 18:43:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why some voters are trying to recall San Francisco’s progressive DA https://t.co/fNqSzn1MZ3","date":"Tue Jun 07 18:30:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Southern Baptist Convention, America’s largest Protestant denomination, covered up sexual abuse for decades.\n\nFixing the problem may require a lot more than systemic reforms. https://t.co/1VgIBszxHb","date":"Tue Jun 07 14:40:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Inside the secret network of women who performed abortions before Roe https://t.co/LRMvvrDRX5","date":"Tue Jun 07 13:00:54 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why meat is so expensive right now https://t.co/qPuuz4dNuP","date":"Tue Jun 07 12:01:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What the TSA could teach Congress about gun control https://t.co/hHwR6zVhTe","date":"Tue Jun 07 11:30:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“So much ‘no’ in their lives”: What the pandemic took from America’s youngest kids https://t.co/moEPrxTDe5","date":"Tue Jun 07 11:00:44 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Amazon fired Chris Smalls. Now the new union leader is one of its biggest problems. https://t.co/oqbKwlB1Fp","date":"Tue Jun 07 10:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Boris Johnson barely survives a challenge to his leadership https://t.co/cUTHslyCvp","date":"Mon Jun 06 21:20:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"When it comes to friendship, quality is better than quantity.\n\nhttps://t.co/MJkFL97wbu","date":"Mon Jun 06 21:19:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How many friends do you really need? \n\nExperts say just a few close ones. Learn more: https://t.co/uN3W27RIai https://t.co/zGm9Cg3l7j","date":"Mon Jun 06 21:17:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"6/ Even Better will showcase reporting on many aspects of modern life:\n\n🧠Mental health\n🧑‍🤝‍🧑 Relationships of all kinds \n🫂 Community \n💼 Work\n💰 Money\n...and so much more.\n\nLearn about it here: https://t.co/VZgWv49rii","date":"Mon Jun 06 20:45:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ While there are no hard-and-fast rules about how many close friends a person should have, a telltale sign you need more is if you feel lonely, as one expert put it.\n\nFocusing on your community can help blunt the effects of loneliness. https://t.co/zKvZtC6Czd","date":"Mon Jun 06 20:33:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ It's one thing to say you have friends, but it's another to actually spend time with them.\n\nIf you're looking to deepen select friendships, you'll need to share time and space. Learn how to foster these relationships here: https://t.co/TVmaeLMszX","date":"Mon Jun 06 20:33:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ Having lots of friends has benefits. People who regularly interacted with 10 or more friends in midlife have higher levels of well-being than those who had fewer than 10.\n\nBut you don't need a roster dozens deep to feel fulfilled. Even one friend is a net positive. https://t.co/uanrFXg3Zd","date":"Mon Jun 06 20:33:52 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ After two years of pandemic life, you could find yourself at a fork in the friendship road, choosing between a small social circle and becoming overextended.\n\nExperts say realizing the potential of fostering just a few intimate relationships, however, can be empowering. https://t.co/D4ByD4msrc","date":"Mon Jun 06 20:33:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ Today we launched Even Better, a new section focused on giving you direct, actionable advice for living a better life. \n\nFor the launch of this section, @allieevolpe makes the case for fewer friends. https://t.co/yPL8zAXOp0","date":"Mon Jun 06 20:33:48 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"California’s primaries on Tuesday might offer a few insights into the future of the state’s Democratic party — and its liabilities https://t.co/Au9NjuZmsF","date":"Mon Jun 06 19:30:10 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court gives workers a backhanded, insulting victory https://t.co/hqnB5FybrD","date":"Mon Jun 06 18:00:23 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It’s hard to wrap our heads around all the health consequences of gun violence — but we need to try. https://t.co/jCOSCgzyZP","date":"Mon Jun 06 17:15:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Our reporters want to hear about the topics you'd like them to address. \n\nWhether it's about physical health, mental health, and personal wellness; friends, family, and community; or work and money and beyond, no question is too big or too small. https://t.co/bev2XWyC5v","date":"Mon Jun 06 16:00:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Much of the advice in the personal finance industry doesn’t account for our human side: the parts of us that crave connection, new experiences, and fitting in.\n\nUnderstanding the emotional side of money is key to financial wellness. https://t.co/K1S7QG8876","date":"Mon Jun 06 16:00:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Being a supportive influence when it comes to food becomes even more essential as children become young adults.\n\nA tip from an expert: Make sure your kids know they don’t have to be trying to accomplish anything with food: “You can just eat and exist.” https://t.co/pXXyCY6ksL","date":"Mon Jun 06 16:00:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Take a deep breath: it's ok to just have a few close friends. \n\nExperts explain the power of nurturing just a few close friendships for yourself and for your mental wellbeing. https://t.co/TVmaeLuRbn","date":"Mon Jun 06 16:00:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Welcome to Even Better, a brand new section from Vox dedicated to helping people live better lives. \n\nKeep an eye out for stories on mental health, relationships of all kinds, community, work, money, and more. https://t.co/VZgWv4r29Q","date":"Mon Jun 06 16:00:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@seanilling yay! you love to see it!","date":"Mon Jun 06 14:47:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"But air conditioning can end up worsening the very problem it's trying to solve.\n\nAnd the people who stand to experience the most extreme heat are often those least able to cool off. Learn more: https://t.co/AvAwFsu12E","date":"Mon Jun 06 14:28:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Cooling systems like ACs, fans, and ventilation account for about 20% of energy use in buildings globally. \n\nThat’s about 2.5x as much electricity consumed globally for cooling as is used by the entire continent of Africa. https://t.co/AvAwFsu12E","date":"Mon Jun 06 14:27:40 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Air conditioning has huge climate costs. The world needs more of it.\n\nIt's a paradox. https://t.co/dxOaHvoj6c","date":"Mon Jun 06 14:27:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Have deepfakes ruined fandom and the internet? The case of Zhang Zhehan says maybe. https://t.co/4WmyWOEPYk","date":"Mon Jun 06 12:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“If people can’t struggle for justice and peace, then they’ll struggle against justice and peace because it’s a part of human nature that we want to struggle.” \n\n@FukuyamaFrancis talks to @seanilling for a recent episode of Vox Conversations\n https://t.co/tE4tPfWrBF","date":"Mon Jun 06 12:10:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The chart above tells a tragic story: lives taken too soon. \n\nBut it also highlights how policy action can move the needle on saving lives – and how policy neglect can deepen a preventable tragedy. Learn more: https://t.co/xm0C9mKJ7Y","date":"Mon Jun 06 12:02:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Vox's @muizz_akhtar notes that while guns have long been a fixture of US life, the \"emergence of firearms as the leading killer of young people is a relatively new phenomenon.\" https://t.co/xm0C9mKJ7Y","date":"Mon Jun 06 12:01:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Guns kill more young Americans ages 1 to 24 than cars now, but it doesn't have to be that way. \n\nWhat would it mean to treat guns the way we treat cars? https://t.co/4rEqIRux9s","date":"Mon Jun 06 12:01:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The environmental limits of eating local   https://t.co/7VQfC0aQjz","date":"Mon Jun 06 12:01:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"June 30 is the latest day for Congress to authorize the waivers.\n\nSummer programs that offer free meals to students have already been affected. Learn more: https://t.co/6zkDLC9JGl","date":"Mon Jun 06 11:57:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Federal school meal waivers kept children fed during the pandemic. Congress might let them lapse.\n\nIt's hard to learn, or do much of anything, if you’re hungry. https://t.co/0qvzWnU5Un","date":"Mon Jun 06 11:57:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The way the United States pays for nurses is broken  https://t.co/wDsIgjJJau","date":"Mon Jun 06 11:30:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"You might need fewer friends than you think. https://t.co/Bto1oC9GTD","date":"Mon Jun 06 10:00:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Constitution protects gun ownership — but doesn’t prevent state regulations https://t.co/XOHn1NztYC","date":"Sun Jun 05 21:16:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"If cars went one way with safety over decades in America, guns went the other https://t.co/mnRY8htdtl","date":"Sun Jun 05 13:30:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Cornel West’s pragmatic America https://t.co/9pLYZ1PRZl","date":"Sun Jun 05 12:30:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Finding community as an adult can be difficult — and especially so, after the disruptions of the last few years.\n\n@allieevolpe spoke with four experts who provided tips on how you can identify and find like minded-people. https://t.co/LI3Hd00Jx0","date":"Sat Jun 04 23:11:37 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The sheer number of choices that require attention can be exhausting.\n\n@allieevolpe spoke with three experts who explain how to make smarter decisions. https://t.co/ni46wEW80T","date":"Sat Jun 04 22:08:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Long-range missiles from the US head to the sluggish, brutal war in the Donbas. https://t.co/nHHHR9dxo6","date":"Sat Jun 04 20:54:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"New York’s attorney general calls out Verizon for spreading Legionnaires’ disease  https://t.co/DiJEgox7hX","date":"Sat Jun 04 13:01:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"President Biden has a new strategy to fight inflation, and part of it involves an old Republican priority https://t.co/ET27sj7vKn","date":"Sat Jun 04 12:00:30 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Here are some expert-recommended strategies on how to get your kid to take care of things without having to constantly remind them https://t.co/UNgqNAkKBm","date":"Fri Jun 03 23:58:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Money is a touchy subject in relationships — even in friendships. \n\n@allieevolpe spoke to four experts to help you navigate money talk with your inner circle. https://t.co/suAIJElFvW","date":"Fri Jun 03 22:58:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Talking about money can be uncomfortable, even with those closest to you, but it doesn't have to be. \n\nTo help you navigate these conversations, @allieevolpe reached out to four experts for advice. https://t.co/v7Mv4Ch4RO","date":"Fri Jun 03 21:54:43 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Business is booming for crypto scammers https://t.co/DOGpQ4JbIB","date":"Fri Jun 03 19:10:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"100 days in, Russia’s war is now a brutal offensive in eastern Ukraine https://t.co/0VyBtTYtRM","date":"Fri Jun 03 17:20:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"This story is from The Big Squeeze, @EmilyStewartM's  column on the ways we're all being squeezed under capitalism, and how so many scams mess with our money, our time, our hearts, and our minds.\n\nSign up to get this column in your inbox: https://t.co/Jh9fzMUDdz","date":"Fri Jun 03 16:44:51 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"At the airport, travelers are split based on what they're willing to pay — in the security line, at the gate, and where they sit on the plane.\n\nInstead of letting people pay to get ahead, what if the whole ordeal was improved for everyone? https://t.co/UK7TH1Yjon","date":"Fri Jun 03 16:41:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"For some travelers, those costlier options are worth it. (This writer has TSA PreCheck, and greatly enjoys it.) \n\nBut that you're inclined to pay at all points to a bigger issue, @EmilyStewartM argues. https://t.co/UuP9p4jTMD","date":"Fri Jun 03 16:39:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Programs like TSA PreCheck and CLEAR help travelers cut down on time, jump to the front of the line, or go to a different line altogether.\n\nThose options are going to cost you. They also split travelers into haves and have-nots, @EmilyStewartM writes. https://t.co/UK7TH1Yjon","date":"Fri Jun 03 16:35:41 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In general, the airport is not fun, considering:\n✈️ Flight delays\n💬 Long lines\n🧳 Lost luggage\n👟 Disrobing at security\n\nThis summer, as airline travel nears pre-pandemic levels, it could be even more of a mess. You can make it little less miserable … if you're willing to pay. https://t.co/SRbWp390Ah","date":"Fri Jun 03 16:34:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Blue states are responding to Uvalde https://t.co/iy9HC1l3e5","date":"Fri Jun 03 16:30:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court is about to rule on another scary voting rights case https://t.co/2JB1aLgvql","date":"Fri Jun 03 14:30:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Fire Island is at its best when it doesn’t shy away from the tougher aspects of gay desire https://t.co/dkTIDfvHO4","date":"Fri Jun 03 12:30:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":".@dylanmatt explains his love for Margin Call, a low-budget 2011 corporate thriller that understands the moral compromises inherent in a modern workplace https://t.co/k4ErIKkO2O","date":"Fri Jun 03 12:30:10 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In the absence of federal action, can anything move the needle on firearm deaths?  https://t.co/kN4LVKLdd4","date":"Fri Jun 03 11:00:54 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Leaked transcript: What Mark Zuckerberg told Meta employees about Sheryl Sandberg’s exit  https://t.co/7EyMxlpR5U","date":"Fri Jun 03 00:31:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"\"Each shooting created concentric circles of trauma.\" How the earliest generations of school shooting survivors, now in their 30s and 40s, are still grappling with the aftermath.\nhttps://t.co/BiyEU2OL9X","date":"Fri Jun 03 00:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"One of the lessons of Me Too was supposed to be that victims do not have to be perfect to deserve justice, and that people who have behaved badly still do not deserve to be abused. \n\nThat lesson seems to have vanished here. https://t.co/fzBcEMMkCy","date":"Thu Jun 02 21:17:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"If Heard is not a perfect victim, if at times she instigated violent encounters with Depp, that does not change the fact that Depp had power over Heard that she did not have over him. https://t.co/fzBcEMMkCy","date":"Thu Jun 02 21:17:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It's true there is compelling evidence that Heard behaved violently toward Depp as well. But Depp at all times had more power than Heard. \n\nHe was older, richer, more famous, and more beloved. https://t.co/fzBcEMMkCy","date":"Thu Jun 02 21:16:31 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"We spent the past five years undertaking a cultural reckoning about the wronged women of the '90s and ’00s.\n\nBut when a jury ordered Amber Heard to pay $15 million in damages to Depp although compelling evidence suggests he abused her, #AmberTurd trended. https://t.co/fzBcEMMkCy","date":"Thu Jun 02 21:16:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The verdict is likely to have a \"chilling effect on other victims of domestic violence who might want to step forward,\" writes Grady. \nhttps://t.co/fzBcEMMkCy","date":"Thu Jun 02 21:12:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Johnny Depp's legal victory and the likely overturning of Roe v. Wade are part of the same toxic cultural movement, argues Vox senior correspondent Constance Grady.\n\nHere is where the reaction leaves us: https://t.co/jGAICzK4SC","date":"Thu Jun 02 21:11:40 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@B_resnick AMAZING NEWS!","date":"Thu Jun 02 20:42:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Sheryl Sandberg, who turned Facebook into a profitable business, leaves behind a series of controversies. How the end of her tenure at Facebook and Meta marks the end of one of the most notable trajectories in the tech industry https://t.co/UvGMI01n9f","date":"Thu Jun 02 20:24:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why there’s still a formula shortage https://t.co/NnrGgVG3zl","date":"Thu Jun 02 20:10:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ \"Unfortunately, what many Americans want is not being reflected in America's law,” writes @ranimolla. \n\nLearn more: https://t.co/4N1shVW9uS","date":"Thu Jun 02 19:10:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ Many of those gun control policies are part of kitchen table discussions being had right now across the country. \n\nEnacting them could go a long way toward stopping the next mass shooting and violent crime, reports @ranimolla. https://t.co/4N1shVW9uS","date":"Thu Jun 02 19:10:35 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ Bans on assault weapons and high-capacity ammunition magazines have an approval rating of over 60% in the US. https://t.co/HIpmKo1iep","date":"Thu Jun 02 19:10:34 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ Americans overwhelmingly support background checks, according to a whole lot of surveys.\n\nThis would mean all sellers would have to verify that a person doesn't have a history of violent crime or domestic abuse before they can buy a gun. https://t.co/TBMbctf49o","date":"Thu Jun 02 19:10:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ Polling is clear: Americans want gun control.\n\nVoters across the political spectrum overwhelmingly support mental health rescissions on gun ownership. https://t.co/vM57ImcWaH","date":"Thu Jun 02 19:10:30 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"House Democrats’ sweeping gun control package could be even bigger https://t.co/USafP3NKtX","date":"Thu Jun 02 18:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The end of Sheryl Sandberg’s tenure at Facebook and Meta marks the end of one of the most notable trajectories in the tech industry. \n\n@shiringhaffary takes a look inside Sandberg’s mixed legacy. https://t.co/c3uwJyUgJb","date":"Thu Jun 02 18:11:29 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What does Johnny Depp’s legal victory mean for the Me Too movement? https://t.co/U872lpjBLk","date":"Thu Jun 02 16:50:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"This week on The Weeds, Vox politics reporter @nicolenarea joins hosts @dylanmatt and @DLind to discuss studies on gun policy, which gun control measures are most effective, and more. \n\n🎧Listen to The Weeds wherever you find podcasts. https://t.co/aGccVePZf9","date":"Thu Jun 02 16:46:29 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Sheryl Sandberg’s mixed legacy at Meta https://t.co/mhpVg0ajvI","date":"Thu Jun 02 16:30:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The simple, impactful way to make cars cleaner https://t.co/Qzm87uZNfK","date":"Thu Jun 02 12:20:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The rich and famous are not rich because of crypto. https://t.co/k4dpb4WHR7","date":"Thu Jun 02 12:01:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The problem with schools turning to surveillance after mass shootings https://t.co/wOwuTxufG1","date":"Thu Jun 02 11:30:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The environmental costs of war are insidious, quietly harming people and wildlife for decades after the fighting stops. https://t.co/CcgNUFwrJc","date":"Thu Jun 02 11:00:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Correction: We deleted a previous tweet that misstated the amount Johnny Depp was awarded in the verdict. It was $15 million. That includes $5 million in punitive damages, which was capped to $350,000 per Virginia law. In total, he is entitled to $10.35 million.","date":"Thu Jun 02 01:50:41 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Depp was awarded $15 million in damages, including $5 million in punitive damages, which the judge capped to $350,000, the legal limit in Virginia; in total, he is entitled to $10.35 million.","date":"Thu Jun 02 01:45:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Johnny Depp has won his defamation trial against Amber Heard, and Amber Heard has lost most of her countersuit. https://t.co/zkPzqc1D1R","date":"Thu Jun 02 01:44:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How to prevent another white supremacist massacre  https://t.co/2JS7YFI4PM","date":"Wed Jun 01 16:10:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Energy access pervades all areas of life, yet many countries don't have the energy they need to thrive and survive in a warming world, @SioBhanBhan writes.\n\nThe world needs to prioritize how to get higher levels of energy to these countries. Learn more: https://t.co/fyIK0Af4GI","date":"Wed Jun 01 14:23:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A fridge in the US consumes more energy in a year than an individual in many countries.\n\nThe energy gap shown in this chart is one of the starkest examples of global economic inequality. https://t.co/fgYjTafeDn","date":"Wed Jun 01 14:20:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"For now, these remain a minority of cases, though they've been detected in wastewater in the US. \n\nThey will likely fuel more Covid-19 cases this summer, especially as the summer heat forces people back indoors. Learn more: https://t.co/z9QccXZmxd","date":"Wed Jun 01 13:55:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The omicron variant of Covid-19 has branched out into more transmissible and evasive versions: BA.2.12.1, BA.4, and BA.5.\n\nThese subvariants appear more likely to cause breakthrough infections and reinfections, though they don’t appear to cause any different symptoms. https://t.co/zBwXzjNmbK","date":"Wed Jun 01 13:54:57 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Staring down 30 at the Taylor Swift dance party https://t.co/lz68XKnD4v","date":"Wed Jun 01 13:01:27 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Until the Industrial Revolution, the vast majority of humans lived in bitter poverty. Two economic historians explain what changed. https://t.co/UEnZBUnNfe","date":"Wed Jun 01 12:30:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A lovely, sad Irish legend is at the center of two wonderful films that help kids process grief. https://t.co/9nQSHgNIpx","date":"Wed Jun 01 12:01:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Letting federal school meal waivers expire would be a disaster https://t.co/S2wXLjR8c8","date":"Wed Jun 01 11:30:14 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What will the EU’s Russian oil ban do? https://t.co/twaLsbdl1J","date":"Wed Jun 01 11:10:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"If it were up to Americans, the country would have stricter gun laws https://t.co/jqkk0X5FKZ","date":"Wed Jun 01 11:01:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Netflix slips and Hollywood cheers. Maybe it shouldn’t. https://t.co/bSXIkL9OZa","date":"Wed Jun 01 10:30:17 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Republicans’ strategy ahead of the first public hearings of the select committee investigating the January 6 attack on the Capitol reveals a rare glimpse of daylight between the aims of the party and the desires of former President Donald Trump. https://t.co/C2YkHHwU1W","date":"Wed Jun 01 02:00:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ Watch to learn more about the massacre of Tulsa’s “Black Wall Street” here: https://t.co/br1wGj6NTM","date":"Tue May 31 23:41:32 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ In 2019, Vox producer @ranjchak went to Tulsa to speak to residents and historians there. \n\n\"This entire historic community was obliterated.\"\n\n\"It was an absolute massacre.\"\n\n\"I was an adult before I ever heard about it.\"","date":"Tue May 31 23:40:42 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ Many residents still have questions about what happened then. For one, where were the bodies of the victims?\n\nIn 2018, Mayor G.T. Bynum reopened the investigation, and the city of Tulsa has since performed two excavations: https://t.co/Bq2YjZkegc https://t.co/dSBDpgPQk3","date":"Tue May 31 23:40:16 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ For nearly 100 years, the story of the massacre and the razing of one of America’s affluent Black communities remained untold until pop culture and politicians brought renewed focus to #Tulsa.\n\nhttps://t.co/813mR6r9Pj https://t.co/itvcPRtWJ3","date":"Tue May 31 23:39:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court shuts down Texas’s attempt to seize control of Twitter — for now. https://t.co/TN7wH8wyHG","date":"Tue May 31 23:30:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ 101 years ago, a white mob destroyed an American neighborhood in #Tulsa, Oklahoma, in the Greenwood District — known then as “Black Wall Street” — murdering as many as 300 Black people.\n\nhttps://t.co/br1wGj6NTM https://t.co/X5TiiVG7v2","date":"Tue May 31 23:09:39 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In a document obtained by Vox, the RNC recommends pushing back on the select committee while taking care not to be seen as explicitly speaking on behalf of Trump. \nhttps://t.co/xLbeQP9YFE","date":"Tue May 31 21:23:59 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Having a song blow up on TikTok can take you from obscurity to the top of the charts overnight. But can you actually make a music career out of a viral break?\n\nWe teamed up with @puddingviz to find out.\n\nhttps://t.co/wNwMpI8uHw","date":"Tue May 31 21:08:50 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What the GOP wants — and what Trump wants — as the January 6 committee ramps up  https://t.co/c9rxDeEDGx","date":"Tue May 31 20:47:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ It's hard to know for sure how much of the drop in homicides and suicides was caused specifically by the gun buyback program and other legal change, but researchers say it likely played a significant role.\n\nLearn more about Australia's buyback program: https://t.co/2JDwd8l12V","date":"Tue May 31 19:55:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ In 1996, Australia passed the National Firearms Agreement, which:\n• Restricted gun ownership rights\n• Created a national firearms registry\n• Required a permit for all new firearm purchases\n• Banned automatic and semi-automatic rifles and shotguns\nhttps://t.co/2JDwd8l12V","date":"Tue May 31 19:55:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ In the seven years after the program was created, Australia's average gun suicide rate fell by 57% and its average gun homicide rate fell by 42%.\nhttps://t.co/2JDwd8l12V","date":"Tue May 31 19:55:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ In the late 1990s, Australia addressed its own gun violence problem by seizing roughly 650,000 privately held guns, about 20% of all privately owned guns in the country.\n\nIt was one of the largest gun buyback programs in recent history.\nhttps://t.co/2JDwd8l12V","date":"Tue May 31 19:55:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ Australia has only had two mass shootings since 1996. The US has had more than 200 this year. \n\nNote: Mass shootings are defined in this context as 4+ dead, not including the shooter. The two Australian cases resulted in 4 people killed by a shooter, the minimum threshold. https://t.co/cRRySZ8fNc","date":"Tue May 31 19:55:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What if someone told you that you could prevent a serious crime — a robbery, say, or maybe even a murder — just by shelling out $1.50? https://t.co/V9jOdr56x8","date":"Tue May 31 12:20:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The young, rich, anti-capitalist capitalists https://t.co/cSFFCbDfI2","date":"Tue May 31 11:00:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The year’s most prestigious film festival concluded last weekend in #Cannes. Here are 15 unmissable movies from the fest, and how you’ll be able to watch them soon. https://t.co/EgmR60SeL7","date":"Mon May 30 13:01:10 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Tell your boss: Working from home is making you more productive  https://t.co/Yggwg3FIah","date":"Mon May 30 12:00:56 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Teachers don’t support these proposals either. https://t.co/YqsFNj72nU","date":"Sun May 29 21:22:29 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Texas grid is designed to fail   https://t.co/dRCMkgghN5","date":"Sun May 29 13:00:51 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A 1 percent increase in US births in 2021 doesn’t equal a real baby boom https://t.co/XLGzt2sazf","date":"Sun May 29 12:40:10 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Underground hip-hop is banned in Egypt. Now, it’s the soundtrack to Marvel’s Moon Knight. https://t.co/VzJ9ayc8Mz","date":"Sun May 29 12:00:29 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Former President Trump and Texas Sen. Ted Cruz were among those dismissing calls for tougher gun laws. https://t.co/jYlleFLdXp","date":"Sat May 28 20:50:15 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"“Time only moves one direction on my alarm clock, as in life.” — @loracorkelley on the best $17.59 she ever spent, on a completely average digital alarm clock\n https://t.co/gMBuQsCI86","date":"Sat May 28 12:30:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The philosopher who resisted despair https://t.co/NVIUIEuP53","date":"Sat May 28 12:00:44 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The obsession with managing public opinion gets in the way of managing public health https://t.co/hSkjZt7IUl","date":"Sat May 28 11:30:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Are active shooter drills worth it? https://t.co/pVPCVGR7bF","date":"Sat May 28 11:00:36 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Turning carbon credits into crypto won’t fix climate change.\n\n https://t.co/XgfVI5I8CU","date":"Sat May 28 10:11:48 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Health experts are optimistic monkeypox can be contained. Here’s why, and where it could go wrong. https://t.co/dxJxTsRDvl","date":"Sat May 28 09:11:42 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Whether this summer will be especially “ticky” depends on where you live, experts say, but the range of several species that carry pathogens is expanding across North America. We’re now finding these creatures in places we never have before. https://t.co/3928hEOJha","date":"Sat May 28 08:11:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Scholars of gun politics have found a striking — and disturbing — pattern. https://t.co/v421RDQCbD","date":"Sat May 28 07:10:25 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In the wake of the Buffalo and Uvalde massacres, we need to talk about identity politics: both white identity politics, and the identity politics of gun owners. https://t.co/6F03pnXtSC","date":"Sat May 28 06:08:49 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How a gun rights myth paved the way for nightmares like Uvalde. https://t.co/QlcrzccC3J","date":"Sat May 28 05:06:53 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why special legal protections for handguns make America's gun violence problem unsolvable, even if we did have a filibuster-free Congress that was eager to pass gun regulations. https://t.co/4ldtNw0ke6","date":"Sat May 28 04:03:52 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why special legal protections for handguns make America's gun violence problem unsolvable, even if we did have a filibuster-free Congress that was eager to pass gun regulations.","date":"Sat May 28 01:57:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Now adults in their 30s and 40s, the kids who lived through the start of the school shooting era are navigating a world in which what happened to them was not an anomaly but the beginning of a recurrent feature of American life. https://t.co/JWLr9DZaly","date":"Sat May 28 00:53:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A gun control expert on mass shootings, the progress gun control advocates have made, and why the NRA no longer defines gun culture in the US. https://t.co/szqdxDF917","date":"Fri May 27 23:49:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"7/ Guns, child poverty, child hunger, education, health care. Time and time again, America is failing its kids.\n\nLearn more: https://t.co/fM9w35F9SN","date":"Fri May 27 21:57:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"6/ The reasons for this uniquely American failure are multifold. \n\nThe solutions will not be easily attained. But until we resolve to fix it, our future will be that much dimmer. https://t.co/Ac4Xy1MNNI","date":"Fri May 27 21:57:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ The consequences of the collective policy shortcomings are everywhere. https://t.co/GAZy1TCCjn","date":"Fri May 27 21:57:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ American public policy doesn't value children.\n\nIf you want to know where a society's priorities truly lie, look at how it spends its money. https://t.co/cSeSGOthOP","date":"Fri May 27 21:57:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ America is capable, in a moment of crisis, of providing better support for children and families. \n\nWe saw this during the pandemic. It was a wildly successful policy experiment. And yet soon, those programs will be allowed to lapse. https://t.co/jS6d072PdF","date":"Fri May 27 21:57:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ This week's mass shooting at an elementary school in Uvalde, Texas, is one of the most visceral examples of how the US fails its children. https://t.co/SXElSRxwzu","date":"Fri May 27 21:57:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ A second generation is now growing up in a world where school shootings are part of life. \n\nColumbine didn't lead to meaningful policy change; neither did Sandy Hook; neither did Parkland; and the terrible truth is that Uvalde may not either. https://t.co/L5BqvggU6v","date":"Fri May 27 21:57:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Uvalde police keep changing their story https://t.co/skpuhBKwwd","date":"Fri May 27 20:00:20 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Research shows that mass shootings typically don’t lead to more gun control. If anything, it’s the opposite. https://t.co/Y6BhvYFrPt","date":"Fri May 27 15:50:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Congress gives itself a 10-day deadline to find a deal on gun control https://t.co/wKu1J9Ojkq","date":"Fri May 27 12:30:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Hollywood and the military have always cooperated. But as Top Gun: Maverick proves, that relationship is changing. https://t.co/wsZ5KWhlfG","date":"Fri May 27 12:01:00 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Containable outbreaks have some features in common, and monkeypox has most of them https://t.co/Dz0eKCkJeK","date":"Fri May 27 11:30:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why gun control feels out of reach — and why there’s still hope https://t.co/zo8aVWWJPo","date":"Fri May 27 11:00:55 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"In the wake of the killing in Uvalde, here’s what America can learn from Australia’s response to tragedy. https://t.co/fJpMaQ2nPL","date":"Fri May 27 01:17:30 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why special legal protections for handguns make America's gun violence problem unsolvable, even if we did have a filibuster-free Congress that was eager to pass gun regulations. https://t.co/VKapfXiub7","date":"Fri May 27 00:15:43 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"America doesn't take care of its kids in ways big and small — in schools, in homes, in every facet of life.\n\nSchool shootings, like the massacre in Uvalde, Texas, are one of the most visceral examples of that failure. https://t.co/0SeC9Q7ZUe","date":"Thu May 26 23:11:31 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The factors that lead to tragedies like Uvalde are deeply ingrained in US politics, culture, and law. https://t.co/WP3fx5CiPG","date":"Thu May 26 22:10:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"8/ America doesn't take care of its kids in ways big and small — in schools, in homes, in every facet of life.\n\nSchool shootings, like the massacre in Uvalde, Texas, are one of the most visceral examples of that failure.\nhttps://t.co/fM9w35F9SN","date":"Thu May 26 20:13:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"7/ \"'The only thing that stops a bad guy with a gun is a good guy with a gun,' [NRA VP Wayne LaPierre once] said.\n\nOf course, the children lying dead in Connecticut could not have taken up arms in their own defense. Nor could the kids who died in Texas.\" https://t.co/JZuyznTHU5","date":"Thu May 26 20:12:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"6/ \"To do nothing is to endorse an intolerable status quo.\" \n\nHere's why America can't afford to be defeatist when it comes to gun reform.\nhttps://t.co/6N0EThba2i","date":"Thu May 26 20:09:57 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ In the wake of the mass shooting in Uvalde, America can learn from Australia’s response to tragedy.\n https://t.co/2JDwd8l12V","date":"Thu May 26 20:08:38 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ Why special legal protections for handguns make America's gun violence problem unsolvable, even if we did have a filibuster-free Congress that was eager to pass gun regulations. https://t.co/XjhXmQXlw6","date":"Thu May 26 20:07:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ After research on gun violence in the 1990s found that firearms do not make people safer, the NRA backed a federal funding freeze on gun policy research.\n\nIt's still in effect today. https://t.co/nnptZq7z2D","date":"Thu May 26 20:03:41 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ In the wake of the Buffalo and Uvalde massacres, we need to talk about identity politics: both white identity politics, and the identity politics of gun owners.\nhttps://t.co/ijDlnTbqGX","date":"Thu May 26 19:08:45 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ The US is exceptional when it comes to gun violence.\n\nThese maps and charts show what that violence looks like compared with the rest of the world, why it happens, and why it's such a tough problem to fix.\n https://t.co/DCwvfPry9A","date":"Thu May 26 19:04:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Vox articles old and new explore gun violence in the US, why it's so prevalent and hard to address.\n\nHere are 8 stories to understand America's gun violence problem. https://t.co/RJ4uJvlZ3N","date":"Thu May 26 19:00:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Between 2003 and 2015, the US gun death rate rose. At the same time, the gun death rate of its peers declined.\n\nIn 2020, US gun deaths reached the highest number ever recorded. The continued rise speaks to the worsening situation the study’s authors noted. https://t.co/RJ4uJvlZ3N","date":"Thu May 26 18:54:24 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The horrifying statistic comes from a 2019 analysis of 2015 @WHO data of violent deaths by researchers at the University of San Francisco and Harvard.\n\nThey found that the US is not only an outlier, but the situation has worsened over the years. https://t.co/RJ4uJvlZ3N","date":"Thu May 26 18:53:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"More than 90% of kids ages 5 to 14 killed by guns in about 30 of the world's richest countries are from the US. It amounts to hundreds of deaths per year.\nhttps://t.co/RJ4uJvlZ3N","date":"Thu May 26 18:52:08 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"America is failing children on guns — and so much more https://t.co/pCl2XOjolo","date":"Thu May 26 18:50:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The mass shooting at Robb Elementary School in Uvalde, Texas, has once again brought American exceptionalism on gun violence into stark relief.\n\nNot one country compares to the US when it comes to the number of children killed inside its borders. https://t.co/htSmp5fNcw","date":"Thu May 26 18:50:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Millions of people get scammed every year through account hacks, phishing emails, scam calls and texts, and more.\n\nHas this happened to you? Email your story to sara.morrison@recode.net. https://t.co/jW5gmGiRH7","date":"Thu May 26 17:27:40 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The US has a uniquely expansive view of civilian gun ownership, ingrained in politics, in culture, and in the law since the nation’s founding — and a national political process that has so far proved incapable of changing that norm. https://t.co/tTRVFIdNLt","date":"Thu May 26 15:40:04 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Why Boeing’s successful Starliner test is a big deal https://t.co/FH5RlmKvty","date":"Thu May 26 13:30:33 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Trade is vital to preventing the global food crisis from getting worse https://t.co/EJq7tQPtQ6","date":"Thu May 26 13:01:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Netflix paid $40 million to platform Ricky Gervais’s new transphobic special https://t.co/r8bpLfENPq","date":"Thu May 26 12:01:42 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"WeWork co-founder Adam Neumann’s new crypto project sounds like a scam within a scam  https://t.co/oEzmga7FqP","date":"Thu May 26 11:30:23 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"\"The fight for safer schools (and restaurants and concerts and nightclubs and grocery stores and places of worship) simply cannot be over,\" writes @marincogan on why America can’t afford to be defeatist when it comes to gun reform. https://t.co/6N0EThba2i","date":"Thu May 26 06:00:01 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Landmark research suggests that guns, not higher crime across the board, explain why America’s homicide rate is so high.\n\n https://t.co/DWPMrxgxnc","date":"Thu May 26 00:44:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"America’s gun violence epidemic, in one chart  https://t.co/ZLVqA3Eqpt","date":"Wed May 25 23:10:11 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court made it impossible to solve America’s gun problem \n\nhttps://t.co/s92i8RMG4D","date":"Wed May 25 22:51:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@marincogan @today_explained The gun control debate is not over — just look at the number of people raging, mourning, and demanding that America must do better. \n\nThey are the best evidence that the matter is not settled. Learn more: https://t.co/6N0EThba2i","date":"Wed May 25 21:55:58 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"It's easy to feel defeated in the face of decades of failure and inaction on gun violence. It's also harmful.\n\n@marincogan, who lived through a school shooting herself, explains why she hasn’t given up on a solution to America’s gun problem. Listen @today_explained. https://t.co/bqrrRvPrUP","date":"Wed May 25 21:54:47 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The Supreme Court made it impossible to solve America’s gun violence problem https://t.co/N2jiwnlIAh","date":"Wed May 25 19:50:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Tuesday's mass shooting in Uvalde, Texas, is the latest in America's long list of massacres in schools.\n\nIt is unconscionable. In the developed world, this level of gun violence is a uniquely American problem. One reason why is the number of guns in the US compared to its peers. https://t.co/z8nDV0dmCL","date":"Wed May 25 18:27:26 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"No, the gun control debate was not “over” after Sandy Hook https://t.co/DBqINAp9CK","date":"Wed May 25 18:20:07 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A child can’t be a “good guy with a gun” https://t.co/KG4scwX0fy","date":"Wed May 25 17:40:05 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How professional wrestling explains American masculinity https://t.co/U7fTasN8nF","date":"Wed May 25 12:01:21 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The plant-based future of food doesn’t always taste that great https://t.co/dFjN1Je7h0","date":"Wed May 25 11:30:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"How to make money during the tech crash: Write about it https://t.co/VkMqhuSz82","date":"Wed May 25 10:01:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2 losers and 1 winner from the Georgia, Alabama, and Arkansas primaries https://t.co/GXxYH3QBSH","date":"Wed May 25 04:45:19 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"What is it that makes America’s gun problem so much worse than the rest of the world? This video from 2016 explores the scale of the problem.\n\nhttps://t.co/PFJqn9sDy2","date":"Tue May 24 23:44:23 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Tuesday's shooting at Robb Elementary School in Uvalde, Texas marks the 27th school shooting this year alone.\n\nThis is a developing story. Here is what we know so far:\nhttps://t.co/7TT5j8CWsR","date":"Tue May 24 23:42:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"A shooter in Uvalde, Texas, killed at least 14 students and a teacher at Robb Elementary School. \n\nIt’s putting a renewed spotlight on the failed push for gun control. https://t.co/sGLtE2qNRz","date":"Tue May 24 23:38:06 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"At least 14 children and one teacher were killed in a shooting Tuesday afternoon at Robb Elementary School in Uvalde, Texas. This story is developing.\n\nIt is the latest tragic reminder of America's unconscionable legacy of gun violence. https://t.co/g39XNfB584","date":"Tue May 24 23:25:02 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Yes, a subvariant of omicron now has its own subvariant https://t.co/XcWmmF97RJ","date":"Tue May 24 19:20:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"This year’s #Cannes poster features The Truman Show. Do they get it? https://t.co/pMlWwxf9Hr","date":"Tue May 24 16:30:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ The stakes have only grown as increased gas production looks to surpass coal as the dominant fuel, and as the concentration of methane in the atmosphere soars, with human activities mostly to blame.\n\nLearn more: https://t.co/0LCts5UZS3","date":"Tue May 24 15:47:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ Countries around the world have \"encoded policies that incentivize continued gas production and consumption, even as 100 of them joined a voluntary Global Methane Pledge to slash methane by 30 percent in the next decade,\" @rebleber writes.\nhttps://t.co/0LCts5UZS3","date":"Tue May 24 15:47:13 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ Gas has never been \"clean,\" explains @rebleber. \"It's a dangerous and explosive substance.\"\n\nBut the oil and gas industry isn't ready to lose its biggest marketing advantage as it tries to dodge climate scrutiny from regulators. https://t.co/0LCts5UZS3","date":"Tue May 24 15:47:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ The language has influenced consumer choices and political decisions. \n\nPolls reveal that most Americans are more likely to view natural gas more favorably than other fossil fuels and see it as a solution for climate change. https://t.co/0LCts5UZS3","date":"Tue May 24 15:47:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"1/ The end of natural gas has to start with its name.\n\nFor over a century, the gas industry has marketed natural gas as \"clean,\" \"renewable,\" and \"responsible,\" reports @rebleber. \n\nBut all of those labels mean the same thing: Methane. https://t.co/YxrfAReYaB","date":"Tue May 24 15:47:12 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"The internet’s pesky, perpetual plagiarism problem is made worse by algorithms that reward it https://t.co/He0g6yCIHQ","date":"Tue May 24 13:00:56 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Teeth. So Many Teeth. Blood-hungry teeth. In the Great Lakes. https://t.co/yRqzAwu8dL","date":"Tue May 24 12:01:54 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"Inside the weird world of quantum computers https://t.co/QwDuPsnQBA","date":"Tue May 24 11:00:54 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@landmanspeaking 8/ We also have excellent vaccines to protect those at highest risk from infection.\n\nAnd because monkeybox isn’t a novel disease, we have more tools to prevent and treat it — far more than we did for the novel coronavirus that causes Covid-19. https://t.co/Ue3RzidNWe","date":"Mon May 23 22:12:51 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"@landmanspeaking 7/ It's important to note that even a large monkeypox outbreak would likely be easier to handle than the Covid-19 pandemic.\n\nFor one, it isn’t considered contagious before people show symptoms; that could make it harder for people to unknowingly spread it. https://t.co/Ue3RzidNWe","date":"Mon May 23 22:11:03 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"6/ For now, you don't need to be worried about catching the virus through casual contact with others, an expert tells @landmanspeaking. \nhttps://t.co/Ue3RzidNWe","date":"Mon May 23 22:09:56 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"5/ Studies suggest the number of people who will hypothetically contract the disease from an infected person are generally low, but higher among people with multiple sexual partners, especially some men who have sex with men. https://t.co/kGLbcMZSxV","date":"Mon May 23 22:09:09 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"4/ The latest clusters of monkeypox cases are different from previous clusters. https://t.co/HRWvIKLBDJ","date":"Mon May 23 22:08:18 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"3/ The numbers are changing rapidly. Still, it’s too early to tell what’s going on, whether the cases are related, and whether this outbreak has epidemic potential. https://t.co/wPOW4r8sZt","date":"Mon May 23 22:05:28 +0000 2022","user_id":"2347049341"},{"handle":"voxdotcom","text":"2/ Here is an incomplete list of where and how many cases have been confirmed globally, as of May 23, 2022:\n\n🇪🇸 Spain: 41\n🇵🇹 Portugal: 23\n🏴󠁧󠁢󠁥󠁮󠁧󠁿 England: 20\n🇨🇦 Canada: 5\n🇮🇹 Italy: 4\n🇺🇸 United States: 2 https://t.co/MzRO2cPaHX","date":"Mon May 23 22:04:47 +0000 2022","user_id":"2347049341"}]