[{"handle":"washingtonpost","text":"Researchers are building algorithmic tools to better predict earthquakes and give people more time to flee. But structural challenges remain. https://t.co/jLLK3HYCZC","date":"Sat Jun 25 22:34:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Russia will soon exhaust its combat capabilities, Western assessments predict https://t.co/m4EWCfTU9y","date":"Sat Jun 25 22:09:25 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Congress passed a bill to extend a pandemic-era program through the summer that provided free meals to students regardless of income. \n\nBut lawmakers added a caveat that means fewer kids will qualify in the fall. https://t.co/l6szSDcjMR","date":"Sat Jun 25 21:45:19 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Three top Senate Democrats are urging Facebook to be more transparent about an internal policy that allows gun sellers to violate the company’s prohibition against peer-to-peer firearm sales 10 times before they are kicked off the platform. https://t.co/crDi9UoqZw","date":"Sat Jun 25 21:21:23 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"On Saturday, temperatures in Japan shot above 104 degrees (40 Celsius) for the first time on record during the month, another clear sign of the sweeping effects of human-caused climate change. https://t.co/Hftv3aYRax","date":"Sat Jun 25 20:55:45 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Jeff Clark won’t talk to the Jan. 6 committee. But he’ll talk to Tucker Carlson. https://t.co/y1NjL7Q2L9","date":"Sat Jun 25 20:32:31 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Read more on the unique way Filipinos have learned to save their homes from rising waters.  https://t.co/zNw35WGQGW","date":"Sat Jun 25 20:17:59 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"For those outside the Philippines, these steps can offer lessons in adaptation as sea levels rise around the world. https://t.co/zNw35WGQGW https://t.co/WnqZF1RxSy","date":"Sat Jun 25 20:17:22 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Decades of congressional gridlock on everything from gun violence to immigration to abortion rights have left a vaccum that a newly empowered right-wing bloc of Supreme Court justices have seized. https://t.co/fTbRhThJXT","date":"Sat Jun 25 20:10:11 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"By all accounts, the floods are only getting worse.\n\nAny solutions on climate change will be years in the making. In the meantime, people in many areas will face a lot more water, without the option of relocating. https://t.co/zNw35WGQGW https://t.co/hmj1wQXmfW","date":"Sat Jun 25 20:01:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Homeowners in the country’s precarious middle class, who don’t necessarily have the funds to relocate, are left largely on their own to cope and find ways to protect their possessions. https://t.co/zNw35WGQGW","date":"Sat Jun 25 19:52:23 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"As extreme weather events are expected to worsen globally, the country is at the forefront of the crisis, with towns and cities made especially vulnerable due to poor urban planning and inadequate drainage systems. https://t.co/zNw35Wpfim https://t.co/rgJC8CHGpy","date":"Sat Jun 25 19:52:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Every year at least eight typhoons smash into the Philippines, an archipelago and former U.S. colony in the Pacific Ocean. \n\nAs the climate changes around the world, the storms are getting worse. https://t.co/zNw35WGQGW https://t.co/T92rSNJZn9","date":"Sat Jun 25 19:50:28 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Reinforced by Trump appointments, conservatives take on controversies dear to the right. https://t.co/ylDScVGcG4","date":"Sat Jun 25 19:46:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"While researching her genealogy, Kelley Dixon-Tealer never imagined she’d be able to find out about her enslaved great-great-great grandfather, and actually read his own words, in his own handwriting that had been preserved for 155 years. https://t.co/5vKfC6MrOR","date":"Sat Jun 25 19:23:56 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The front pages of The Washington Post\n\nJan. 23, 1973: The day after the Supreme Court decided Roe v. Wade\nJune 25, 2022: The day after the Supreme Court overturned Roe v. Wade https://t.co/VvzxaSYrmC","date":"Sat Jun 25 19:11:20 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Republicans control the governor’s mansion in four blue states: Massachusetts, Maryland, New Hampshire and Vermont.\n\nAll four governors have said they will uphold abortion rights, though some have fought against expanding access to the procedure. https://t.co/tVxTOcTles","date":"Sat Jun 25 19:00:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"For abortion opponents, the Supreme Court’s decision was met with celebration. For supporters of abortion rights, there was grief and rage and grim determination.\n\nHere's how Americans reacted across the country. https://t.co/4WQXdGpZEd","date":"Sat Jun 25 18:37:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The governors of Washington and Oregon joined Newsom in declaring a West Coast “commitment to reproductive freedom” citing the intention to pass more sweeping protections, including refusals to extradite people to states with abortion bans. https://t.co/K6To902ETE","date":"Sat Jun 25 18:30:22 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In response, liberal governors and legislatures are erecting legal countermeasures.\n\nCalifornia Gov. Gavin Newsom on Friday signed a bill aimed at protecting patients and health-care providers from civil penalties sought by states that ban the practice. https://t.co/K6To8ZL426","date":"Sat Jun 25 18:30:21 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Republican lawmakers in Missouri are considering a bill that would prohibit Missouri residents from getting an abortion out of state as well as penalize out-of-state medical professionals. https://t.co/K6To8ZL426","date":"Sat Jun 25 18:30:21 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Multiple states, including Arizona, Arkansas and Texas, have sought to stem the flow of abortion-inducing pills by making their shipment through the mail illegal. https://t.co/K6To8ZL426","date":"Sat Jun 25 18:30:21 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court decision to strike down Roe v. Wade is expected to trigger new battles between red and blue states, as women and advocates try to get around newly enacted bans by seeking the procedure out of state and using hard-to-trace medications. https://t.co/K6To902ETE","date":"Sat Jun 25 18:27:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Live updates: Abortion protests continue nationwide after Supreme Court ends Roe v. Wade https://t.co/cJKx2OnLeU","date":"Sat Jun 25 18:10:24 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"President Biden has signed bipartisan gun-control legislation into law.\n\nIt is the most significant law of its kind in the last three decades, though Biden has conceded it doesn’t do everything that he wants — or everything that advocates have asked for. https://t.co/qFLvKMrNFv","date":"Sat Jun 25 17:46:29 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Lightning staves off elimination, sends Stanley Cup finals back to Tampa https://t.co/RzAb3tFaR3","date":"Sat Jun 25 17:24:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ukraine accuses Russia of launching missiles from Belarusian airspace https://t.co/lc0NkHlNjY","date":"Sat Jun 25 17:00:47 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Oath Keepers’ defense ordered to disclose if Sidney Powell is funding attorneys https://t.co/aQXnpsNs02","date":"Sat Jun 25 16:34:11 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Cities across the country were bracing for a second day of huge street demonstrations after the Supreme Court’s historic overturning of Roe v. Wade.\n\nBy 10 a.m. Saturday, a few hundred people had gathered outside the Supreme Court building. https://t.co/XoW765Q6e7","date":"Sat Jun 25 16:12:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Some patients calmly asked questions about various clinics in other states. Others asked if Eisen was sure about the ruling. One begged.\n\n“I can pay extra,” the woman said.\n\n“It’s not an issue of expense,” said Eisen. “It’s just an issue of legality.” https://t.co/wVtm79GpP5","date":"Sat Jun 25 16:05:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The staff had to decide what to tell their patients.\n\nAt least one had driven hundreds of miles to get to Houston, because the lone clinic in her home state of Mississippi was scheduling appointments several weeks out. https://t.co/wVtm79Y0GD","date":"Sat Jun 25 16:01:26 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Four couples told The Washington Post about making that choice — to abort or not — and how it affected them. https://t.co/L1A9Z4FcFo","date":"Sat Jun 25 16:00:23 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“Can we still do abortions today?” asked patient advocate Marjorie Eisen, thinking about the 20 women they had booked for appointments. Several were already in the waiting room.\n\n“No,” said Kathy Kleinfeld, a co-owner of the clinic. “We’re done.” https://t.co/wm5CZhmQYi https://t.co/g8Nd57nXTW","date":"Sat Jun 25 15:58:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The phones started ringing, as they always did, moments after Houston Women’s Reproductive Services opened for business at 9 a.m. on Friday.\n\nThen, 12 minutes later, it all came to a stop. The Supreme Court had overturned Roe v. Wade. https://t.co/wm5CZhmQYi","date":"Sat Jun 25 15:55:52 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Electronic cigarettes made by Juul Labs can continue to be sold, for now, after a federal appeals court on Friday issued a temporary stay on a government ban. https://t.co/sEztiM8YiN","date":"Sat Jun 25 15:25:35 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"What is a recession? Is an economic downturn inevitable? How should you prepare for one?\n\nThe Post answers some common questions on economic downturns and how they affect Americans. https://t.co/ZEucP3fgrQ","date":"Sat Jun 25 14:56:19 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Sens. Charles E. Grassley (R-Iowa) and Mark R. Warner (D-Va.) have asked the Interior Department’s inspector general to investigate the 2017 fatal shooting of unarmed motorist Bijan Ghaisar by two U.S. Park Police officers. https://t.co/IjWxCeblLW","date":"Sat Jun 25 14:26:58 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Authorities in Norway raised the terror threat to its highest level Saturday, after at least two people were killed and 10 seriously injured in a shooting early Saturday at an LGBTQ nightclub in the capital, Oslo. https://t.co/hW59BvCnTR","date":"Sat Jun 25 13:56:36 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"At least eight states banned the procedure the day the ruling was released. \n\nSeveral others with antiabortion laws blocked by the courts are expected to act, with lawmakers moving to activate their dormant legislation. https://t.co/7ACALoHM0C","date":"Sat Jun 25 13:45:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"When the Supreme Court struck down Roe v. Wade, we asked what questions you had about the historic ruling. Many want to know what the decision means for the future of abortion rights.\n\nSenior news anchor Libby Casey breaks down what we know as of now. https://t.co/Wt4aSQbM9d https://t.co/R5D3FIWkWi","date":"Sat Jun 25 13:44:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“We’re done”: Chaos and tears as an abortion clinic abruptly shuts down\nhttps://t.co/oZc8ASJCQY","date":"Sat Jun 25 13:29:46 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"As Army deadline nears, about 60,000 part-time soldiers unvaccinated https://t.co/r4lWf2YHfw","date":"Sat Jun 25 13:02:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"With Roe overturned, Congress readies for a fight — and a defense https://t.co/2va8fDb6Hq","date":"Sat Jun 25 12:56:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"LGBTQ community braces for rollback of rights after abortion ruling https://t.co/7hVn4DH4is","date":"Sat Jun 25 12:53:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Biden confronts a bombshell that could define his presidency https://t.co/U8QvS37llZ","date":"Sat Jun 25 12:46:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Women of color will be most impacted by the end of Roe, experts say https://t.co/yhwhytCqEg","date":"Sat Jun 25 12:14:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trump publicly praises Roe’s repeal — but privately frets about impact https://t.co/hdud7LX5Es","date":"Sat Jun 25 12:00:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Supreme Court goes against public opinion in rulings on abortion, guns https://t.co/kV4hn7RcZx","date":"Sat Jun 25 11:45:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Attorney General Merrick Garland signaled Thursday that the Justice Department is preparing for legal battles on a host of related issues — from women traveling to states where the procedures are legal, to accessing pills that can induce abortions. https://t.co/L3Dom6lDsM","date":"Sat Jun 25 11:36:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Abortion advocates fear access to birth control could be curtailed https://t.co/tAkv34JBkx","date":"Sat Jun 25 11:15:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Molly Roberts: My pregnancy was unlucky. My abortion wasn’t. https://t.co/KXaNVcKxKn","date":"Sat Jun 25 10:18:24 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Colbert I. King: The Supreme Court found a way to make our gun problem worse https://t.co/u7gyq0JqaE","date":"Sat Jun 25 09:41:16 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Maryland pitching DNC to be one of the early primary states https://t.co/Q8YIIZERWQ","date":"Sat Jun 25 09:07:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Tropical storm could form in Atlantic next week and threaten Caribbean https://t.co/Gv1gkBligB","date":"Sat Jun 25 08:31:35 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. abortion decision “horrific” and “appalling,” world leaders say https://t.co/pBUSrDDOlQ","date":"Sat Jun 25 07:55:15 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Germany hosted officials in Berlin to discuss ways to blunt the impacts of the global food crisis, which has left 200 million acutely food insecure. https://t.co/K0sLYxNtKs","date":"Sat Jun 25 07:17:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Taliban struggle to respond to earthquake amid international isolation https://t.co/x1yLJqpaiw","date":"Sat Jun 25 06:44:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Lexi Thompson goes low, but In Gee Chun still in command at Women’s PGA https://t.co/VGSLgfV1jv","date":"Sat Jun 25 06:07:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Traumatic pregnancies are awful. Dobbs will make that so much worse. https://t.co/pG3ImD69Tz","date":"Sat Jun 25 05:33:57 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by E.J. Dionne Jr.: The Supreme Court guts gun laws, while Congress finally acts https://t.co/5StlRWxdTK","date":"Sat Jun 25 04:55:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by David Von Drehle: The court’s ruling in Dobbs pours gasoline on our culture-war fires https://t.co/TpyqBoG2Ds","date":"Sat Jun 25 04:21:57 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"When Western allies met earlier this year, their tone on Ukraine was resolute and optimistic. This time, the future is uncertain and the mood far more somber. https://t.co/nsU9fIXoi5","date":"Sat Jun 25 03:45:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Fringe groups on the far right and left issued calls to take up arms on Friday in a sign of escalating tension over the U.S. Supreme Court’s abortion ruling.\nhttps://t.co/TXaKgaTDok","date":"Sat Jun 25 03:08:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Scaling back abortion access is consistent with declining democracy https://t.co/Gf8NQlpHxX","date":"Sat Jun 25 02:49:47 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Abortion advocates fear access to birth control could be curtailed https://t.co/w9CByzCPgw","date":"Sat Jun 25 02:12:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"With Roe overturned, Congress readies for a fight — and a defense https://t.co/Mm10CGMZXf","date":"Sat Jun 25 01:56:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Women of color will be most impacted by the end of Roe, experts say https://t.co/G9UdEKjJ6C","date":"Sat Jun 25 01:51:20 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"An emotional scene unfolded as this Texas clinic turned away patients as soon as the Supreme Court overturned Roe\nhttps://t.co/VcNvgcB9Bs","date":"Sat Jun 25 01:11:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Biden confronts a bombshell that could define his presidency https://t.co/pbwW0kVpc3","date":"Sat Jun 25 00:46:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The U.S. Supreme Court’s new majority boldly signaled with twin rulings this week that public opinion would not interfere with conservative plans to shift the nation’s legal landscape. https://t.co/RrtsNNa7Uw","date":"Sat Jun 25 00:23:27 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"With a June 30 deadline approaching, nearly 12 percent of Army Guard and 10 percent of Army Reserve soldiers have not received any vaccine dose. https://t.co/Qdezk27xlZ","date":"Sat Jun 25 00:03:34 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Referring to the rulings that legalized same-sex relationships and marriage equality, Thomas added, “We have a duty to ‘correct the error’ established in those precedents.” https://t.co/fRw9CqeyDt","date":"Fri Jun 24 23:45:40 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In an opinion concurring with conservative colleagues, Justice Clarence Thomas wrote that striking down Roe v. Wade should open up the high court to review other precedents that may be deemed “demonstrably erroneous.” https://t.co/fRw9CqeyDt https://t.co/HWvtz5btiH","date":"Fri Jun 24 23:45:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Streamers, video game developers and brands that reach millions of young people expressed frustration and disappointment over the Supreme Court’s abortion ruling. https://t.co/4KfdvDwNQ2","date":"Fri Jun 24 23:41:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trump publicly praises Roe’s repeal — but privately frets about impact https://t.co/aGiu8wQMtc","date":"Fri Jun 24 23:19:59 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"LGBTQ community braces for rollback of rights after abortion ruling https://t.co/BBcx7sbn9N","date":"Fri Jun 24 22:58:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Biden, other critics fear Thomas’s ‘extreme’ position on contraception https://t.co/jhVOKzWOEN","date":"Fri Jun 24 22:36:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: The Supreme Court rolls back a right and inflames a divided country https://t.co/yQQJNsPtfK","date":"Fri Jun 24 22:14:13 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Sen. Susan Collins (R-Maine) criticized the Supreme Court’s decision Friday to overturn the Roe v. Wade ruling. \n\n“The Supreme Court has abandoned a fifty-year precedent at a time that the country is desperate for stability,” Collins said in a statement. https://t.co/emM9dxgsdT","date":"Fri Jun 24 21:52:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Dow soars more than 800 points as Wall Street ends week on high note https://t.co/O94IQYMaOS","date":"Fri Jun 24 21:31:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. abortion decision “horrific” and “appalling,” world leaders say https://t.co/Cx0VCm2V5k","date":"Fri Jun 24 21:13:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Attorney General Merrick Garland signaled Thursday that the Justice Department is preparing for legal battles on a host of related issues — from women traveling to states where the procedures are legal, to accessing pills that can induce abortions. https://t.co/wPl3wd0Bjz","date":"Fri Jun 24 20:51:58 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: 6 takeaways from the Supreme Court opinion that ended Roe v. Wade https://t.co/0N5QduzUsl","date":"Fri Jun 24 20:32:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Most justices who voted to overturn Roe v. Wade on Friday told the Senate at their confirmation hearings that the decision was settled precedent.\nhttps://t.co/0OZa4SpXoz","date":"Fri Jun 24 20:30:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"We looked through the archives to see how all six conservative justices addressed Roe v. Wade at their confirmation hearings before officially joining the court.\n\nHere's what we found. https://t.co/q9G197iFYO","date":"Fri Jun 24 20:30:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: 6 takeaways from the Supreme Court opinion that ended Roe v. Wade https://t.co/2TpK46rgI6","date":"Fri Jun 24 20:15:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Rep. Ocasio-Cortez continued, “Because the same individuals who purport, claim to be protecting life, fight against universal healthcare. Do they believe in universal child care? Do they believe in life after birth?” https://t.co/CfVjXK0fN0","date":"Fri Jun 24 20:08:11 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"From the House floor, Rep. Alexandria Ocasio-Cortez (D-N.Y.) said, “I think it’s important for us to also tackle this myth that this is somehow about babies or children or life,” after the Supreme Court released its decision overturning Roe v. Wade in a 6-to-3 decision. https://t.co/U2J7lhLPSL","date":"Fri Jun 24 20:08:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Hackers seized a blockchain bridge developed by Harmony and swindled roughly $100 million in cryptocurrency, the company announced. https://t.co/0d8CBPi9Rq","date":"Fri Jun 24 20:07:25 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court has struck down Roe v. Wade, which for nearly 50 years has protected the right to abortion.\n\nWatch our coverage live from the newsroom of The Washington Post.  https://t.co/Ozin9nXNoq","date":"Fri Jun 24 19:55:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: The Supreme Court eviscerates abortion rights and its own legitimacy https://t.co/aKRBqMU0Xx","date":"Fri Jun 24 19:40:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Marc A. Thiessen: For the fall of Roe v. Wade, thank Donald Trump https://t.co/Tz8FqYgFpv","date":"Fri Jun 24 19:20:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Outside the Supreme Court after Roe v. Wade was struck down, one woman knew from personal experience how complicated every abortion decision is. https://t.co/OJrvORuWgC","date":"Fri Jun 24 19:05:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ride-hailing service Lyft said Friday that its U.S. medical benefits plan includes coverage for “elective abortion and reimbursement for travel costs” if an employee must travel more than 100 miles for an in-network provider. https://t.co/owNjjPb6D1 https://t.co/eXwH7TVUbc","date":"Fri Jun 24 19:02:40 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Greg Sargent and Paul Waldman: The Supreme Court is the new Forever War https://t.co/JzUHMGjIyT","date":"Fri Jun 24 18:50:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: The machinations that ended Roe https://t.co/G5V0piKznX","date":"Fri Jun 24 18:35:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Biden said the decision puts reproductive health at risk and singled out Justice Clarence Thomas’s concurring opinion, in which he opened the door to the court revisiting decisions on contraception and same-sex marriage. \n\nMore live updates here: https://t.co/o9OuMB8JxB","date":"Fri Jun 24 18:05:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"President Biden on Friday called the Supreme Court decision that overturns of Roe v. Wade a “tragic error” and implored voters to turn out in November to elect members of Congress willing to write abortion protections into law. https://t.co/hTeJzDDjBX https://t.co/lAy0dRzeWn","date":"Fri Jun 24 18:05:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Internet searches, visits to clinics and period-tracking apps leave a digital trail. \n\nHow might a person’s data trail be treated as evidence after the Supreme Court's decision to overturn Roe v. Wade? https://t.co/oZ1yvqz9vr","date":"Fri Jun 24 18:05:17 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court opinion included a claim often repeated by antiabortion advocates: that abortion rules in the U.S. are among the world’s most permissive.\n\nWhile that is technically the case, there is much more to the story in practice. https://t.co/PdaAt5H6Ce","date":"Fri Jun 24 17:58:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Clarence Thomas undercuts justices’ assurances about post-Roe rulings https://t.co/1DxsM0pVPU","date":"Fri Jun 24 17:49:43 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In addition, the legislation includes funding for mental health services and school security initiatives. https://t.co/GEzDySz0P9","date":"Fri Jun 24 17:43:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The legislation expands criminal background checks for some gun buyers, bars a larger group of domestic-violence offenders from purchasing firearms, and funds programs that would allow authorities to seize guns from troubled individuals. https://t.co/GEzDySz0P9","date":"Fri Jun 24 17:43:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The scene was a remarkable split screen that captured Americans’ wildly divergent reactions to a watershed moment in one of the nation’s bitterest debates. https://t.co/XZyfgsSpPd","date":"Fri Jun 24 17:43:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"An emotional crowd gathered outside the Supreme Court on Friday morning to alternately celebrate and revile the historic overturning of Roe v. Wade, with tensions mounting between demonstrators. https://t.co/2QfY3KAEpb https://t.co/IknrrTmCSq","date":"Fri Jun 24 17:43:36 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The vote passed the House overwhelmingly on party lines, 234-193, with no Democratic defections. \n\nFourteen Republicans voted in favor, including Rep. Tony Gonzales (R-Tex.) who represents Uvalde. https://t.co/GEzDySz0P9","date":"Fri Jun 24 17:40:27 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The House of Representatives passed significant gun violence legislation on Friday aimed at curbing the frequency of mass shootings in the United States.\n\nIt now heads to President Biden for his signature to make it law. https://t.co/GEzDySz0P9","date":"Fri Jun 24 17:37:56 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Rep. Alexandria Ocasio-Cortez (D-N.Y.) spoke to abortion rights supporters after the Supreme Court overturned Roe v. Wade.\n\n“This is not something that is going to be solved in a day, or in an election, or in a year,” she said. https://t.co/ToehmUR0HP","date":"Fri Jun 24 17:37:28 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Photos: The scene outside the Supreme Court after Roe v. Wade was overturned https://t.co/LWACcbdvFG https://t.co/w0s1nOVH0L","date":"Fri Jun 24 17:29:24 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Chief Justice John G. Roberts Jr. criticized his conservative colleagues for taking the additional step of overturning Roe and Planned Parenthood v. Casey, which had reaffirmed the right to abortion. https://t.co/E5FctjNJ2E","date":"Fri Jun 24 17:13:54 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"President Biden called the Supreme Court’s decision a “tragic error” and implored voters to elect candidates in November who will support abortion rights and broader rights to privacy. \n\n“This fall, Roe is on the ballot,” the president said. https://t.co/CuayDKVBCv https://t.co/lcQyGWAryP","date":"Fri Jun 24 17:06:12 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Biden says restoring abortion rights is up to voters, warns that same-sex marriage, contraception may be under threat https://t.co/3cy4O9UkCK","date":"Fri Jun 24 17:03:14 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Voters may be a lot angrier about Roe’s repeal than the right assumes https://t.co/sahbY0JMIb","date":"Fri Jun 24 17:02:45 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Based on current legislation, signals from lawmakers and interviews with experts, read more on how we expect the court’s decision to play out, broken down state by state: https://t.co/8GDK9nIKEg","date":"Fri Jun 24 17:02:14 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Many states have passed laws that explicitly protect the right to abortion, with several adding those protections this year in anticipation of the Supreme Court’s decision. https://t.co/8GDK9nIKEg https://t.co/V0nw1diM5Q","date":"Fri Jun 24 17:00:46 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In 10 states, the fate of abortion access is uncertain and, for some states, may depend on upcoming midterm elections.\n\nThese states include: Arizona, Florida, Kansas, Michigan, Montana, Nebraska, North Carolina, Pennsylvania, Virginia and Wisconsin. https://t.co/8GDK9nIKEg https://t.co/48HpvSWSBY","date":"Fri Jun 24 16:58:40 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Seven states without trigger laws are likely to ban abortion soon. In five of these states, courts have blocked or struck down recent laws that banned most or all abortions. \n\nWithout Roe, those laws will probably take effect within weeks or months. https://t.co/8GDK9o0lvO https://t.co/UJmwgLeWp9","date":"Fri Jun 24 16:56:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Among this first wave, the antiabortion laws slated to take effect — “trigger bans” — all work a little differently. \n\nSome will activate as soon as a designated state official certifies the court’s decision, while others will go into effect 30 days later. https://t.co/8GDK9nIKEg https://t.co/XzIiA2LhNU","date":"Fri Jun 24 16:54:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A handful of states also have pre-Roe abortion bans that could be brought back to life. Elsewhere in the country, the post-Roe landscape is less certain. \n\nHere’s a breakdown of where abortion rights stand, state-by-state: https://t.co/8GDK9nJitO","date":"Fri Jun 24 16:52:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"First, 13 states with “trigger bans,” designed to take effect as soon as Roe is overturned, will ban abortion within 30 days. \n\nSeveral other states where recent antiabortion legislation has been blocked by the courts are expected to act next. https://t.co/tHcWUNqUKn","date":"Fri Jun 24 16:52:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court has overturned Roe v. Wade, touching off a cascade of antiabortion laws that probably will take effect across roughly half the country.\n\nWithout the landmark precedent in place, the national abortion landscape will change quickly. https://t.co/8GDK9nIKEg","date":"Fri Jun 24 16:52:52 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The benefit covers the cost of travel for “family planning” for all employees who cannot access care where they live, Disney said, including “pregnancy-related decisions.” https://t.co/9QZIjMmHE1","date":"Fri Jun 24 16:52:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Walt Disney Co. said Friday it would cover employee travel expenses for abortions in light of the Supreme Court’s decision to strike down Roe v. Wade, the latest corporate giant to make the move. https://t.co/9QZIjMEj2B","date":"Fri Jun 24 16:51:48 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Overturning Roe could threaten rights conservatives hold dear https://t.co/h6hYQC0yFa","date":"Fri Jun 24 16:44:12 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Former vice president Mike Pence called for a national abortion ban, while former president Donald Trump argued the court’s decision is “something that will work out for everybody.” https://t.co/Gbf6a2AkaZ","date":"Fri Jun 24 16:40:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Democratic lawmakers and candidates unleashed a torrent of angry, defiant statements Friday, promising to make abortion rights a decisive issue for voters in November, as Republicans celebrated their victory in a decades-long fight. https://t.co/aARaellISx","date":"Fri Jun 24 16:33:52 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: The Dobbs decision looks to history to rescind Roe. But the history it relies on is not correct. https://t.co/Gp7pRHqUZ9","date":"Fri Jun 24 16:20:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Columnist Jennifer Rubin is online for a reader Q&amp;A where she’ll interact with readers, discuss her columns and answer questions on the news of the week. Submit your question or comment below. https://t.co/toPco1jco4","date":"Fri Jun 24 16:15:20 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"How much have women’s lives changed since before the Roe v. Wade ruling in 1973? Take the quiz. https://t.co/e1gcEnUlsV","date":"Fri Jun 24 16:10:45 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Alito was “proud” of fighting to overturn Roe v. Wade as early as 1985 https://t.co/V1AmfHiuqf","date":"Fri Jun 24 16:01:34 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In many countries, abortion is protected by law, not court decision https://t.co/ZLY6wPUARV","date":"Fri Jun 24 15:53:54 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Virginia Gov. Glenn Youngkin (R) said he will seek to ban most abortions after 15 weeks of pregnancy, moving quickly following the U.S. Supreme Court’s decision Friday overturning the constitutional right to an abortion. https://t.co/nGm2cWqKad","date":"Fri Jun 24 15:50:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Abortion rights advocates gather outside the Supreme Court on Friday morning after the 6-3 ruling was announced. https://t.co/MCP2vXPfbN https://t.co/xU5ew6vGpJ","date":"Fri Jun 24 15:44:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The White House announced that President Biden will address the nation on the court’s decision at 12:30 p.m. Eastern.\n\nBiden was critical of the court after a draft opinion leaked last month signaling that the court was poised to overturn Roe v. Wade. https://t.co/AcSnvCuRBp","date":"Fri Jun 24 15:35:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The number of abortions performed in the United States has fallen significantly in recent years. \n\nThese are the most common abortion procedures and when they occur.\nhttps://t.co/YcTa1k6wGi","date":"Fri Jun 24 15:31:48 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court has ruled in Dobbs v. Jackson Women’s Health Organization, striking down Roe v. Wade.\n\nRead the full opinion, along with the draft of the opinion that had been leaked in May. https://t.co/c9U1rmMlQA","date":"Fri Jun 24 15:23:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The decision comes as support for abortion rights is at an all-time high. According to a Post-ABC News poll, about 6 in 10 adults said abortion should be legal in all or most cases.\n\nWe’re asking readers how they feel in this historic moment and why. https://t.co/iL2ItiW1d5 https://t.co/GJH0bHFaOt","date":"Fri Jun 24 15:18:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In January 1966, The Washington Post ran a four-part series on how women in the Washington area obtained abortions.\n\nBelow is an abridged version of The Post’s four-part series, edited to highlight personal experiences.  https://t.co/Y831Epauwk","date":"Fri Jun 24 15:17:29 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In their joint dissent, the court’s three liberal justices took note of the states that will move quickly to restrict abortion access and emphasized the sweeping impact of the court’s decision on the rights of women to terminate their pregnancies. https://t.co/LdnFJncSjz https://t.co/bDPzKpuCzn","date":"Fri Jun 24 15:11:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Antiabortion activists react outside the Supreme Court on Friday morning when the court’s decision in Dobbs v. Jackson Women’s Health Organization was released. https://t.co/MCP2vXxDNd https://t.co/onxznGkubu","date":"Fri Jun 24 15:00:58 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Senate Minority Leader Mitch McConnell (R-Ky.) celebrated the Supreme Court ruing as “courageous and correct.”\n\n“This is [a] historic victory for the Constitution and for the most vulnerable in our society,” McConnell said in a statement Friday. https://t.co/idpxmlT9LN","date":"Fri Jun 24 14:58:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court has overturned the fundamental right to an abortion established by Roe v. Wade nearly 50 years ago.\n\nTell The Post: How do you feel about the Supreme Court’s abortion ruling? https://t.co/Nnffebz6KE","date":"Fri Jun 24 14:58:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"When the decision came down shortly after 10 a.m. ET, many of the clinics in trigger-ban states were filled with patients scheduled to receive abortion care. \n\nAdministrators had to inform patients that they could no longer legally perform the procedure. https://t.co/9zFA3P62dK","date":"Fri Jun 24 14:52:41 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In many states, trigger bans will activate as soon as a designated state official certifies the decision, which Republican lawmakers expect to happen within minutes. https://t.co/9zFA3P62dK","date":"Fri Jun 24 14:51:45 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Without the landmark precedent in place, the national abortion landscape will change quickly. \n\nFirst, 13 states with “trigger bans,” designed to take effect as soon as Roe is overturned, will ban abortion within 30 days. https://t.co/hykA1eJLjr https://t.co/k5Dm3Ve21u","date":"Fri Jun 24 14:36:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The reversal leaves states free to drastically reduce or even outlaw a procedure that abortion rights groups said is key to women’s equality and independence.\n\nThe vote was 6-to-3. https://t.co/ldIT9cEpai https://t.co/KOyD3Vby12","date":"Fri Jun 24 14:31:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Russia has been concentrating its fire power on the east of the country for weeks, specifically on Severodonetsk.\n\nNow, Ukrainian troops will be withdrawing from there, says the Luhansk regional governor — an effective surrender of the embattled city. https://t.co/4s2YnUDOSR","date":"Fri Jun 24 14:22:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court has struck down Roe v. Wade, which for nearly 50 years has protected the right to abortion.\n\nThe decision in Dobbs v. Jackson Women’s Health was the most anticipated of the court’s term. https://t.co/ldIT9cEpai https://t.co/U7Ii9D6p7W","date":"Fri Jun 24 14:21:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A Navy reservist described by prosecutors as a heavily armed Nazi sympathizer with top-level U.S. government security clearance was arrested and charged with breaching the U.S. Capitol on Jan. 6, 2021, with the Proud Boys, according to court filings. https://t.co/M1V4av4gLk","date":"Fri Jun 24 14:04:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Two prominent Chinese advocates for citizen rights and the rule of law in China were tried for subversion this week in what family members said was an opaque legal process designed to conceal from people the plight of the country’s human rights defenders.\n\nhttps://t.co/ThogY8KTxW","date":"Fri Jun 24 13:49:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis | NBA draft winners and losers: A Magic trick and rough night for Knicks https://t.co/Os0LoGl0Sz","date":"Fri Jun 24 13:28:16 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Echoes of Watergate: Trump’s appointees reveal his push to topple Justice Dept. https://t.co/9QmhlCjjuy","date":"Fri Jun 24 13:12:31 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"On @PostLive’s “First Look,” associate editor Jonathan Capehart speaks with The Post’s @davidjlynch, @joshrogin and @JRubinBlogger about the Jan. 6 House select committee hearing and assess the latest from on the ground in Ukraine. https://t.co/hZ7yABcs1A","date":"Fri Jun 24 12:59:43 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"J.K. Rowling thought she was talking to Ukrainian President Volodymyr Zelensky. It was Russian pranksters. https://t.co/51jwYBvzLr","date":"Fri Jun 24 12:53:29 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Drafting attitude and position need, Wizards land Johnny Davis at No. 10 https://t.co/tWY8jkIjvF","date":"Fri Jun 24 12:32:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Early Friday, the families of those killed got the opportunity to set foot on the lot.\n\nTown officials lit 98 torches. One eight-foot torch will stay lit for nearly a month, marking the time it took rescue workers to find the final remains in the rubble. https://t.co/jPM7DoCPyD","date":"Fri Jun 24 12:25:38 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The remains of their loved ones have been identified, but not an explanation for their deaths. \n\nFlorida has passed some condo safety reforms, but there are doubts about how effectively they can be implemented. https://t.co/exdML51WiM","date":"Fri Jun 24 12:22:13 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"On the first anniversary of the Surfside condo collapse, many families of those killed say they remain in a state of limbo. \n\nA judge on Thursday gave final approval for a $1 billion settlement to families, but it offers no answers and assigns no blame. https://t.co/zvDXIzzoSG","date":"Fri Jun 24 12:15:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Friday briefing:\n\n- The Senate passed new gun restrictions after decades of inaction.\n- The Jan. 6 committee held its fifth public hearing.\n- Juul products were banned in the U.S. by the FDA. https://t.co/mPOHZn9hUN","date":"Fri Jun 24 12:00:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A reshaped D.C. Council will take on education, policing, elections https://t.co/nrAmCj2ApT","date":"Fri Jun 24 11:51:26 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ukraine is running out of shells for the majority of its artillery in part because of a clandestine Russian campaign of bullying and sabotage over the past eight years, according to Ukrainian government officials and military analysts.\n\nhttps://t.co/LXqAhqsjAc","date":"Fri Jun 24 11:32:33 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Justice Department and the House committee investigating the Jan. 6 attack on the U.S. Capitol have asked Danish filmmakers for video footage recorded as they followed Trump confidant Roger Stone in the weeks after the 2020 election. \n\nhttps://t.co/C8IbMv28dd","date":"Fri Jun 24 11:15:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Russia-Ukraine war live updates:  Ukraine to withdraw troops from besieged Severodonetsk \n\nhttps://t.co/PBgw24azm5","date":"Fri Jun 24 11:00:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Liz Cheney aims to recruit crossover Democrats in her primary https://t.co/4usvZqdhGL","date":"Fri Jun 24 11:00:15 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A veteran Palestinian American journalist was killed by Israeli forces while covering a military raid in the occupied West Bank, according to an independent investigation published by the United Nations High Commissioner for Human Rights on Friday. \n\nhttps://t.co/FHRIGTMyzN","date":"Fri Jun 24 10:48:35 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Sha’Carri Richardson suffered a stunning setback Thursday at the U.S. track and field championships by failing to advance out of a preliminary heat in the 100 meters. \n\nhttps://t.co/KDT8F3cycH","date":"Fri Jun 24 10:24:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Education Dept. to cancel $6 billion in debt for defrauded borrowers https://t.co/1pFE6gxglo","date":"Fri Jun 24 10:00:15 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Costco violates animal welfare laws to sell $4.99 chicken, suit says https://t.co/ROYDYp8kmE","date":"Fri Jun 24 09:30:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: The earthquake that struck eastern Afghanistan late Wednesday was on its own terms a hideous disaster. But the tragedy is compounded by Afghanistan’s political isolation and economic unraveling. \n\nhttps://t.co/SenU5GUUV6","date":"Fri Jun 24 09:24:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Two prominent Chinese advocates for citizen rights and the rule of law in China were tried for subversion this week in what family members said was an opaque legal process designed to conceal from people the plight of the country’s human rights defenders.\n\nhttps://t.co/Zwj1jYx4r1","date":"Fri Jun 24 09:17:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The World Health Organization is weighing whether to declare monkeypox an international emergency — a decision that could come as early as Friday. \n\nhttps://t.co/bfkCY0xND2","date":"Fri Jun 24 08:58:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ukraine is running out of shells for the majority of its artillery in part because of a clandestine Russian campaign of bullying and sabotage over the past eight years, according to Ukrainian government officials and military analysts.\n\nhttps://t.co/pcUwSsN5wf","date":"Fri Jun 24 08:49:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The chairman of the British Conservative Party resigned Friday after the party lost two seats on the same night, saying that “somebody must take responsibility.” \n\nhttps://t.co/Qa694BaP2C","date":"Fri Jun 24 08:24:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ask Sahaj: My grandparents died. How do I keep their culture alive? https://t.co/wen9jh1Iw1","date":"Fri Jun 24 08:13:45 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Review: Watching “Elvis” feels like being in a washing machine for 2 ½ hours https://t.co/Nf5C4fI8Xx","date":"Fri Jun 24 07:40:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Mexican researcher gets 4 years in prison for spying for Russia in Fla. https://t.co/vwJPmlstF4","date":"Fri Jun 24 07:05:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Carolyn Hax: Is it wrong to date someone when there’s “no chemistry”? https://t.co/zvrdXh05yf","date":"Fri Jun 24 06:29:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ukrainian forces will have to be withdrawn from the besieged city of Severodonetsk, which had been the largest city in the Luhansk region still under partial Ukrainian control, according to the regional governor. https://t.co/Fmd5fi4wYg","date":"Fri Jun 24 05:55:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The World Health Organization is weighing whether to declare monkeypox an international emergency — a decision that could come as early as Friday and escalate the global response. https://t.co/jCTOlnTQCY","date":"Fri Jun 24 05:40:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by George F. Will: The Supreme Court’s gun ruling is a serious misfire https://t.co/Nr2Rs609nd","date":"Fri Jun 24 05:07:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Chill your ingredients, your glasses and your blender pitcher before making this slushy cocktail.\nhttps://t.co/c0ixfeq0XY","date":"Fri Jun 24 04:54:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In Gee Chun cards nine birdies in record round to lead Women’s PGA https://t.co/D5iVNOBR2u","date":"Fri Jun 24 04:40:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Seven MS-13 members convicted in sex trafficking of girl https://t.co/JpRnsTn21b","date":"Fri Jun 24 04:37:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Anti-trans groups hitch their cause to Title IX on 50th anniversary https://t.co/5Ab5XN9EZb","date":"Fri Jun 24 04:25:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: 5 lessons from Thursday’s devastating Jan. 6 hearing https://t.co/CwxyvZ0xul","date":"Fri Jun 24 03:50:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A Copenhagen local's inside tips on where to stay, what to do and where to eat.\nhttps://t.co/k125lRJU8B","date":"Fri Jun 24 03:35:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Neither Congress nor the commissioner of the NFL can issue the kind of discipline that needs to happen here. https://t.co/tZvdnDDKkF","date":"Fri Jun 24 03:21:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Abdullah Alaoudh: Biden must not betray defenders of democracy in Saudi Arabia https://t.co/5GoFDZhAj5","date":"Fri Jun 24 03:03:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The state health department described abortion topics as “off limits” and “in direct conflict with the agency’s mission.” https://t.co/2ABIS4bqmS","date":"Fri Jun 24 02:23:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"He stole a patrol vehicle, officials say — then responded to an emergency https://t.co/jC31csCfmJ","date":"Fri Jun 24 02:22:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Senate passes first significant gun legislation in nearly three decades. The bill is expected to clear the House as well. https://t.co/qW757EDF7t","date":"Fri Jun 24 02:19:22 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Vicki Constantine Croke: Happy the elephant had her day in court. We humans are better for it.\nhttps://t.co/iV2gj87ZRp","date":"Fri Jun 24 02:10:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Education Department will erase about $6 billion of student-loan debt for borrowers who argued in a class-action lawsuit the agency ignored their claims for loan cancellation, public officials announced.\n\n https://t.co/wzb1TL8AIg","date":"Fri Jun 24 02:04:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Supreme Court rules for death row inmate asking to die by firing squad https://t.co/sw3v30MMfJ","date":"Fri Jun 24 01:53:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Costco violates animal welfare laws to sell $4.99 chicken, suit says https://t.co/RSVv30syzg","date":"Fri Jun 24 01:38:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Rep. Liz Cheney, the Wyoming Republican fighting for political survival after clashing with former president Donald Trump, has started sending Democrats instructions on how to swap parties and vote for her in a primary. https://t.co/qX0Bfkyqoq","date":"Fri Jun 24 01:00:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Of all the fantastical false claims of fraud and vote manipulation in the 2020 presidential election, “Italygate” was one of the most extreme. \n\nAnd Rep. Scott Perry (R-Pa.) was at the heart of bringing it to Donald Trump’s attention.\n\nhttps://t.co/PNFiCOE8vK","date":"Fri Jun 24 00:59:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In snubbing House panel, Daniel Snyder may have increased his legal peril https://t.co/gjGFQwr8fH","date":"Fri Jun 24 00:58:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Suspend transit fares instead of the gas tax, climate advocates tell Biden https://t.co/03Gx4v1EC2","date":"Fri Jun 24 00:45:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Tamara Lanier, who has presented evidence she's a descendant of an enslaved man photographed against his will by a Harvard scientist in 1850, is suing the school for the images. https://t.co/EKzzEhyhGw","date":"Fri Jun 24 00:37:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A potato salad seasoned with vinegar and salt is a healthful spin on popular chips of the same flavor.\nhttps://t.co/woj91IXDXK","date":"Fri Jun 24 00:20:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"From the Archives: Long before embracing Trump’s false election claims, Rep. Scott Perry promoted groundless theories\n\nhttps://t.co/L9k0H2ddXd","date":"Fri Jun 24 00:03:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Jan. 6 committee connects two strands of Trump’s effort to retain power\n\nhttps://t.co/H6PSTXg2JO","date":"Thu Jun 23 23:44:38 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Auburn’s Jabari Smith, Gonzaga’s Chet Holmgren and Duke’s Paolo Banchero are the favorites to be the top picks. \n\nFollow along for live updates. https://t.co/6zVSUcTp95","date":"Thu Jun 23 23:34:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"To stem climate change, billionaires, politicians and philanthropists say sucking carbon out of the air and storing it underground could work. Critics fiercely disagree. https://t.co/nUCOiLmW0P","date":"Thu Jun 23 23:17:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Rokhaya Diallo: Why France’s overseas territories are voting for anyone but Macron\nhttps://t.co/W2BvEc2IRu","date":"Thu Jun 23 23:01:12 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: 5 takeaways from the Jan. 6 hearing on Trump’s DOJ plot https://t.co/Xw1w7372oS","date":"Thu Jun 23 22:55:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In the Jan. 6 committee hearing on June 23, witnesses described how President Donald Trump pressured the Justice Department to investigate election fraud.\n\nHere's a recap of today's hearing in three minutes. https://t.co/57onak5IK0","date":"Thu Jun 23 22:49:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. broadens Jan. 6 seditious conspiracy indictment of Oath Keepers https://t.co/imHILQKque","date":"Thu Jun 23 22:47:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"If you’re looking to hit the road, there are ways to offset the higher fuel costs and keep car travel within your budget. Here are ways to save on everything from food to accommodations.\n\nhttps://t.co/3dCoW4wxcL","date":"Thu Jun 23 22:28:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A White House aide also said that she heard from a lawyer in the White House Counsel’s Office that Rep. Marjorie Taylor Greene (R-Ga.) had contacted the office and asked for a pardon, but that she had not spoken to the Georgia congresswoman directly. https://t.co/VJXnxWPesZ","date":"Thu Jun 23 22:18:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The members included Rep. Matt Gaetz (Fla.), Rep. Mo Brooks (Ala.), Rep. Andy Biggs (Ariz.), Rep. Louie Gohmert (Tex.) and Rep. Scott Perry (Pa.). https://t.co/VJXnxWPesZ","date":"Thu Jun 23 22:18:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Multiple Republican lawmakers asked White House aides if President Donald Trump would preemptively pardon them for their activities in the lead-up to Jan. 6 before he left office, testimony provided to the Jan. 6 committee shows. https://t.co/3VEZJ5z1cO","date":"Thu Jun 23 22:18:40 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Greg Sargent: The second-guessing of Kevin McCarthy is just more gaslighting.\nhttps://t.co/8WFstQ5otw","date":"Thu Jun 23 22:13:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Yelp CEO shutters some offices, says hybrid work is “hell”\n\nhttps://t.co/48Q0FEvKwy","date":"Thu Jun 23 21:59:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Michael Waldman: The most dangerous gun ruling in history, at the worst possible time\n\nhttps://t.co/FMJm2MepkN","date":"Thu Jun 23 21:53:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trump White House aides say several Republican lawmakers sought pardons over Jan. 6 insurrection https://t.co/1KDjxGMCSG","date":"Thu Jun 23 21:51:43 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Paul Waldman: The Supreme Court is ready to gut every blue state’s gun laws\n\nhttps://t.co/v7gCfTJutX","date":"Thu Jun 23 21:46:29 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Texas Sen. John Cornyn said Wednesday that the NRA won't back the gun bill he co-wrote because of its \"business model.\" This is not how the GOP usually talks about them.\nhttps://t.co/rxipDknu1h","date":"Thu Jun 23 21:28:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: What Kavanaugh’s gun-case concurrence does — and doesn’t — mean\nhttps://t.co/5sGm7YtA4j","date":"Thu Jun 23 21:24:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The game developers revamped “F1 22's” physics engine, fine-tuning it until the 3D cars were registering lap times identical to their real-life counterparts.\nhttps://t.co/8OrOJrELPH","date":"Thu Jun 23 21:16:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"According to Donoghue, officials told Trump the Justice Department couldn’t “snap its fingers” to change the outcome of the 2020 election.\n\nhttps://t.co/DYBenYJjWT","date":"Thu Jun 23 21:13:16 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"During Thursday’s Jan. 6 committee hearing, former acting deputy attorney general Richard Donoghue recalled how President Trump pressured the Justice Department to push false claims of voter fraud. https://t.co/BYODxHHbKk","date":"Thu Jun 23 21:13:15 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In Canada, five museums that celebrate the country’s Black history\n\nhttps://t.co/srpSKJqnpa","date":"Thu Jun 23 21:04:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Here is everything Darth Vader said in “Obi-Wan Kenobi”\nhttps://t.co/OFCeB4s30p","date":"Thu Jun 23 20:56:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Perry Bacon Jr.: Democrats are having a mini-2024 primary right now\n\nhttps://t.co/4gHQsFhc28","date":"Thu Jun 23 20:52:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The company’s customer service department did not explain the reasoning for the decision.\nhttps://t.co/4KGPfntI6P","date":"Thu Jun 23 20:49:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Erik Wemple | Judge: Fox Corp. can’t wiggle out of Dominion’s “big lie” lawsuit\n\nhttps://t.co/cI9NRxPcxY","date":"Thu Jun 23 20:41:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"How the House committee probing the attack on the Capitol is trying to turn a year-long investigative grind into must-see television.\n\nhttps://t.co/bj1N21xQRI","date":"Thu Jun 23 20:22:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"If you like pina coladas, and getting freeze in your brain, you can use a set ratio of spirit to sour to sweet to ice as a starting point to make a good frozen daiquiri, margarita or virtually any other slushy cocktail in the sour family.\n\nhttps://t.co/f22ojzlD3r","date":"Thu Jun 23 20:15:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: An NBA draft with more uncertainty than most has a surplus of intrigue https://t.co/Whjh8SrMEv","date":"Thu Jun 23 20:12:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Students, alumni and faculty at Seattle Pacific University are at odds with the Board of Trustees over the school’s Employee Lifestyle Expectations policy.\nhttps://t.co/1QBu9fLQEd","date":"Thu Jun 23 20:11:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Thousands of people, mostly women, were convicted in Scotland under the Witchcraft Act of 1563.\nhttps://t.co/1UAAyTIW05","date":"Thu Jun 23 20:01:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: The Jan. 6 hearings have offered a rare glimpse at a version of Congress we want to see, as well as one that may soon disappear.\nhttps://t.co/PAToUbw0eM","date":"Thu Jun 23 19:59:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Metro announced Thursday it is taking control of the Silver Line extension, moving the long-delayed project a step closer to passenger service after years of delays. \n\nTransit officials said riders could begin boarding trains this fall. https://t.co/pvPkRYSNRJ","date":"Thu Jun 23 19:57:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Get ready for more armed people in America’s largest states\nhttps://t.co/UIEPbrbe3w","date":"Thu Jun 23 19:47:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: The Supreme Court’s gun ruling is bad, but not for the reasons you might think\n\nhttps://t.co/SeQgpqZiR4","date":"Thu Jun 23 19:38:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"More than 66,000 lightning strikes lit up the skies across southern California between Wednesday and Thursday morning, one of the state's most extreme lightning outbursts in years.\nhttps://t.co/8ejqBTOdvx","date":"Thu Jun 23 19:26:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. monkeypox response mirrors early coronavirus missteps, experts say\n\nhttps://t.co/uM0QMcj3q7","date":"Thu Jun 23 19:10:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Georgetown University officials said they believe there is a case of monkeypox near their Northwest Washington campus.\n\nOfficials said the person lives off campus, is in isolation and is doing well. https://t.co/IVojraOUhS","date":"Thu Jun 23 18:59:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trump called Jan. 6 participants ‘smart,’ filmmaker says\nhttps://t.co/niePVGPKKh","date":"Thu Jun 23 18:46:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Thursday's Jan. 6 committee hearing focuses on President Donald Trump's efforts to pressure Justice Department officials to help him overturn the results of the 2020 election. \n\nFollow our live coverage here. https://t.co/1KDjxGMCSG","date":"Thu Jun 23 18:45:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Turo’s peer-to-peer platform lets you avoid the rental counter, but you will still find fees\n\nhttps://t.co/0y31M71Mzf","date":"Thu Jun 23 18:43:11 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Turo’s peer-to-peer platform lets you avoid the rental counter, but you will still find fees.\n\nhttps://t.co/WWybUkeqQB","date":"Thu Jun 23 18:26:18 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Three former Justice Department officials to testify on Trump’s pressure to overturn 2020 election. Watch our coverage. https://t.co/1KDjxGMCSG","date":"Thu Jun 23 18:26:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The House Select Committee investigating the Capitol attack holds a hearing to review findings of the events of Jan. 6, 2021.\n\nWatch our live coverage here. https://t.co/nVJrHti0DP","date":"Thu Jun 23 18:25:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Arch Manning, nephew of Peyton and Eli, commits to Texas\n\nhttps://t.co/4iejlgai18","date":"Thu Jun 23 18:13:44 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Federal agents searched home of Trump Justice Dept. official Jeffrey Clark https://t.co/BfHLXwNfA0","date":"Thu Jun 23 18:05:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Avalanche now hold a 3-1 series lead, with Game 5 set for Friday night in Colorado.\nhttps://t.co/zjjfJbQ7Np","date":"Thu Jun 23 17:57:56 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Some victims of mysterious ‘Havana syndrome,’ first reported among U.S. diplomats in Cuba, to get six-figure payments from U.S. https://t.co/KtWBcAirdS","date":"Thu Jun 23 17:40:35 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The 65-34 vote represented an unlikely breakthrough on the emotional and polarizing question of American gun laws, which have gone largely unchanged for more than 25 years.\nhttps://t.co/eNPEDJjvWN","date":"Thu Jun 23 17:40:14 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"GOP operatives and donors are privately working to undercut the Senate campaign of Eric Greitens after he released an ad hunting down members of his own party.\nhttps://t.co/jGtiDNrben","date":"Thu Jun 23 17:21:35 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"What questions do you have about booking or planning your next trip? \n\nWashington Post travel reporters Hannah Sampson and Natalie B. Compton are answering your questions now.\n\nhttps://t.co/c7UJ0Gz8kh","date":"Thu Jun 23 17:08:35 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Lithuanian President Gitanas Nauseda: Now is the time to make NATO even stronger\nhttps://t.co/ctLZo972Cu","date":"Thu Jun 23 16:58:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A new tool can determine in real time the role climate change plays in making daily high temperatures more likely.\n\nSee where climate change made heat worse in America: https://t.co/iMQIZRCpGK","date":"Thu Jun 23 16:47:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Last week, 96 percent of people in the contiguous United States experienced nighttime temperatures more likely to occur due to human-caused warming. \n\nThe findings come from a Post analysis of data provided by the nonprofit Climate Central. https://t.co/BUvQ7wQrYF https://t.co/fuHJAcdwlK","date":"Thu Jun 23 16:47:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: The war in Ukraine is killing far more soldiers per day than the typical war — and all signs point to protracted conflict.\nhttps://t.co/uM8hXN2alE","date":"Thu Jun 23 16:43:31 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: The threats to democracy are everywhere now. A new guidebook tries to show reporters the right way to cover them. \n\nhttps://t.co/5jx8XQrlx0","date":"Thu Jun 23 16:28:14 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis | Rep. Marjorie Taylor Greene, when a Brit asked about mass shootings: What about mass stabbings? https://t.co/fMFsZ0EUOZ","date":"Thu Jun 23 16:13:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The mothers and grandmothers filed into the school board meeting, ready to confront local officials after the shooting at Robb Elementary.\n\nAfter a long procession of funerals, the collective grief here is turning into collective rage. https://t.co/8V80DcIFVX","date":"Thu Jun 23 15:59:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Alexa’s newest feature — though still in development —  will be able to mimic any person's voice based on short audio clips. \n\nBut experts say the technology could bring security and ethical problems. https://t.co/pfVCDIwhmP","date":"Thu Jun 23 15:40:40 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The men lifted bodies out of the rubble. There were more than 30 bodies they needed to bury, too many for individual plots.\n\nA day after a massive earthquake struck eastern Afghanistan, the death toll stood at around 1,000, with more than 1,600 injured. https://t.co/Ko2pwIUXcZ","date":"Thu Jun 23 15:26:53 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The move comes as conservatives across the country fight to exclude transgender students from sports, to outlaw gender-affirming medical treatments and to purge libraries of books with LGBTQ characters. https://t.co/9OueQVg0m1","date":"Thu Jun 23 15:23:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The proposal would extend the protections of Title IX, which prohibits schools that get federal funds from discriminating on the basis of sex, to transgender students, compelling schools to accommodate and protect them. https://t.co/9OueQVg0m1","date":"Thu Jun 23 15:23:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Breaking news: On the 50th anniversary of Title IX, the Biden administration proposed sweeping changes to the landmark law that would bar schools, colleges and universities from discriminating against transgender students. https://t.co/l6gnnTma06 https://t.co/RdZf8yOShP","date":"Thu Jun 23 15:20:23 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“The Second and Fourteenth Amendments protect an individual’s right to carry a handgun for self-defense outside the home,” Justice Clarence Thomas wrote, saying New York’s requirement of a specific need to carry a weapon violates that right. https://t.co/9423A8QRFK","date":"Thu Jun 23 15:15:58 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Supreme Court on Thursday said Americans generally have a right to carry a handgun outside the home for self-defense and that a New York law requiring special need for such a permit is too restrictive. The vote was 6 to 3. https://t.co/9423A8QRFK","date":"Thu Jun 23 15:15:57 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Six people were killed after a “Huey” helicopter crashed while giving a tour in West Virginia on Wednesday evening, according to authorities. https://t.co/zquaiyZYUu","date":"Thu Jun 23 15:13:13 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Catherine Lhamon, assistant secretary for civil rights at the U.S. Department of Education, Briana Scurry, former goalkeeper for the U.S. Women’s National Soccer Team, and Jasmyne Spencer, join @PostLive for a discussion of Title IX 50 years ago.  https://t.co/RZpWht1YsT","date":"Thu Jun 23 15:00:45 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Breaking news: FDA orders Juul e-cigarettes off the market, citing insufficient and conflicting data\nhttps://t.co/Z6TaZrguhx","date":"Thu Jun 23 14:58:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Supreme Court says N.Y. gun law is too restrictive and violates right to carry firearms outside the home for self-defense https://t.co/Hw5pVmKHfL","date":"Thu Jun 23 14:51:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The House select committee investigating the Jan. 6, 2021, insurrection is holding its fifth hearing of the month on Thursday, with a focus on Trump’s efforts to pressure the Justice Department to help overturn the 2020 presidential election. https://t.co/LtbE4KtQPa","date":"Thu Jun 23 14:50:38 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"As Jan. 6 committee targets Trump, his consternation at McCarthy grows https://t.co/kYSqNrV8Qm","date":"Thu Jun 23 14:34:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Jennifer Faith was sentenced to life in prison for persuading her high school sweetheart to kill her husband. https://t.co/RiIAkfCpRy","date":"Thu Jun 23 14:21:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Tesla's new factories in Berlin and Austin “are gigantic money furnaces right now,” Musk told members of a club of Silicon Valley Tesla owners in Austin. \n\n“There should be like a giant roaring sound, which is the sound of money on fire,” he added. \n\nhttps://t.co/baCQLFtd8P","date":"Thu Jun 23 14:08:23 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Several clinics that perform abortions in Republican-led states are already pressing pause on scheduling the procedure as the Supreme Court’s decision on Roe v. Wade looms. https://t.co/BJmvGBUG21","date":"Thu Jun 23 13:55:31 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Marsha Lake fought for fundamental resources as a North Carolina women's basketball player at the dawn of Title IX. Her daughter, Shea Ralph, carries on the fight. https://t.co/xLZoFyv3CK","date":"Thu Jun 23 13:39:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Instagram might ask you to prove your age — but only in certain circumstances. \n\nhttps://t.co/GbJ7DCVkUv","date":"Thu Jun 23 13:24:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"On Instagram, the official USA artistic swimming account shared a statement from Fuentes who said Alvarez had been thoroughly checked by doctors and was recovering.\n\nShe thanked people for their well wishes and said the athlete was “feeling good now.” https://t.co/q3ZWyLKceE","date":"Thu Jun 23 13:13:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Two-time Olympics swimmer Anita Alvarez fainted and sank to the bottom of the pool during the World Aquatics Championships.\n\nHer coach on Team USA, Andrea Fuentes, dived in to save her, scooping her limp body up and rushing her back to the water’s surface. https://t.co/HA221Uhvf4 https://t.co/nryPGpwKY2","date":"Thu Jun 23 13:11:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The United Kingdom has declared a rare “national incident” after traces of the highly contagious polio virus were found in sewage in London, the government said. https://t.co/HhY29p2rzo","date":"Thu Jun 23 13:05:36 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The couple from Washington state said her water broke and there was no more amniotic fluid, raising the risk of an infection and the possible threat to her life. https://t.co/ePNeJqen4s","date":"Thu Jun 23 13:03:48 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Hospital authorities in Malta, the only country in the European Union that bars abortion under any circumstances, would not allow them to terminate the pregnancy. https://t.co/ePNeJqen4s","date":"Thu Jun 23 13:03:47 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":".@BradSmi, Microsoft’s president and vice chair, joins @PostLive to discuss foreign information operations, online disinformation, what the U.S. government should be doing about it and how tech companies continue to assess their role to fight against it. https://t.co/wbs2gW35f2","date":"Thu Jun 23 12:59:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"At 16 weeks pregnant, a U.S. woman was in Malta when she started bleeding — leading doctors to say her fetus would not survive and that she was also at risk.\n\nShe secured an emergency airlift Thursday via travel insurance to undergo an abortion in Spain. https://t.co/ePNeJqen4s","date":"Thu Jun 23 12:59:27 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Russia’s investigative journalists are no stranger to pressure from the Kremlin. But for Andrei Soldatov, what has happened to him after the Russian invasion of Ukraine has been an alarming escalation. https://t.co/6X7jhMXCvz","date":"Thu Jun 23 12:44:59 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trumpet soaked up the spotlight and cheers alongside handler and owner Heather Helmer.\n\n“I’m just ecstatic,” Helmer said. Outside the ring, she said, Trumpet “has a lot of attitude and he’s a little crazy.” https://t.co/KfXx0r8Npr","date":"Thu Jun 23 12:36:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A floppy-eared bloodhound named Trumpet was awarded Best in Show at the Westminster Kennel Club Dog Show finale Wednesday night, the first of his breed to take the competition’s top award. https://t.co/DXRiMj195A https://t.co/O4jgzAn6gO","date":"Thu Jun 23 12:34:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Daily Harvest recalled its lentil-leek crumbles and says it's trying to identify the \"root cause\" of reports that the topping sickened customers. https://t.co/C6m4zIODN4","date":"Thu Jun 23 12:26:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Thursday briefing:\n\n- The Jan. 6 committee will hold its fifth public hearing today.\n- The Uvalde school police chief was put on leave yesterday.\n- The U.S. is dramatically expanding its testing for monkeypox. https://t.co/xJTMk4KSHd","date":"Thu Jun 23 12:15:11 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Nazem Kadri puts Avalanche on cusp of a title with OT winner in Game 4 https://t.co/yPBOg5hrT8","date":"Thu Jun 23 12:11:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Most Americans support gender equity in sports scholarships, Post-UMD poll finds https://t.co/brDsKjEBBT","date":"Thu Jun 23 12:00:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"As Biden touts gas tax pause, even some of his own officials balk https://t.co/dR1iKpiPrj","date":"Thu Jun 23 12:00:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Bowser seeks to follow Marion Barry, but some Black voters are skeptical https://t.co/qTe38hF08E","date":"Thu Jun 23 11:49:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"D.C. Council chair ready to support RFK legislation — without stadium https://t.co/EXQACYEKii","date":"Thu Jun 23 11:38:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Uvalde seeking funds to raze Robb Elementary, state senator says https://t.co/p7IoaCkgkd","date":"Thu Jun 23 11:30:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. to expand monkeypox testing at commercial labs as outbreak grows https://t.co/f2gNlyXV9y","date":"Thu Jun 23 11:00:20 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“Collapsed.” A “serious situation.” And potentially, a “fall to rock bottom.”\n\nThose are some of the ways Sri Lanka’s prime minister described his country’s faltering economy Wednesday as the island nation faces extreme food and fuel shortages. \n\nhttps://t.co/BJnSbJlABu","date":"Thu Jun 23 10:52:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The historic Arts and Industries Building and three undeveloped plots on the Mall are in contention, and two will be selected by the end of the year.\nhttps://t.co/cqq4RUIQy5","date":"Thu Jun 23 10:34:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The 3 p.m. televised hearing will be a public airing of a high-stakes drama that played out inside the White House and Justice Department shortly before the Jan. 6 attack on Congress.\n\nhttps://t.co/yEfN3gR4wa","date":"Thu Jun 23 10:31:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The restaurant attack in Tangshan has prompted Chinese women to criticize lax attitudes about gender-based violence.\n\nhttps://t.co/7PHrAy58dG","date":"Thu Jun 23 10:31:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Fear over recent shootings has some avoiding crowds, businesses\nhttps://t.co/L5oKGjHEbl","date":"Thu Jun 23 10:30:13 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Palin outpaced her rivals in the primary. Now she faces new challenges. https://t.co/tLVqAJDRGD","date":"Thu Jun 23 10:00:18 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"E.U. leaders meeting Thursday are expected to grant Ukraine candidate status, a symbolic win for Kyiv amid the war with Russia and the formal start of a process to join the bloc that could take decades. \n\nhttps://t.co/wJpjGoKOwM","date":"Thu Jun 23 09:54:16 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"From @LauncherWP: “We want to create something that everyone feels is epic,” producer Naoki Yoshida told The Post.\nhttps://t.co/HjB40pXx2q","date":"Thu Jun 23 09:38:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The two Ohio women, who refer to themselves as “split-liver sisters,” received a liver transplant on July 1, 2020. But it wasn’t an ordinary transplant surgery: They had a split-liver transplantation. https://t.co/oqcg0LblZ6","date":"Thu Jun 23 09:20:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: June 23 marks 50 years since Title IX, which prohibits sex discrimination in education, was signed into law. Rep. Edith Green was the driving force behind Title IX in 1972. https://t.co/ttKa5OhumO","date":"Thu Jun 23 08:46:12 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by James Hohmann: The voices the Jan. 6 committee needs to hear https://t.co/f76xmubO67","date":"Thu Jun 23 08:12:11 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ukraine’s two footholds in Luhansk remain the sites of “hellish battles” against Russia, though U.K. intelligence believes Russia's momentum could slow in the coming months as it exhausts resources. https://t.co/kjG6XUqh0k","date":"Thu Jun 23 07:39:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“El Chango” died after a deadly standoff between a cartel and security forces. The news of his death inspired photo collages, tributes and even a song. https://t.co/aA80C4lPDD","date":"Thu Jun 23 07:31:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The scandal over Boris Johnson job-hunting for his wife won’t go away https://t.co/F3UzFgz3FK","date":"Thu Jun 23 06:55:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"As Americans take aim at Women’s PGA, players embrace a game going global https://t.co/etpA64n0Oe","date":"Thu Jun 23 06:21:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Saying Hong Kong wasn’t a colony but rather occupied by the British is one of the high-profile curriculum changes, which aim to promote “national security.” https://t.co/aTLesYrDYJ","date":"Thu Jun 23 06:13:38 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Neal Devins: They tend not to buck the dominant political party in their state. https://t.co/KB7gjsx2BT","date":"Thu Jun 23 05:37:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Paul Waldman and Greg Sargent: Buried in the gun deal is a significant advance https://t.co/Xq7Gxfc012","date":"Thu Jun 23 05:03:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"These adaptable cold noodle and summer roll recipes will hit the spot on a hot day.\nhttps://t.co/C4SUNPceQd","date":"Thu Jun 23 04:27:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The surgery, in April, was routine: Gleycy Correia was having her tonsils removed.\n\nBut five days later, the former Miss Brazil suffered a hemorrhage and fell into a coma for more than two months. https://t.co/QBo9jT0mSz","date":"Thu Jun 23 03:55:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Review: File “The Black Phone” under ghost stories, but not the kind you might expect.\nhttps://t.co/kk8g8RNKkz","date":"Thu Jun 23 03:47:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A floppy-eared bloodhound named Trumpet was awarded Best in Show at the Westminster Dog Show finale Wednesday night. https://t.co/V2pKRC5W8v","date":"Thu Jun 23 03:33:15 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Arizona wildfires gut observatory buildings, endanger artifacts https://t.co/TfIaeF3JOF","date":"Thu Jun 23 03:04:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In response to LIV Golf, the PGA Tour on Wednesday announced changes to its schedule and tournament prize money. https://t.co/n98av6u8et","date":"Thu Jun 23 03:03:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Bowser seeks to follow Marion Barry, but some Black voters are skeptical https://t.co/5zlty5iDf4","date":"Thu Jun 23 02:49:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Michele L. Norris: We need laws to protect election workers like “Lady Ruby” Freeman https://t.co/JUa8nAfLIf","date":"Thu Jun 23 02:43:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ravens linebacker Jaylon Ferguson found dead at 26 https://t.co/TpQoQYo198","date":"Thu Jun 23 02:39:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by E.J. Dionne Jr.: How many Rusty Bowers Republicans are out there?\nhttps://t.co/Wk9yy5dx57","date":"Thu Jun 23 02:38:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Former Washington defensive back Brig Owens dies https://t.co/Pm1fm7qI8F","date":"Thu Jun 23 02:21:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Tony Siragusa, former Ravens star and Fox Sports personality, dies at 55 https://t.co/gTCPLA3FOJ","date":"Thu Jun 23 01:56:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Shootings at two D.C. area malls and an outdoor event, as well as mass shootings nationwide, have left people on edge.\nhttps://t.co/Pf2aHjjQSm","date":"Thu Jun 23 01:48:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Caeleb Dressel withdraws from swimming world championships with medical issue https://t.co/LCl4wTGELY","date":"Thu Jun 23 01:42:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Subpoena for Daniel Snyder, scrutiny for Roger Goodell at partisan hearing https://t.co/EpB2vAx2Iz","date":"Thu Jun 23 01:26:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Daily Harvest recalled its lentil-leek crumbles and says it's trying to identify the \"root cause\" of reports that the topping sickened customers. https://t.co/kaAxFhN2kn","date":"Thu Jun 23 01:25:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Palin outpaced her rivals in the primary. Now she faces new challenges. https://t.co/7EP6xIBJqu","date":"Thu Jun 23 01:23:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Sen. Ron Johnson under fire over fake-electors disclosure at hearing https://t.co/txBDRzWJ1A","date":"Thu Jun 23 01:07:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Pedro “Pete” Arredondo’s leave was announced on Wednesday, a day after the director of Texas’ Department of Public Safety lambasted the chief for his slow response to the shooting. https://t.co/uvLddWsDNJ","date":"Thu Jun 23 00:52:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"As Biden touts gas tax pause, even some of his own officials balk https://t.co/yXdFJgE9n4","date":"Thu Jun 23 00:46:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The newly elected state delegate, and antiabortion activist, was quickly identified after he live-streamed himself going into the Capitol on Jan. 6. https://t.co/4Wpm87stcK","date":"Thu Jun 23 00:41:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A crackdown on passwords hits a nerve for long-time streamers, and muddles the future of fragmented TV.\nhttps://t.co/pXxGc7mv9y","date":"Thu Jun 23 00:30:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Man accused in Kavanaugh assassination plot pleads not guilty https://t.co/oALS3YY5ZD","date":"Thu Jun 23 00:16:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. to expand monkeypox testing at commercial labs as outbreak grows https://t.co/9WZRaKcyje","date":"Wed Jun 22 23:58:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Pups and people await furry finale at Westminster Dog Show https://t.co/JpEpbs4VW5","date":"Wed Jun 22 23:55:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Many in the LGBTQ community say these events offer them a safe and inclusive space to be themselves. We asked a few of them to share their experiences and photos of their nights. https://t.co/Rh7SwD4OR5","date":"Wed Jun 22 23:44:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Three weeks after the retirement savings program for millions of federal workers switched to a new operating platform, lawmakers are demanding answers as investors report widespread problems.\n\nhttps://t.co/rBz9bqnPAN","date":"Wed Jun 22 23:41:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Fifty years ago, legislation detonated barriers for generations of women. https://t.co/3W9G6bgMGW","date":"Wed Jun 22 23:40:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Rupert Murdoch and Jerry Hall to divorce after six years https://t.co/osSZVl0iHd","date":"Wed Jun 22 23:25:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"With its twin city of Severodonetsk now almost fully in Russian hands, Lysychansk appears to be next in Moscow’s campaign to take control of all of the eastern Donbas region. The city is bracing itself.\n\nhttps://t.co/y8BF11IJAG","date":"Wed Jun 22 23:19:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A white Tesla Model S was sitting in a Rancho Cordova, Calif., wrecking yard earlier this month — having been severely damaged in a collision three weeks earlier — when it suddenly erupted in flames, according to the Sacramento Metropolitan Fire District.\n\nhttps://t.co/gWcdBWfIab","date":"Wed Jun 22 23:11:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: No wonder Christian nationalists wanted these justices on the Supreme Court\nhttps://t.co/frCy5o0H8Y","date":"Wed Jun 22 23:04:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Several defendants and prosecutors warned that the planned release of a public report and witness transcripts from the high-profile House investigation into the Jan. 6 Capitol attack could upend trial preparations.\n https://t.co/cTivGxc6SW","date":"Wed Jun 22 22:54:19 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Alyssa Rosenberg: If “Lightyear” can spark a backlash, then no LGBTQ victories are safe.\nhttps://t.co/hm2XC4UIg8","date":"Wed Jun 22 22:34:36 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Female scientists are “significantly less likely” to be credited on scholarly articles or named on patents that they contribute to, a Nature study found.\nhttps://t.co/tKSgfzhhke","date":"Wed Jun 22 22:17:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Trump underperformed GOP House candidates more in places he won\nhttps://t.co/eaARLiiwnP","date":"Wed Jun 22 22:10:25 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Should I warn my abusive ex’s new girlfriend? Carolyn Hax readers give advice.\nhttps://t.co/ZhafkgGcA5","date":"Wed Jun 22 21:52:52 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Pew poll: Global views on NATO and U.S. rise; for Russia, a decline\nhttps://t.co/FhkAGym1e1","date":"Wed Jun 22 21:37:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: “Lots of theories, no evidence. There are few better encapsulations of the Trumpian approach to politics.”\nhttps://t.co/vIq0D00qJE","date":"Wed Jun 22 21:31:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Yellowstone partially reopens after historic flooding\n\nhttps://t.co/dVeSiZhWVl","date":"Wed Jun 22 21:29:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Russia’s chokehold over gas could send Europe back to coal\n\nhttps://t.co/nh1Gc6QKYR","date":"Wed Jun 22 21:28:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Proponents are racing to salvage a bipartisan measure that would provide $52 billion for domestic chip production.\nhttps://t.co/osjer0Shyf","date":"Wed Jun 22 21:26:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: More troubling signs for Trump 2024\n\nhttps://t.co/fCypwpqvp2","date":"Wed Jun 22 21:23:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Paul Waldman: Everyone should sue Trump.\n\nhttps://t.co/milqo7w3ip","date":"Wed Jun 22 21:03:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Turkey was once a leading critic of Saudi Arabia in the wake of Jamal Khashoggi's murder but an economic crisis has left it open to improving ties.\nhttps://t.co/CApjdKF43L","date":"Wed Jun 22 20:46:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“This new generation is going to be the one to bring unions back.”\n\nAt Starbucks stores across the nation, a burgeoning labor movement is being led by young female and LGBTQ employees. \nhttps://t.co/63jBMmixno","date":"Wed Jun 22 20:44:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The White House is desperate to bring down gas prices, but some experts don’t think Biden’s idea would help much.\nhttps://t.co/pnWa1X9StY","date":"Wed Jun 22 20:42:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Virginia couple sailing to Portugal go missing after boat damaged in storm\n\nhttps://t.co/LvX5dvzNZ4","date":"Wed Jun 22 20:24:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Senate Commerce Chair Maria Cantwell said she’s not close to supporting a major proposal, dealing a significant blow to efforts to revive the long-stalled bill.\n\nhttps://t.co/UYB2eV9ZPD","date":"Wed Jun 22 20:22:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Andrew Gillum, former Florida governor candidate, charged with wire fraud\n\nhttps://t.co/1fB9frhHm4","date":"Wed Jun 22 20:09:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"DOJ wants to know if Sidney Powell is funding Oath Keepers’ defense\n\nhttps://t.co/jcXFJJ1PbF","date":"Wed Jun 22 19:54:44 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Breaking news: Justice Department expands its Jan. 6 probe with fresh subpoenas amid increased public pressure from House hearings\n\nhttps://t.co/54GlBpxpKK","date":"Wed Jun 22 19:33:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Plane fire after landing failure forces emergency exit on Miami runway\n\nhttps://t.co/b6S5s1NF1v","date":"Wed Jun 22 19:19:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: Attorney General Merrick Garland cannot let this culture of violence go unpunished.\nhttps://t.co/Nryt56TjHb","date":"Wed Jun 22 19:02:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Much of the episode — and Ron Johnson's explanation — doesn't really add up.\nhttps://t.co/1nXrfjU3bP","date":"Wed Jun 22 18:50:12 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Police responses to calls for help are often routine, but, in the cases The Post identified, they turned deadly. \n\nExperts say that more needs to be done to protect those in crisis. https://t.co/tw8FhoUiFb https://t.co/EstNmXaUTk","date":"Wed Jun 22 18:33:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Many of the calls alerted authorities to people in mental health crises, requested wellness checks or reported suicide threats. \n\nThe calls came from the distressed individuals themselves or were made by worried family members, friends or neighbors. https://t.co/tw8FhoUiFb https://t.co/4nMSs8CwaN","date":"Wed Jun 22 18:33:44 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A new investigation by The Post reveals at least 178 cases from 2019 to 2021 in which calls for help resulted in law enforcement officers shooting and killing the very people they were called on to assist. https://t.co/tw8FhoUiFb https://t.co/Al7Skdo2Hd","date":"Wed Jun 22 18:26:44 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Nearly two years later, his family is still searching for answers.\n\n“This should have never happened,” Annette Watkins, Daniels’s mother, told The Washington Post. “We shouldn’t be living in a society where you call for help and be killed.” https://t.co/tw8FhoUiFb","date":"Wed Jun 22 18:26:28 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Bexar County sheriff’s deputies visited Damian Daniels three times. The third encounter escalated after deputies lunged at Daniels, who was standing in his doorway wearing a holstered, legally owned firearm.\n\nOne of the officers fired two shots into Daniels’s chest, killing him. https://t.co/PFbRLvpwBe","date":"Wed Jun 22 18:20:58 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Brendan Daniels tried to find help for his brother.\n\nDamian Daniels was alone in his San Antonio home in the throes of a mental health crisis. \n\nBrendan decided to call the Red Cross, but the Red Cross then called 911 to initiate a welfare check. https://t.co/tw8FhoUiFb","date":"Wed Jun 22 18:20:44 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"John Wood, a former federal prosecutor who has worked closely with Liz Cheney, started notifying committee staff this week of his plans to explore a run for office, according to four people familiar with his plans.\n\nhttps://t.co/RscQfo3nAw","date":"Wed Jun 22 18:14:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"An intense pulse of heat is setting records in the Southeast, with highs near 105 degrees in parts of Georgia and the Florida Panhandle and heat index values topping 110.\nhttps://t.co/Rf9tD3979u","date":"Wed Jun 22 18:03:34 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The cans are more expensive these days. So are the trips from store to store to find them.\nhttps://t.co/u1k7QaCcfI","date":"Wed Jun 22 17:47:26 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"All lawmakers on the committee are likely to receive a security detail, according to three people involved with the investigation.\nhttps://t.co/5dYogPMrnD","date":"Wed Jun 22 17:32:10 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Two groups at the forefront of the debate have tapped digital creators to aid their messaging efforts, posting about the legislation on platforms popular among younger users. https://t.co/Mn3WrSSOuP","date":"Wed Jun 22 17:15:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Storms are most probable between about 3 and 11 p.m. and some may be severe — containing damaging winds and hail in addition to heavy downpours and dangerous lightning.\nhttps://t.co/TkyPNMTsLJ","date":"Wed Jun 22 17:13:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The Facebook Oversight Board argued in its first annual report the company should be far more transparent about how it makes content moderation decisions.\nhttps://t.co/JynOpG9kaz","date":"Wed Jun 22 17:12:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Microsoft joins Twitter, Facebook and others in tracking stories in state-affiliated media.\nhttps://t.co/uRKqZbKmgC","date":"Wed Jun 22 17:01:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"On @PostLive's “Across the Aisle,” @SenatorShaheen and @SenThomTillis discuss working together as co-chairs of the Senate NATO Observer Group and their upcoming bipartisan congressional delegation to the NATO summit.  https://t.co/azpQ1pTCCY","date":"Wed Jun 22 16:59:17 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: If the Wizards use their No. 10 pick in Thursday’s NBA draft, their only goal will be adding pure talent to the roster. https://t.co/PVS97pvN9P","date":"Wed Jun 22 16:45:24 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Ravnsborg was charged with leaving the scene after fatally hitting a man with his car in 2020.\nhttps://t.co/fZYXAFAjyE","date":"Wed Jun 22 16:29:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: The work of three women, in particular, helped pass this landmark legislation.\n https://t.co/fFTz9hVVtU","date":"Wed Jun 22 16:11:58 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The strategy has diverted some of the focus away from federal races toward governor and secretary of state races, election-administrator contests and measures aimed at protecting ballot access and tabulation.\nhttps://t.co/XynnSzkK06","date":"Wed Jun 22 15:53:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Owners of a theater in central Oklahoma took down a sign that said they would fast-forward through the same-sex kiss in animated film “Lightyear.” https://t.co/pCazAKThWO","date":"Wed Jun 22 15:33:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A Miami-Dade County police officer is under investigation after he was filmed telling a Black driver during a routine traffic stop, “This is how you guys get killed.”\nhttps://t.co/5gPnCAyE0C","date":"Wed Jun 22 15:25:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Democratic plans to sidestep Iowa are complicated by the need for GOP agreement to move Michigan or Minnesota to the front of the line.\nhttps://t.co/DDUhyrYgVf","date":"Wed Jun 22 15:14:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"More than 21 million paper tax returns are still waiting for processing by the Internal Revenue Service, as the tax agency struggles to swiftly disburse refunds to American households, according to a watchdog report.\nhttps://t.co/qc77iMNWfW","date":"Wed Jun 22 15:05:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"CEO Tory Bruno vowed to transform the company; he’s developing a new rocket and has won a historic launch contract.\nhttps://t.co/0C1OUgjF8Z","date":"Wed Jun 22 14:52:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"In prepared remarks, Federal Reserve Chair Jerome H. Powell said that “inflation has obviously surprised to the upside over the past year,” and that Russia’s invasion of Ukraine, plus covid-related locks in China, is putting even more pressure on prices.\n\nhttps://t.co/KoQ1V3KdHW","date":"Wed Jun 22 14:35:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A woman accused of posting an Instagram message listing five people who were scheduled to testify in a gang murder and racketeering trial and terming each of them a “snitch” has been indicted on a charge of witness tampering.\n\nhttps://t.co/p6lX43c8h9","date":"Wed Jun 22 14:29:13 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Tuesday night’s bipartisan vote was a major achievement on an issue that has stymied Congress for decades.\n\n https://t.co/fwdBljijbi","date":"Wed Jun 22 14:14:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Brian Rivers, PhD, and Shana O. Ntiri, MD, join @PostLive to discuss drivers of and solutions to disparities in cancer outcomes and care. https://t.co/UVqw0UwX0A","date":"Wed Jun 22 13:59:28 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"LeBron James and Naomi Osaka team up to launch media company\n https://t.co/UJ11R6xL1o","date":"Wed Jun 22 13:58:52 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: The evidence is skewering Trump and his cronies. https://t.co/29ODsfbkuG","date":"Wed Jun 22 13:50:52 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"U.S. stock futures declined Wednesday after a relief rally as investors continue to grapple with uncertainty and recession fears. Oil prices also fell sharply.\n\nhttps://t.co/ikbUcIVU57","date":"Wed Jun 22 13:31:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"He is one of at least eight journalists killed doing their work during nearly four months of Russia’s war in Ukraine, Reporters Without Borders said. https://t.co/sDFcK2r5PS","date":"Wed Jun 22 13:28:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Maksym Levin, whom colleagues called Max, was found dead in April after friends lost contact with him in March. The photojournalist had been reporting near the front lines around the capital, from which Russian forces later retreated. https://t.co/sDFcK2r5PS","date":"Wed Jun 22 13:28:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Reporters Without Borders said an investigation it published Wednesday found evidence that Russian forces killed a Ukrainian photojournalist, along with a soldier accompanying him in a forest near Kyiv in March.\nhttps://t.co/sDFcK2r5PS","date":"Wed Jun 22 13:28:55 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: This primary night was sleepier than most, but it did have some significant results. Here are some takeaways.\n\nhttps://t.co/6GFTUq2bH6","date":"Wed Jun 22 13:19:20 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The city of Brooklyn Center, Minn., has agreed to pay $3.25 million to settle a wrongful-death lawsuit filed last year by the family of Daunte Wright, lawyers for Wright’s family said Tuesday. https://t.co/0n7KjCGC9d","date":"Wed Jun 22 13:04:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Alone in Washington, Rusty Bowers tells world what happened in Arizona\nhttps://t.co/k8N4lNof1N","date":"Wed Jun 22 12:46:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Washington NFL team owner conducted ‘shadow investigation’ of accusers after allegations of workplace misconduct, House committee says https://t.co/6eEvMX7ghc","date":"Wed Jun 22 12:28:13 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"What to expect when Roger Goodell testifies in House probe of Commanders https://t.co/yAeq8uBmVz","date":"Wed Jun 22 12:25:51 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Paul M. Ellwood Jr., a former physician who spent decades trying to overhaul the American health-care system, died June 20 at an assisted-living center in Bellingham, Wash. He was 95. https://t.co/K871UesJUv","date":"Wed Jun 22 12:09:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Class of ’22 lauded for perseverance through pandemic, gun violence https://t.co/gPwKXntR0W","date":"Wed Jun 22 12:08:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“I’ve never been so excited to go home and look at the mail — bills or not,” said Carol Hover, after receiving family postcards dating from 1960 to 1980, sent from three countries. \n\nhttps://t.co/gL8TkLJLQc","date":"Wed Jun 22 12:01:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"New safe sleep guidelines for babies include flat beds and no bed-sharing https://t.co/i7CfjSpUMZ","date":"Wed Jun 22 12:00:18 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Today, President Biden will call on Congress to suspend the federal gas tax for three months in a bid to provide some relief to drivers. But the plan faces head winds on Capitol Hill.\n\nFollow our live updates: https://t.co/AVEkezJfMw","date":"Wed Jun 22 11:53:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"High court opens the door to more public funding of religious schools https://t.co/SNhl6eDGCy","date":"Wed Jun 22 11:45:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The $178 billion health-care bailout at the start of the pandemic was as a lifeline for many hospitals that might not have survived the coronavirus — but the funds also disproportionately rewarded wealthy hospitals that did not need the money as urgently. \nhttps://t.co/icj56d2QDl","date":"Wed Jun 22 11:41:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Wednesday briefing:\n\n- The Jan. 6 committee held its fourth public hearing yesterday.\n- A gun-control bill took a big step forward in Congress last night.\n- A massive earthquake in Afghanistan killed hundreds of people. https://t.co/5iSiqS9p8P","date":"Wed Jun 22 11:39:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Election workers describe “hateful” threats after Trump’s false claims https://t.co/NuFzAIWYvX","date":"Wed Jun 22 11:30:12 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"D.C. voters on Tuesday picked city council candidates who rejected calls for more police officers and strict mayoral control of public schools, advancing the council’s years-long move to the left while also re-nominating moderate incumbents.\n\nhttps://t.co/naUInPkbPC","date":"Wed Jun 22 11:29:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Russia-Ukraine war live updates: Russia closes in on Lysychansk; Zelensky rallies support for E.U. candidacy \nhttps://t.co/NhK7nds6R6","date":"Wed Jun 22 11:15:21 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"How the Jan. 6 hearings could complicate the upcoming Proud Boys trial https://t.co/L3UibNNNGJ","date":"Wed Jun 22 11:15:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Document reveals details of 2009 sexual assault allegation against Daniel Snyder https://t.co/UxASgYFvlV","date":"Wed Jun 22 10:45:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Top senators plan to unveil a bipartisan bill Wednesday that aims to curb the high cost of insulin, a lifesaving drug that some Americans have struggled to pay for as prices of the medicine have soared. \n\nhttps://t.co/fw7bA3GIBR","date":"Wed Jun 22 10:30:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trump’s pressure drew violence, threats to local officials, committee shows https://t.co/sq3g853cPw","date":"Wed Jun 22 10:15:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Forest Service says it failed to account for climate change in New Mexico blaze https://t.co/0OmYz8Myfw","date":"Wed Jun 22 10:00:14 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Australia’s Victoria state — home to Melbourne — passed legislation Tuesday that bans the public display of Nazi symbols such as the swastika. The law comes as Australia faces a spike in far-right extremism. \n\nhttps://t.co/io5P2xanpk","date":"Wed Jun 22 09:54:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Earthquake in Afghanistan kills at least 920, injures 600, government says\n\nhttps://t.co/QvBZK79b2L","date":"Wed Jun 22 09:15:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Justice Department and Meta settle landmark housing discrimination case https://t.co/NsTyh97sew","date":"Wed Jun 22 09:00:17 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Mac Margolis: Catching the Amazon triggermen is the easy part. The problem is the milieu of miscreants who thrive with impunity under the canopy. https://t.co/nYwnXHOZ9Z","date":"Wed Jun 22 08:03:24 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Following Russian forces’ capture of a strategically important village Tuesday, the fate of Luhansk hangs in the balance as Ukrainian officials warn that the coming days could shape the outcome of the war. https://t.co/OyeTssZ9Vg","date":"Wed Jun 22 07:27:39 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A growing number of people in the U.S. are enrolling in medical marijuana programs, with the total surpassing 2.97 million through 2020, more than quadrupling the number of people enrolled in 2016, according to a study. https://t.co/RuL7VhqD8l","date":"Wed Jun 22 06:51:48 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Dana Milbank: Those ignoring the Jan. 6 revelations are guaranteeing more violence https://t.co/o8PqNo276p","date":"Wed Jun 22 06:17:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by David Ignatius: How Russia’s vaunted cyber capabilities were frustrated in Ukraine https://t.co/DxGdnesxEA","date":"Wed Jun 22 05:39:16 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Katrina vanden Heuvel | Bipartisanship is a rare and endangered species in today’s bitterly divided Washington. Except when it comes to one thing: the Pentagon budget. https://t.co/t1ZFqOEkCO","date":"Wed Jun 22 05:04:41 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Review: “Thrust,” Lidia Yuknavitch’s dreamy new novel, imagines a girl swimming through the country’s grim past and future.\nhttps://t.co/B5CxANUEX8","date":"Wed Jun 22 04:27:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A measure in Virginia’s new two-year budget is drawing criticism for redirecting funding for undocumented college students to students at historically Black colleges and universities in the state. https://t.co/5anRJwPSdP","date":"Wed Jun 22 04:13:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: The harassment faced by Jan. 6 witnesses after Trump’s false claims https://t.co/C8xWNTrrdZ","date":"Wed Jun 22 03:52:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Top executives quit Pornhub’s parent company amid more controversy https://t.co/XOppwSLwos","date":"Wed Jun 22 03:39:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Lexi Thompson tucks grief away, remains fan favorite at LPGA https://t.co/fMcPlJjAW5","date":"Wed Jun 22 03:19:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A plane caught fire Tuesday after landing at Miami International Airport, authorities said. No serious injuries were reported. https://t.co/Ww9qEBwnDW","date":"Wed Jun 22 02:53:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Caleb Swanigan, former NBA player and Purdue star, dies at 25 https://t.co/ijjeWuITUO","date":"Wed Jun 22 02:49:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Renting a house or an apartment can make living more sustainably challenging. These small, inexpensive changes are better for the environment — and your wallet.\nhttps://t.co/FXEQrS4HrV","date":"Wed Jun 22 02:37:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by David Von Drehle: The lesson from Uvalde? America has too many police departments. https://t.co/L1VsTmu2BA","date":"Wed Jun 22 02:35:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: The defense of democracy depends on the power of honorable individuals https://t.co/XFSBbkVUtK","date":"Wed Jun 22 02:31:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Xi Chen, 53, of Andover, Mass., died after becoming severely hypothermic during a Presidential Range hike in New Hampshire's White Mountains, officials said. https://t.co/aiZpO58Ibn","date":"Wed Jun 22 02:27:01 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"High court opens the door to more public funding of religious schools https://t.co/NrjHNxfcE8","date":"Wed Jun 22 02:26:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Rob Gronkowski, winner of four Super Bowls, announced his retirement Tuesday at age 33, three years after his initial decision to walk away from the sport. https://t.co/OOLro97NxU","date":"Wed Jun 22 02:14:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"The play “Shakespeare in Love,” based on the Oscar-winning 1998 film, follows the literary and romantic travails of the Bard.\nhttps://t.co/Tm73X8jQWC","date":"Wed Jun 22 02:04:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"New safe sleep guidelines for babies include flat beds and no bed-sharing https://t.co/vSSxVtkuVw","date":"Wed Jun 22 01:46:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: Rusty Bowers proves to be the Jan. 6 committee’s most compelling witness yet https://t.co/Hrir2fgcUn","date":"Wed Jun 22 01:44:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Katie Britt, backed by Trump, is projected to win the Alabama GOP Senate runoff to replace Sen. Richard Shelby https://t.co/z3SxNFfQLT","date":"Wed Jun 22 01:35:33 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Prosecutors and defense lawyers say the high-profile Jan. 6 congressional hearings could jeopardize fairness in upcoming criminal trials. https://t.co/3fwpQ5mgeu","date":"Wed Jun 22 01:07:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Russell “Rusty” Bowers (R) had voted for Trump, campaigned for Trump, but would not violate the law for him — and, as a result, his political future was jeopardized, his character was questioned and his family was harassed as his daughter was dying. https://t.co/bVFuaMXb7v","date":"Wed Jun 22 01:05:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Georgia election workers Shaye Moss and Ruby Freeman told the House committee investigating the Jan. 6 attack how Trump's false claims fueled threats. https://t.co/S4K2Usenu1","date":"Wed Jun 22 01:02:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Trump’s pressure drew violence, threats to local officials, committee shows https://t.co/aFIsEKtla6","date":"Wed Jun 22 00:47:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Bill Cosby sexually abused 16-year-old in 1975, jury in civil trial finds https://t.co/15rT15rCkD","date":"Wed Jun 22 00:39:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: Food deserts, racialized poverty and underfunded education are consequences of housing discrimination decades ago. https://t.co/vVVeDo62Tg","date":"Wed Jun 22 00:38:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Paul Waldman and Greg Sargent: Emotional Jan. 6 hearing shows election workers were the real heroes https://t.co/MvGU3FC3xz","date":"Wed Jun 22 00:25:07 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Forest Service says it failed to account for climate change in New Mexico blaze https://t.co/0mZKZ0dr8w","date":"Wed Jun 22 00:04:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"With no basing options in the region, the Pentagon is exploring a new approach to counterterrorism by cultivating human intelligence while tiptoeing around Russia. https://t.co/VCCaTdTkX8","date":"Tue Jun 21 23:52:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Here's live-updating results, maps and analysis of the 2022 Washington, D.C., primaries from The Washington Post. https://t.co/RxDB1bm2PS","date":"Tue Jun 21 23:41:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Facebook-owner Meta agreed to revamp the social network’s targeted advertising system under a sweeping settlement with the U.S. Justice Department, after the company was accused of allowing landlords to market their housing ads in discriminatory ways. https://t.co/DQttF854lp","date":"Tue Jun 21 23:24:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Texas Democratic Rep. Henry Cuellar will narrowly get to claim the Democratic nomination for Texas’s 28th Congressional District after a contentious reelection battle against attorney Jessica Cisneros. https://t.co/zmmsX1zdd3","date":"Tue Jun 21 23:21:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"From The Magazine: The former secretary of defense for Trump discusses avoiding catastrophes. https://t.co/pRUbyIBEta","date":"Tue Jun 21 23:16:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Document reveals details of 2009 sexual assault allegation against Commanders owner Daniel Snyder https://t.co/NaAdPM6Xau","date":"Tue Jun 21 22:58:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: The former vice president hopes he can appeal to both the rational and Trumpian wings of the GOP. He might appeal to neither.\nhttps://t.co/bjUy0SHH7U","date":"Tue Jun 21 22:54:25 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“They have an appetite for the kind of vegetation that makes up the fire ladder,” said Lani Malmberg, who manages goat herds and teaches people how to put them to work. https://t.co/4ZjgvBDgYL","date":"Tue Jun 21 22:35:44 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: No matter Ingram’s Star Wars future, Reva’s tale mattered. And the Star Wars universe is better because of it.\n\nhttps://t.co/fudTUWZgzP","date":"Tue Jun 21 22:12:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"This is how IUDs and morning after pills actually work\nhttps://t.co/EwktxUTe16","date":"Tue Jun 21 21:54:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"A disruptive company with a charismatic leader threw a lot of wealth into uncertainty — and vividly demonstrates the end of the crypto party.\nhttps://t.co/ScS23A16rj","date":"Tue Jun 21 21:37:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Photographers captured aurora-like scenes streaking across the Milky Way.\nhttps://t.co/xDisK095Ch","date":"Tue Jun 21 21:29:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Leaving behind a decade-long modeling career in the U.S., Kira Dikhtyar returned to her hometown of Moscow this spring to launch a new clothing line in sanctions-hit Russia while declaring her support for Russian President Vladimir Putin.\n\nhttps://t.co/78dZV9G6SC","date":"Tue Jun 21 21:12:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"“There is nowhere I feel safe. Nowhere. Do you know how it feels to have the president of the United States target you?” Freeman said in her video testimony. \n\nShe also said the false accusations have cost her her name and her security. https://t.co/F4j4mM7NrM","date":"Tue Jun 21 20:58:30 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Georgia election workers Shaye Moss and her mother, Ruby Freeman, told the Jan. 6 committee Tuesday about the harassment campaign they have faced after becoming a target of President Donald Trump and his allies in the wake of the 2020 election. https://t.co/cz7B70loSS","date":"Tue Jun 21 20:58:29 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Trump is not as popular with Black and Hispanic Americans as he thinks https://t.co/6he7byFlXA","date":"Tue Jun 21 20:52:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Gunmen burst into a Catholic church in northern Mexico on Monday in pursuit of a man trying to flee to safety, murdering him and two Jesuit priests who happened to be there, officials said.\nhttps://t.co/M9lxOZks71","date":"Tue Jun 21 20:36:20 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Witnesses offered more evidence that Trump allies knew their efforts were illegal — plus, new evidence linking Trump to the fake-elector plot. https://t.co/SmUUJ6gxb8","date":"Tue Jun 21 20:19:49 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Bowers grew emotional as he talked about these demonstrations happening while his “gravely ill” daughter watched from inside.\n\nShe died in late January 2021, according to his Facebook page. https://t.co/OR84I2GWHS","date":"Tue Jun 21 20:17:25 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"During Tuesday’s Jan. 6 committee hearing, Arizona House Speaker Russell “Rusty” Bowers (R) discussed threats he’s faced after resisting the Trump campaign’s efforts to overturn the 2020 election. https://t.co/OmbUb0fkvX","date":"Tue Jun 21 20:17:24 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Max Boot: Trashing the military has become a way of establishing MAGA bona fides. https://t.co/BpqUrcsOhh","date":"Tue Jun 21 20:09:37 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":".@SteveCase, chair and CEO of Revolution, @hboushey46, a member of the White House Council of Economic Advisers, and Deborah Gladney and @angelamuhwezi, co-founders of @getquickhire, join @PostLive for a series of conversations about entrepreneurship. https://t.co/rJzLGnFTmf","date":"Tue Jun 21 19:59:40 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Perspective: The U.S. risks repeating an error it made at the start of the coronavirus pandemic.\nhttps://t.co/eB0JGZEPQF","date":"Tue Jun 21 19:51:50 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Jennifer Rubin: Expectations about prosecuting Trump may be shifting\nhttps://t.co/iA1iK862wu","date":"Tue Jun 21 19:30:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Breakthrough in gun legislation, as senators resolve key snags https://t.co/WCNyynJWO2","date":"Tue Jun 21 19:27:21 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Many people consider the summer solstice as the first day of summer, but there is no official definition for the start and end dates of the season. \n\nThe solstice signals a turning point toward shorter days and longer nights over the coming months. https://t.co/uQ6fYG64Ob","date":"Tue Jun 21 19:19:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"D.C. has about 14 hours and 54 minutes of daylight for the solstice, with sunrise at 5:42 a.m. and sunset at 8:36 p.m. During the solstice, the sun’s northward movement in the sky appears to pause briefly before reversing direction for the next six months. https://t.co/uQ6fYFOtpB","date":"Tue Jun 21 19:14:00 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Analysis: Since the 2020 election cycle, Republican officials and candidates have repeatedly run afoul of tech companies’ rules against inciting or glorifying violence. \nhttps://t.co/5h5m0VYHZh","date":"Tue Jun 21 19:11:06 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Solstices, equinoxes and seasons occur because the Earth doesn’t orbit the sun completely upright. \n\nEarth’s axis is tilted by about 23.5 degrees, which causes each hemisphere to receive different amounts of sunlight throughout the year. https://t.co/uQ6fYG64Ob https://t.co/xWINHWugQO","date":"Tue Jun 21 19:09:09 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"If you’ve been enjoying these enchantingly long, bright days, Tuesday is a day to savor. It’s the summer solstice, the longest day (and shortest night) of the year in the Northern Hemisphere. \n\nHere’s what you should know:\n\nhttps://t.co/uQ6fYG64Ob","date":"Tue Jun 21 19:04:08 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Sen. Ron Johnson (R-Wis.) offered to deliver fake electors to Vice President Pence, House Jan. 6 committee says in video at hearing https://t.co/oYZGFCzDhJ","date":"Tue Jun 21 18:56:28 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Radley Balko: Judges have long been the gatekeepers of expertise. But judges are trained in law, not science, and these are two very different disciplines with almost contradictory objectives and methods of analysis. https://t.co/I6uMTCRsIe","date":"Tue Jun 21 18:56:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"NASA finally fully fueled its massive moon rocket on Wednesday, but a hydrogen leak forced the agency to cut short a simulated countdown.\nhttps://t.co/ndSCHqpyr6","date":"Tue Jun 21 18:42:04 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"These athletes from the D.C. area thrived in the spotlight this season.\nhttps://t.co/dON5Qy9jG1","date":"Tue Jun 21 18:36:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Benjamin Netanyahu, who led Israel for much of the past 20 years, seems to be betting on breaking the political stalemate by galvanizing his right-wing base.\nhttps://t.co/WbZ0VWEOLU","date":"Tue Jun 21 18:25:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Just how many restaurants have succumbed to the pandemic, with its mix of public health restrictions, government shutdowns and shared diner anxiety? Getting to a reliable number is tough, but it shows the true scope of the pandemic’s effect. https://t.co/Vdq4Td7cMx","date":"Tue Jun 21 18:24:05 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"More than half of Britain's rail network is suspended this week during three days of rail strikes.\nhttps://t.co/8pJe1d7Rwq","date":"Tue Jun 21 18:11:02 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Relief workers in Bangladesh and India are struggling to respond to devastating monsoon floods that have killed dozens and displaced millions. https://t.co/NuHOUX1F42","date":"Tue Jun 21 17:58:03 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Opinion by Erik Wemple: In addressing CNN's new approach to politics, Trump bundles small lies with ‘the big lie.’ https://t.co/hz11VHztTK","date":"Tue Jun 21 17:54:42 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Canada will ban the manufacture and importation of “harmful” single-use plastics by the end of the year, the government said, in a sweeping effort to fight pollution and climate change.\n\nhttps://t.co/TPmqREW2H7","date":"Tue Jun 21 17:37:46 +0000 2022","user_id":"2467791"},{"handle":"washingtonpost","text":"Steven C. McCraw’s remarks on Tuesday were a scathing opening to the Texas Senate committee meeting on gun violence and public safety, which was expected to include some of the most detailed official accounts of the Uvalde massacre. https://t.co/MJYmqF4QEh https://t.co/7NV6FIdYb8","date":"Tue Jun 21 17:27:31 +0000 2022","user_id":"2467791"}]