[{"handle":"wsj","text":"The NFL is preparing to argue quarterback Deshaun Watson should be suspended indefinitely—and for no shorter than one year—with his hearing set to begin in the coming days https://t.co/MJWzeYAXKO","date":"Sat Jun 25 22:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Do you struggle to get your kid to drop the game controller and pick up a book? Columnist @juliejargon has tips on how to get gamers reading this summer https://t.co/6xj3uNpuWg","date":"Sat Jun 25 22:15:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"When it comes to exercise, more isn't always better. Here's what scientists are learning. https://t.co/MysEHHtpAj","date":"Sat Jun 25 22:00:17 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Donald Trump and Joe Biden both face rejection, writes @Peggynoonannyc. The Jan. 6 hearings are helping Republicans solve their problem. It’s unclear what Democrats will do. https://t.co/RMoZNDe56E","date":"Sat Jun 25 21:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The U.S. will join other leading countries in banning imports of Russian gold in an effort to broaden sanctions against Moscow https://t.co/2jgCojvDGi","date":"Sat Jun 25 21:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Employees scrambled to keep Robinhood afloat during the January 2021 meme-stock frenzy, a House report finds https://t.co/VDtBbjW9Yi","date":"Sat Jun 25 21:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"That “$400 rule” is just the beginning when it comes to personal tips on retirement budgeting https://t.co/zvrwUCACJH","date":"Sat Jun 25 21:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Solar and wind face logistical challenges that could impact renewable energy’s future, explains @JinjLee #WSJWhatsNow https://t.co/K24neCD43p https://t.co/ExpaQrhk9W","date":"Sat Jun 25 20:45:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Malibu residents are accustomed to celebrities and billionaires moving in from out of town, but even they are shocked by the city’s newest round of big-ticket home sales. https://t.co/WXnl13VRPK","date":"Sat Jun 25 20:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Ohio State University has successfully trademarked the word “THE,” in a victory for the college and its branding that is sure to produce eye rolls from Michigan fans and other rivals https://t.co/tM2CpfWlTS","date":"Sat Jun 25 20:15:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Iowa 80, offers a restaurant, showers, a laundry, a workout room, a library and a theater; there’s a barber, a chiropractor, even a dentist. It's not a mall—it's a truck stop. https://t.co/9EkdI1D3lw","date":"Sat Jun 25 20:00:23 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Among young people, whose celebrity status will benefit more from Baz Luhrmann’s new “Elvis” biopic: Elvis Presley or the actor who plays him, Austin Butler? https://t.co/diQJjsmdtJ","date":"Sat Jun 25 19:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Proxy-adviser firm ISS recommended Spirit investors vote for a proposed merger with Frontier, reversing its position on the deal after Frontier sweetened its offer https://t.co/qFV5qHGAgQ","date":"Sat Jun 25 19:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The NFL is seeking a new media-rights deal for its subscription package, which has suffered from cord-cutting and scheduling changes https://t.co/dc4ECYb2Io","date":"Sat Jun 25 19:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"On Nantucket, a proposal to allow topless beachgoers has won town approval, an unimaginable move for many of the island’s year-rounders and weekender visitors. It might be time “to go out and buy some stock in Banana Boat [sunscreen],” one supporter said. https://t.co/y0P0gdkRHB","date":"Sat Jun 25 19:00:39 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: If Beijing develops durable advantages across the semiconductor supply chain, it would generate breakthroughs in foundational technologies that the U.S. cannot match, write @GrahamTAllison and @ericschmidt https://t.co/pBGiPRJy61","date":"Sat Jun 25 18:30:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Major gems look effortlessly chic styled with a simple summer wardrobe of white tanks, cotton poplin and light cashmere layers https://t.co/cNGGPD4g3Q","date":"Sat Jun 25 18:00:17 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Years of mass killings failed to spark meaningful solutions in Congress, because of divisions on how best to tackle gun violence. This time, things turned out to be different. https://t.co/AeZPihnldi","date":"Sat Jun 25 17:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A surgeon lost his life savings. Others have given up on their dreams. All of them were swept up in crypto mania—and the crash. https://t.co/kHX6qgdMle","date":"Sat Jun 25 17:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"What it looks like when an American city gets crushed by inflation https://t.co/xORPWl9oUM","date":"Sat Jun 25 17:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A month after a gunman stormed Robb Elementary School, killing 19 fourth-graders and two teachers while police waited more than an hour to intervene, the people of Uvalde continue to ask questions https://t.co/jDBfxFs8pm","date":"Sat Jun 25 17:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Why Amazon is full of brands like \"QNTRY\" https://t.co/Jq73RsK82M","date":"Sat Jun 25 16:35:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"How do you know if your kid’s videogame habit is helpful or if it’s too much time on the console? @juliejargon looks at the research #WSJWhatsNow https://t.co/43vQ9uAyKW https://t.co/FWF2EBOv80","date":"Sat Jun 25 16:30:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A day after Ukraine ordered its troops to withdraw from the key eastern city of Severodonetsk, its forces continued to defend nearby Lysychansk in the war for control of Ukraine’s eastern Donbas region https://t.co/s6mv1NMdIu","date":"Sat Jun 25 16:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Delta Air Lines has a new message for travelers used to logging several hours on their laptops at its airport clubs: Don’t overstay your welcome https://t.co/HbjTNJmk54","date":"Sat Jun 25 16:00:19 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"After more than two decades, the CIA headquarters finally got its new gym https://t.co/sfafxOHLkP","date":"Sat Jun 25 15:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Demonstrations are expected across the country after the Supreme Court’s decision ended nearly 50 years of constitutional protection for abortion rights https://t.co/eDvbRFs6Cq","date":"Sat Jun 25 15:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ukraine’s Snake Island has been fiercely contested territory since Russia conquered it in February. But for Moscow, it’s as much a liability as an asset. https://t.co/1BsmxotINR","date":"Sat Jun 25 15:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Spotted on Instagram three years ago and quickly vouched for by a savvy handful of artists, dealers and advisers, Anna Weyant is now internationally coveted for her paintings of vulnerable girls and mischievous women in sharply lit, old-master hues. https://t.co/A194xyQWiU","date":"Sat Jun 25 15:00:23 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President George W. Bush named two conservative justices to the Supreme Court. Now the different visions of Chief Justice John Roberts and Justice Samuel Alito are plain. https://t.co/MkZkar9bsc","date":"Sat Jun 25 14:45:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Diaries of residents who lived through Shanghai's unprecedented battle against Covid-19 reveal their journey from complacency to shock to a growing disillusionment with the government https://t.co/xZeK7NfVht","date":"Sat Jun 25 14:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Pfizer-BioNTech vaccines modified to target Omicron produced stronger immune responses in study subjects than the original Covid-19 shot, the companies say https://t.co/bfSB7ZvOiU","date":"Sat Jun 25 14:13:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Bill Gates said he thinks cryptocurrencies and NFTs are “100%” based on the greater fool theory https://t.co/1HO4WIjVx8","date":"Sat Jun 25 14:00:24 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The White House endorses a House bill that would require the Federal Reserve to include racial equity in making monetary policy decisions. Such racial favoritism almost certainly violates the Constitution. https://t.co/v1Ju2sySrM","date":"Sat Jun 25 13:45:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Justice Clarence Thomas’s abortion opinion is urging scrutiny of same-sex marriage and contraception. Many conservatives dismiss that prospect.  https://t.co/nDxcWQVUDG","date":"Sat Jun 25 13:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Spiking mortgage rates, bidding wars and limited options. What it takes to buy your first home now. https://t.co/FTYrQ2JAzl","date":"Sat Jun 25 13:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Vladimir Putin has made clear that he has imperial designs beyond Ukraine. Will he act on them? https://t.co/m2WGWlMuzK","date":"Sat Jun 25 13:00:27 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The number of U.S. residents in Portugal climbed by 45% last year. Here's what to know about why so many Americans are making the country their home base. https://t.co/QYSyGuYh1d","date":"Sat Jun 25 12:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"How not to lose a worker in 90 days: companies’ secret to keeping new hires for the long term https://t.co/qQ42vEdqLw","date":"Sat Jun 25 12:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Summer is supposed to be an idle, relaxing season, writes humor columnist @jasongay. When did it become the most hectic part of the year? https://t.co/gJOvovbgxT","date":"Sat Jun 25 12:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Medicare’s prescription-drug program could save billions of dollars annually if it purchased generic acid-reflux, cancer and other drugs from a new pharmacy backed by Mark Cuban, Harvard researchers say https://t.co/cKqcSyaAjV","date":"Sat Jun 25 12:00:30 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Talks on restoring the 2015 Iran nuclear deal will resume in the coming days, the EU's foreign-policy chief said, after they broke off in March https://t.co/feU1naFIvk","date":"Sat Jun 25 11:45:57 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"For investor Ron Gonen, making our “take-make-waste” economy more environmentally friendly is a business priority https://t.co/DWv1LsGwUr","date":"Sat Jun 25 11:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Shipping prices between the U.S. and China have cooled in recent months as some U.S. importers cut orders amid a backlog of inventory #WSJWhatsNow https://t.co/V4TW6An1X6 https://t.co/zxDsr8eXK7","date":"Sat Jun 25 11:30:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Citigroup’s former CEO on the bank’s four-year-old gun policy: “We were kind of lonely in that voice, but I absolutely think it resonated” https://t.co/hytKfxAOJe","date":"Sat Jun 25 11:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"People are showing up at New York’s Metropolitan Museum of Art to see a marble statue of Rihanna featured by Vogue. There's just one problem: it doesn't exist. https://t.co/un5RNaKBkk","date":"Sat Jun 25 11:00:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Following the decision to overturn Roe v. Wade, a patchwork of state laws means abortion access will vary widely depending on where someone lives https://t.co/efvxJuZYAK","date":"Sat Jun 25 10:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Actress Alyson Hannigan and her husband, Alexis Denisof, are listing their roughly 3.25-acre Los Angeles property for $18 million https://t.co/x4gKGt9trk","date":"Sat Jun 25 10:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A suspected terrorist shooting outside a gay nightclub in Oslo killed two people and wounded 14, hours before a Pride parade was set to begin https://t.co/Sf8d9IQ8Rv","date":"Sat Jun 25 09:51:26 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A New York library reversed its decision to ban displays of children's books with LGBT characters after criticism from residents and the governor https://t.co/Kpx0iHtZaZ","date":"Sat Jun 25 09:45:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take a look at the front page of today's Wall Street Journal https://t.co/9XqEKcI7uy https://t.co/jae31Vtd3K","date":"Sat Jun 25 09:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Europeans are likely to see real wages fall faster than their U.S. counterparts, as Russia’s invasion of Ukraine sends inflation on a fresh surge, threatening to push the continent into recession https://t.co/BKuX6zHuz2","date":"Sat Jun 25 09:00:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"With airfares soaring, now might seem like the perfect time to finally cash in your frequent-flier miles. But they’re harder than ever to redeem. We asked mileage experts for their best advice.  https://t.co/24k45EItRj","date":"Sat Jun 25 08:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Rising gasoline prices are prompting more employers to pitch in to pay workers’ costs at the pump https://t.co/yuZilxsYhh","date":"Sat Jun 25 08:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In the run-up to the Supreme Court ruling that overturned Roe v. Wade, fertility doctors were making contingency plans that included limiting services in states that might restrict their operations https://t.co/OYk0elmi9q","date":"Sat Jun 25 07:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Cadillac plans to price a future electric sedan at around $300,000, according to people familiar with the matter, testing the cachet of GM’s luxury brand https://t.co/7CDxVxHD0l","date":"Sat Jun 25 07:00:17 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Cooperation between governments and religious schools doesn’t establish religion, and antireligious discrimination is inconsistent with the guarantee of free exercise, writes @RickGarnett https://t.co/L9uslj4oi2","date":"Sat Jun 25 06:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"If you want to be reminded just how tiny you are, you could gaze at the night sky, stand atop a mountain and contemplate its immensity—or try to find the best garlic press on Amazon https://t.co/YPsjGyCnpt","date":"Sat Jun 25 06:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Juul Labs won a temporary stay of the FDA’s order for the vaping company to pull its e-cigarettes off the U.S. market https://t.co/eiow7vmWp8","date":"Sat Jun 25 06:00:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In Ukraine’s eastern region of Donbas, residents have been caught for years between Russia’s occupation and their own country’s skepticism of their loyalty. https://t.co/H9iO3Gi88E","date":"Sat Jun 25 05:45:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court upheld abortion restrictions in Mississippi and eliminated the constitutional right to an abortion that was first established in the 1973 Roe v. Wade decision. Here’s a look at the court’s journey. https://t.co/bDZWPOmd1R","date":"Sat Jun 25 05:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Chinese President Xi Jinping will visit Hong Kong next week to mark the 25th anniversary of the city’s handover from the U.K. and inaugurate a new government  https://t.co/MNPHhGsgkW","date":"Sat Jun 25 05:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"At the U.S. championships, Sha’Carri Richardson shockingly failed to advance in the 100 meters. The sprint sensation won’t race in next month’s world championships in her signature event. https://t.co/1np00I2c7X","date":"Sat Jun 25 05:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/jZyGlunfqp https://t.co/7jRWw1e6kl","date":"Sat Jun 25 04:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Following the decision to overturn Roe v. Wade, a patchwork of state laws means abortion access will vary widely depending on where someone lives https://t.co/t6KkCmengc","date":"Sat Jun 25 04:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Chevron plans to sell its current headquarters in California and is offering to move some employees to Texas https://t.co/x1mHRTeIrg","date":"Sat Jun 25 04:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Some design pros say today’s inflatable outdoor furniture is a fresh take on a pop classic. Others say inflatable furniture is just too juvenile. We let them hash it out. https://t.co/fEQaIwHjIi","date":"Sat Jun 25 04:00:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“XXL Paper,” a new exhibition opening July 1 at Amsterdam’s Rijksmuseum, spotlights a range of mammoth works in the museum’s collection https://t.co/LBzoN1p3X0","date":"Sat Jun 25 03:45:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The Senate gun bill is terrible. The Senate’s job is to help draft good laws by cooling the passions of the moment. Right now, it is failing, writes @LeiderRob. https://t.co/oqvQGuMI0m","date":"Sat Jun 25 03:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Thousands of abortion-rights supporters congregated in cities across America in reaction to the Supreme Court ruling overturning Roe v. Wade. https://t.co/3qBGoAOJCN","date":"Sat Jun 25 03:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Yogi Berra observed, “It’s tough to make predictions, especially about the future.” But scientists often do, to gain insight into questions about the present. https://t.co/BKEEi2Zg45","date":"Sat Jun 25 03:00:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Hackers have stolen roughly $100 million in cryptocurrency from a blockchain bridge, technology company Harmony said https://t.co/Vy9YidfEu0","date":"Sat Jun 25 02:45:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Want clothes worth bragging about? These six men’s garments have stories so fascinating, they’ll make you even more interesting when someone compliments you on them. And someone will. https://t.co/hd84CTnLGc","date":"Sat Jun 25 02:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"China cybersecurity investigators launched a probe of the operator of the country’s biggest academic database, as Beijing heightens scrutiny of tech firms with troves of data https://t.co/eVRfLpgXhA","date":"Sat Jun 25 02:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Pressure sensors, app connectivity, and multiple brushing modes, oh my! Is a $300 electric toothbrush in your future? We asked dentists. https://t.co/wmR35K0GTT","date":"Sat Jun 25 02:00:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Index provider FTSE Russell is set to rebalance its stock benchmarks at the close of trading Friday, moving companies like Meta, Netflix and PayPal into the value benchmark #WSJWhatsNow https://t.co/nmKV0c0bSC https://t.co/tvzktS6zp7","date":"Sat Jun 25 02:00:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"For the conservative legal movement, “this was not a matter of deciding whether abortion is a good idea or a bad idea.” How it pushed to overturn Roe. https://t.co/S00CorSBkO","date":"Sat Jun 25 01:45:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Protecting due process shouldn’t be controversial. Colleges can’t be permitted to sweep sexual-misconduct allegations under the rug or ignore basic procedural protections, writes Joe Cohn. \nhttps://t.co/lnxfmR9T0o","date":"Sat Jun 25 01:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Businesses with health plans covering abortion now are weighing whether and how to pay for employees to travel to a state where the procedure is legal https://t.co/j0NJZyBUTQ","date":"Sat Jun 25 01:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"How did Vuitton fill its Virgil-sized hole? With a tremendous amount of Instagrammable spectacle and Abloh-inflected clothes https://t.co/lLBCGCFhLU","date":"Sat Jun 25 01:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: CarMax is thriving despite sky-high used-car prices and rock-bottom consumer sentiment https://t.co/fNAnly3C6E","date":"Sat Jun 25 00:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A Supreme Court ruling that ended the constitutional right to an abortion elicited strong responses from a range of U.S. leaders, exposing one of the deepest fault lines in American politics https://t.co/WiG7jfIun3","date":"Sat Jun 25 00:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The NFL is seeking a new media-rights deal for its Sunday Ticket subscription package, which has suffered from cord-cutting and scheduling changes https://t.co/PtrRL9ANlx","date":"Sat Jun 25 00:15:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"This month’s monumental flooding in and around Yellowstone National Park has left this Montana town largely cut off from its economic lifeblood https://t.co/E92nSZq39O","date":"Sat Jun 25 00:00:25 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The first step to recovery is supposed to be admitting you have a problem. But Illinois Gov. Pritzker still won’t, even after Ken Griffin said he’s moving his Citadel hedge fund and securities trading firm to Miami from Chicago. https://t.co/k9vYpWO6H8","date":"Fri Jun 24 23:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Chevron plans to sell its current headquarters in California and is offering to move some employees to Texas https://t.co/gV21Nr6rmw","date":"Fri Jun 24 23:30:17 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"‘Gigantic money furnaces:’ Elon Musk said Tesla’s factories in Germany and Texas are losing billions of dollars as supply-chain snags and battery-cell manufacturing hurdles limit production #WSJWhatsNow https://t.co/U93VjTCP6u https://t.co/yA3XU7RUrv","date":"Fri Jun 24 23:30:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @BuySideWSJ: “This table may actually be indestructible. OK, I haven’t taken our chain saw to it or heaved it off a cliff, but after a year it still looks new. And it was a rough 12 months.” Why our editor fell in love with an outdoor dining table. https://t.co/rWBVZ13NF5","date":"Fri Jun 24 23:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Spirit Airlines said Friday that its board of directors rejected the latest takeover bid from JetBlue Airways and instead will recommend that shareholders accept a new higher offer from Frontier Airlines https://t.co/8bFya66cFf","date":"Fri Jun 24 23:06:40 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"School cafeterias test new dishes with the toughest food critics: their own students https://t.co/lzl5dGsR5D","date":"Fri Jun 24 23:00:20 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"🎧 Listen: In today's episode of The Journal podcast, @LauraKusisto breaks down the Supreme Court's decision to overturn Roe v. Wade and explains how state governments are responding https://t.co/D8OvHGQg2z","date":"Fri Jun 24 22:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"NASA asked a Boston auction house to not auction off cockroaches, moon dust and other items related to the 1969 Apollo 11 space mission, saying they are government property https://t.co/VG44EFEaeU","date":"Fri Jun 24 22:30:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"With airfares soaring, now might seem like the perfect time to finally cash in your frequent-flier miles. But they’re harder than ever to redeem. We asked mileage experts for their best advice.  https://t.co/w4vTDISo3O","date":"Fri Jun 24 22:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The fate of former Theranos president Ramesh “Sunny” Balwani is now in the hands of jurors after a federal judge handed them the criminal-fraud case https://t.co/S8QuJ6pDCa","date":"Fri Jun 24 22:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A Cuban court imposed prison sentences on two Cuban artists who took part in composing and recording “Patria y Vida,” the viral rap song that became the anthem for disaffected Cubans banned by Cuba’s Communist regime and won two Latin Grammys last year https://t.co/1Eh32KRwq4","date":"Fri Jun 24 21:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Political manners seem to be growing subservient to the threat of violence. It feels like the 1850s, writes Lance Morrow. https://t.co/u7ePNzjYtG","date":"Fri Jun 24 21:35:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Making purchases with buy now, pay later companies is easy. Getting money back after a return or recall can take months—if it happens at all. https://t.co/oua8KgUjJH","date":"Fri Jun 24 21:25:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Juul Labs won a temporary stay of the FDA’s order for the vaping company to pull its e-cigarettes off the U.S. market https://t.co/2CJVWAPVba","date":"Fri Jun 24 21:14:26 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Biden administration’s overhaul of a largely moribund student debt forgiveness program for public-service employees has led to $8.1 billion in approved relief for 145,000 borrowers since October https://t.co/msQJuB0LXd","date":"Fri Jun 24 21:00:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Actress Alyson Hannigan and her husband, Alexis Denisof, are listing their roughly 3.25-acre Los Angeles property for $18 million https://t.co/ZHzRcjvMlM","date":"Fri Jun 24 20:45:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Democrats on the campaign trail are working to harness anger over the undoing of Roe v. Wade to motivate voters in November https://t.co/v447ai6DYG","date":"Fri Jun 24 20:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Stocks rallied as investors tempered rate-increase expectations. The Dow jumped more than 800 points as the S&amp;P 500 snapped a three-week losing streak. https://t.co/ZA7A6QkoYz","date":"Fri Jun 24 20:14:35 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Inflation and market saturation make it harder for Netflix to attract subscribers, but as @djtgallagher explains, partnerships will help it enter the ad business faster #WSJWhatsNow https://t.co/RBW33GMQVg https://t.co/4KWv1wyL5D","date":"Fri Jun 24 20:00:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court’s decision to overrule Roe v. Wade triggered immediate responses across the U.S., as conservative states moved forward with new abortion restrictions and some clinics suspended service https://t.co/h4TMPo7YiS","date":"Fri Jun 24 19:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Leaders of United Airlines’ pilots union signed off on a tentative contract agreement that would raise pilots’ pay by more than 14% within 18 months https://t.co/afzCskNS5c","date":"Fri Jun 24 19:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: In the 1973 abortion case, not today, the justices overstepped their boundaries and made their institution political, write @DavidRivkin and @jennmascott https://t.co/rwNtqyLGdQ","date":"Fri Jun 24 19:15:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Former guerrilla Gustavo Petro won Colombia’s presidency promising jobs for all and cuts to oil output, but many doubt he can bring sweeping change https://t.co/RaqNoBf2Lc","date":"Fri Jun 24 19:00:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Citigroup and JPMorgan will start to pay for employees to travel for abortions now that the Supreme Court has struck down the federal constitutional right for the procedure https://t.co/U0HKL4So2L","date":"Fri Jun 24 18:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Europeans are likely to see real wages fall faster than their U.S. counterparts, as Russia’s invasion of Ukraine sends inflation on a fresh surge, threatening to push the continent into recession https://t.co/VE7EQ7JjJK","date":"Fri Jun 24 18:30:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A New York library reversed its decision to ban displays of children's books with LGBT characters after criticism from residents and the governor https://t.co/6YYEbH0R8A","date":"Fri Jun 24 18:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court has overturned Roe v. Wade, leaving the legal fate of abortion up to individual states. Here are key excerpts from the majority opinion and a dissent from the court’s liberal justices. https://t.co/tDZFT43bFT","date":"Fri Jun 24 18:01:41 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The House passed the widest firearms legislation in decades, hours after the bipartisan package won Senate approval, clearing the way for President Biden’s signature https://t.co/64apG34axw","date":"Fri Jun 24 17:53:46 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The U.N. human rights office said its investigation into the death of Palestinian-American journalist Shireen Abu Akleh found Israeli forces fired the shots that killed her last month https://t.co/2HqmDhIhjh","date":"Fri Jun 24 17:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The House is expected to approve landmark gun legislation, hours after the Senate passed the measure with bipartisan support, giving supporters hope that the country’s political system can respond to mounting gun violence https://t.co/x8WbbZdXYy","date":"Fri Jun 24 17:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Consumers’ replies to the question “by about what percent do you expect prices to go up or down on the average, during the next 12 months?” show a fondness for round numbers and partisanship, and can sway Fed decisions, writes columnist @JoshZumbrun https://t.co/Xtx0Z2vjx7","date":"Fri Jun 24 17:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"School cafeterias test new dishes with the toughest food critics: their own students https://t.co/bqwAY7Mb7U","date":"Fri Jun 24 17:00:18 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJOpinion: The problems posed by the recent violent gun crimes are real, write Paul Clement and Erin Murphy. But the solution isn’t to fire clients who have just vindicated a fundamental constitutional right. We are sticking with our clients. https://t.co/zdSJMzRfRU","date":"Fri Jun 24 16:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President Biden is addressing the nation after the Supreme Court overturned Roe v. Wade. Watch live. https://t.co/SSgdAMenAo","date":"Fri Jun 24 16:39:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Juul has been exploring a possible bankruptcy filing if the FDA ban on its e-cigarettes stands, people familiar with the matter say. It has asked a court to block the order. https://t.co/YtYuOdYrju","date":"Fri Jun 24 16:35:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Boris Johnson’s ruling Conservative Party lost two seats in the British Parliament, dealing a fresh blow to his leadership as he struggles to retain support https://t.co/dNStDimdiV","date":"Fri Jun 24 16:30:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Between canceled flights, crowded airports and missing bags, it’s a chaotic time to travel. Here’s how to prepare. https://t.co/XaubtqDkjm","date":"Fri Jun 24 16:15:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Teenagers are rescuing business owners who are struggling to find enough workers in one of the hottest job markets in decades, explains @KathrynDill #WSJWhatsNow https://t.co/KPjdCI8KYv https://t.co/HVztlBtqQ3","date":"Fri Jun 24 16:00:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The CDC recommended use of Moderna’s Covid-19 vaccine in children 6 to 17 years, the final step in allowing the shots to become widely available https://t.co/4CdBHuv6rY","date":"Fri Jun 24 15:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: Now that the Supreme Court has overturned Roe v. Wade, the legal fate of abortion is left up to individual states. @JenCalfas explains where abortion access in the U.S. stands now. https://t.co/MkgmDA7uau","date":"Fri Jun 24 15:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court’s decision overruling Roe v. Wade establishes new political battlegrounds for abortion across the 50 states, many of which could see lengthy clashes over restricting or protecting access to the procedure https://t.co/pbCN5vohuH","date":"Fri Jun 24 15:15:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The fall of Roe v. Wade will upend a half-century of reproductive healthcare across the U.S., changing where and how women access abortion and their decisions about whether to have children https://t.co/h0I7VDJRL7","date":"Fri Jun 24 15:00:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court upheld abortion restrictions in Mississippi and eliminated the constitutional right to an abortion that was first established in the 1973 Roe v. Wade decision. Here’s a look at the court’s journey. https://t.co/2Rpql2X9Sv","date":"Fri Jun 24 14:47:50 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Following the decision to overturn Roe v. Wade, a patchwork of state laws means abortion access will vary widely depending on where someone lives https://t.co/tQAA8WKsVR","date":"Fri Jun 24 14:29:42 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court’s decision in Dobbs v. Jackson Women’s Health Organization upheld a law from Mississippi that bans abortion after 15 weeks of pregnancy. \n\nFollow our live coverage of the ruling. https://t.co/wKiFYBszky https://t.co/5dc77CwVIV","date":"Fri Jun 24 14:23:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Breaking: The Supreme Court has overruled Roe v. Wade. The decision eliminates the constitutional right to an abortion that had stood for half a century. https://t.co/SBiUGWb2Le","date":"Fri Jun 24 14:16:42 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Making purchases with buy now, pay later companies is easy. Getting money back after a return or recall can take months—if it happens at all. https://t.co/z3Z0J3ao3I","date":"Fri Jun 24 14:00:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Juul Labs asked a federal appeals court to temporarily block the FDA order that the vaping company pull its e-cigarettes off the U.S. market https://t.co/jTgzK3laMP","date":"Fri Jun 24 13:45:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Index provider FTSE Russell is set to rebalance its stock benchmarks at the close of trading Friday, moving companies like Meta, Netflix and PayPal into the value benchmark #WSJWhatsNow https://t.co/nmKV0c0bSC https://t.co/za2w7zJ5xy","date":"Fri Jun 24 13:40:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"This month’s monumental flooding in and around Yellowstone National Park has left this Montana town largely cut off from its economic lifeblood https://t.co/JJVj5Fzobu","date":"Fri Jun 24 13:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"At the U.S. championships, Sha’Carri Richardson shockingly failed to advance in the 100 meters. The sprint sensation won’t race in next month’s world championships in her signature event. https://t.co/coXlA7WPDD","date":"Fri Jun 24 13:21:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court has nine cases remaining from this term on which it still has to issue opinions, including decisions on abortion and the interplay between church and state. Here are five to watch. https://t.co/qGaLBBbURV","date":"Fri Jun 24 13:13:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Rising gasoline prices are prompting more employers to pitch in to pay workers’ costs at the pump https://t.co/iamT3QT5sY","date":"Fri Jun 24 13:00:24 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: Partnerships would allow Netflix to enter ad business faster as inflation and market saturation make subscriber growth harder https://t.co/G8oI4XWHWe","date":"Fri Jun 24 12:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ethanol prices have risen steadily, boosted by a mandate to blend more of it into gasoline, and some of the highest inflation in decades https://t.co/c2pbZcdIXi","date":"Fri Jun 24 12:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Cadillac plans to price a future electric sedan at around $300,000, according to people familiar with the matter, testing the cachet of GM’s luxury brand https://t.co/nq4Oqs9Kcn","date":"Fri Jun 24 12:15:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Fertility doctors are making contingency plans that include limiting services in states that might restrict their operations if Roe v. Wade is overturned https://t.co/XbUD29CTuf","date":"Fri Jun 24 12:00:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Video: Lawmakers approved the most significant firearms legislation in decades, following deadly attacks around the U.S. https://t.co/HxMUemBcil","date":"Fri Jun 24 11:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Stock futures rose, putting the S&amp;P 500 on track for its first weekly gain in June https://t.co/STA9HZPBWN","date":"Fri Jun 24 11:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Accounting firm EY has made changes to its planned split, including agreeing to payouts for partners who retire before the deal closes https://t.co/xIj3PzFJ4y","date":"Fri Jun 24 11:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"More than a dozen Republicans joined with Democrats in supporting the most significant firearms legislation in decades #WSJWhatsNow https://t.co/aS7g5FVGlX https://t.co/7cBsScpp0s","date":"Fri Jun 24 11:00:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"When European Union leaders cracked open the door to Ukraine, they snubbed Georgia, another victim of Russian aggression https://t.co/TMj7ldCdS4","date":"Fri Jun 24 10:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. gas prices have hit a record high and are showing no signs of going down. Here's why. https://t.co/T4Bykbozrn","date":"Fri Jun 24 10:00:19 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Mercury, Venus, Mars, Jupiter and Saturn will all be visible in the early morning sky Friday, as the planets align in orbital order this month for the first time in 18 years https://t.co/gGS5VEHLSD","date":"Fri Jun 24 09:45:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/jCSZPbJ4wJ","date":"Fri Jun 24 09:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The summer's essential products to help you look sun-kissed and dewy while avoiding sunburn and mosquito bites https://t.co/iXAW6DjMYy","date":"Fri Jun 24 09:00:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"China’s ambassador to Australia said he believed relations between the two countries could improve, in a speech that was interrupted several times by anti-China protesters https://t.co/cjbtGAVC6s","date":"Fri Jun 24 08:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In Boulder, Colorado, a home asking $19.875 million would set a record if it fetches its asking price https://t.co/jTv6OdvFXq","date":"Fri Jun 24 08:30:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Alibaba-backed startup GogoX raised $85 million in a scaled-back Hong Kong IPO https://t.co/Z4kjYCEX8F","date":"Fri Jun 24 08:15:24 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ukraine ordered troops to withdraw from the eastern city of Severodonetsk, giving Russia a symbolically important victory in the battle for Donbas https://t.co/x7c860YmEE","date":"Fri Jun 24 08:00:59 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Trumpet, a bloodhound, is the first of his breed to win at the Westminster Kennel Club Dog Show https://t.co/IoZf2FuR1l","date":"Fri Jun 24 07:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The Supreme Court’s 6-3 ruling Thursday on gun rights boils down to this: The Second Amendment doesn’t disappear when you walk out your front door. https://t.co/fcLVCtMpXi","date":"Fri Jun 24 07:00:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"People are showing up at New York’s Metropolitan Museum of Art to see a marble statue of Rihanna featured by Vogue. There's just one problem: it doesn't exist. https://t.co/zWFY2AI0i6","date":"Fri Jun 24 06:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Senate voted 65-33 to approve a bipartisan gun bill in the wake of a series of mass shootings, the most significant firearms legislation in decades https://t.co/Kn6DXEz8Y1","date":"Fri Jun 24 06:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The law firm that secured Thursday’s Second Amendment victory at the Supreme Court has announced that it will no longer take firearms cases, and is parting ways with the two star partners who won the case https://t.co/UiAAxXJ2X5","date":"Fri Jun 24 06:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Americans could wait longer to start emptying retirement accounts and face fewer restrictions on emergency withdrawals under a bill advanced unanimously by a Senate committee https://t.co/xPLGEr77tc","date":"Fri Jun 24 06:00:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Inflation in Japan stayed above the Bank of Japan’s target for a second successive month https://t.co/VdhMdVj2Qe","date":"Fri Jun 24 05:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Companies in China are cutting back on digital-ad spending as the economy slows and recurring Covid-19 outbreaks weigh on consumption https://t.co/jStLkwgyDE","date":"Fri Jun 24 05:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Bitcoin isn’t going away because the ideology underlying it isn’t. There has always existed a strand in the American political tradition that is skeptical of the government’s ability to manage the money supply, writes @maxraskin. https://t.co/PFCrH3vgXA","date":"Fri Jun 24 05:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ken Griffin's hedge fund Citadel is moving its headquarters to Miami from Chicago, the latest major company to announce plans to leave Illinois https://t.co/3KEuTjqz48","date":"Fri Jun 24 05:00:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/gTwOvwHyFv","date":"Fri Jun 24 04:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Mercury, Venus, Mars, Jupiter and Saturn will all be visible in the early morning sky Friday, as the planets align in orbital order this month for the first time in 18 years https://t.co/96wYJHh5lJ","date":"Fri Jun 24 04:00:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The FDA hsd ordered Juul to halt sales of all of its e-cigarette products in the U.S. https://t.co/1oLb3ymr1N","date":"Fri Jun 24 03:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Donald Trump and Joe Biden both face rejection, writes @Peggynoonannyc. The Jan. 6 hearings are helping Republicans solve their problem. It’s unclear what Democrats will do. https://t.co/eTL21CgNSQ","date":"Fri Jun 24 03:30:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Word on the Street: Before it became a game of chance, “Bingo” was an expression of surprise derived from a song https://t.co/6pNCZWWvCq","date":"Fri Jun 24 03:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"With a six-figure price tag, the Lexus LX 600 F Sport Handling aspires to be a luxury, go-anywhere SUV. But its extravagance is off-putting, says car columnist Dan Neil.  https://t.co/LzuN4p1zz0","date":"Fri Jun 24 03:00:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Alex Blavatnik, brother of billionaire Len Blavatnik, has purchased a penthouse adjacent to New York City’s Museum of Modern Art for nearly $25 million https://t.co/8EAd5709DY","date":"Fri Jun 24 02:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Biden got what he wanted, and it’s making life harder for ordinary Americans, writes @KarlRove. Because of that, there will be hell for Democrats to pay come November. https://t.co/oloZ38R2pC","date":"Fri Jun 24 02:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The legislation would help states put in place and enforce extreme risk protection orders, remove guns from people deemed dangerous, close the so-called \"boyfriend loophole,\" and expand background checks for buyers under 21 https://t.co/4SdMpLylWA","date":"Fri Jun 24 02:27:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Breaking: The Senate has voted 65-33 to approve a bipartisan gun bill in the wake of a series of mass shootings, the most significant firearms legislation in decades https://t.co/geHsqg4d7l","date":"Fri Jun 24 02:21:45 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Is the skinny suit on its way back in? Everything old was new again at Milan men’s fashion week https://t.co/5MM7ieZCAk","date":"Fri Jun 24 02:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"For a growing number of nature-seeking homeowners, the great outdoors isn't just a backdrop anymore. \"It's a core amenity.\" https://t.co/lZwASiUKwn","date":"Fri Jun 24 02:00:19 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Klarna's valuation—which one soared to $46 billion—has fallen with investors and could dip as low as $10 billion as the startup seeks fresh funding, according to people familiar with the company https://t.co/OsKdxug3bw","date":"Fri Jun 24 01:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Democrats lose ‘gun control’: This week’s Senate compromise reflects a recognition of legal and political reality, writes @KimStrassel\nhttps://t.co/QCiVaviZ2R","date":"Fri Jun 24 01:40:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The number of infant adoptions in the U.S. might go up if the Supreme Court overturns Roe. v Wade, say those who study and work in the adoption industry. But adoption agencies and the prospective adoptive parents are in a wait-and-see mode for now. https://t.co/PDqOWyXqYa","date":"Fri Jun 24 01:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The last Howard Johnson’s restaurant closed but HoJo’s superfans are still sizzling—road-tripping to closed sites, collecting memorabilia and hoping for a revival. “Long live the ‘Orange Roof!’ ” https://t.co/98SXrxBhVu","date":"Fri Jun 24 01:15:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Between canceled flights, crowded airports and missing bags, it’s a chaotic time to travel. Here’s how to prepare. https://t.co/9wriQmWetM","date":"Fri Jun 24 01:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"People are showing up at New York’s Metropolitan Museum of Art to see a marble statue of Rihanna featured by Vogue. There's just one problem: it doesn't exist. https://t.co/NoCNcmv20M","date":"Fri Jun 24 00:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In video testimony played at Thursday's Jan. 6 Committee hearing, former White House aides said several Republican members of Congress, including Reps. Matt Gaetz, Louie Gohmert, Mo Brooks, Andy Biggs and Scott Perry, had asked for presidential pardons https://t.co/xhT0b8EAal","date":"Fri Jun 24 00:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. diplomats and intelligence officers most seriously affected by the mysterious ailment known as Havana Syndrome could soon be eligible for six-figure federal compensation payments, people familiar with the matter said https://t.co/zmmH2KaRyH","date":"Fri Jun 24 00:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Merck is pushing forward with a potential deal for biotech company Seagen, according to people familiar with the matter, in what would be one of the largest takeovers of the year https://t.co/9f2nbo7OqN","date":"Thu Jun 23 23:58:29 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The last thing America needs is job losses. That’s what we’ll get if the Biden administration doesn’t reverse its plan to double-tax some of the country’s largest corporations, writes Travis Nix. https://t.co/CqT6lO6Iqx","date":"Thu Jun 23 23:50:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The law firm that secured Thursday’s Second Amendment victory at the Supreme Court has announced that it will no longer take firearms cases, and is parting ways with the two star partners who won the case https://t.co/FIvXkVqHZg","date":"Thu Jun 23 23:50:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Essay: As the Supreme Court considers the future of Roe v. Wade, studies from a controversial body of economic research makes the case that legalized abortion brings broad social benefits https://t.co/GvzpfOUGnh","date":"Thu Jun 23 23:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"An Argentine judge ruled that Diego Maradona’s medical team will stand trial on homicide charges following allegations that negligence in treatment contributed to the soccer player’s death in 2020 https://t.co/KY1YTq56v6","date":"Thu Jun 23 23:20:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"🎧 Listen: In today's episode of The Journal podcast, @Annie_Gasparro explains how the humble rotisserie chicken has stayed inflation-proof and chronicles the history of America’s love for the golden bird  https://t.co/ZoRG7P1cK0","date":"Thu Jun 23 23:10:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The latest report notifying federal health regulators that a baby died after it had consumed Abbott's baby formula mentions the cronobacter bacteria, the FDA said, the same bacteria that previously sickened at least four other infants https://t.co/vYMPzRys3j","date":"Thu Jun 23 23:00:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @BuySideWSJ: Are you ready for Amazon Prime Day? The site’s biggest sale is July 12-13. There are things you can start doing today to prepare. Tip #1: Start your cart now. https://t.co/RbEoOpzAIZ","date":"Thu Jun 23 22:50:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Russian President Vladimir Putin on Thursday was welcomed at a virtual summit with the presidents of China, India, Brazil and South Africa in a stark reminder of the limits of U.S.-led efforts to ostracize Moscow https://t.co/Azrdyk4UOe","date":"Thu Jun 23 22:40:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Some viewed Klarna as the next PayPal or Block, companies that have grown by stealing business traditionally dominated by banks. Now the startup, which has burned through a chunk of the money it raised in recent years, is seeking fresh funds. https://t.co/FKpzNmDGFR","date":"Thu Jun 23 22:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Capt. Chesley “Sully” Sullenberger said he would step down from his role representing the U.S. at a major international aviation organization, a move that comes about six months after he was confirmed for the position https://t.co/vq00NMQKlp","date":"Thu Jun 23 22:20:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A library board in New York voted to remove a display of children's books that have LGBT characters in them, but said the displays, which celebrate Gay Pride month, will remain up in its teen and adult sections, and people could still check out the books https://t.co/aPtCPuLTZz","date":"Thu Jun 23 22:10:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Companies have long helped sponsor seasonal and high-skilled workers, but now they are offering the benefit to attract and retain low-skilled workers  https://t.co/Z7gn13SKMm","date":"Thu Jun 23 22:00:34 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Emergency aid is arriving in earthquake-stricken eastern Afghanistan, as the Taliban government races to get the recovery effort under way https://t.co/Bq40hyW8DO","date":"Thu Jun 23 21:50:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Amazon is developing a voice-mimicking feature for its virtual assistant Alexa that replicates the speech of people alive and dead https://t.co/vBTLkrDLE4","date":"Thu Jun 23 21:40:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"European Union leaders agreed to make Ukraine an official candidate to join the bloc, opening the door to possible membership in the years to come https://t.co/jWQLpdNHnE","date":"Thu Jun 23 21:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Biden’s energy policy is a jumble of incoherence. He wants political relief from high gas prices but only to get past the next election. https://t.co/8NneOYD0cv","date":"Thu Jun 23 21:20:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Republicans are trying to thwart the rise of former Gov. Eric Greitens in Missouri’s crowded Senate primary, fearful his past scandals could make the election competitive https://t.co/aEIADdVX2t","date":"Thu Jun 23 21:10:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Countries want nuclear power to help tackle climate change and reduce dependence on Russian energy. But projects under way are already years late and billions over budget. https://t.co/sxN6nV8Pen","date":"Thu Jun 23 21:00:29 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Iran’s Islamic Revolutionary Guard Corps named a new intelligence chief on Thursday following a string of suspicious deaths of military officers and scientists https://t.co/4aQENTioOo","date":"Thu Jun 23 20:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"United Airlines said it will cut about 50 domestic departures a day—roughly 12% of its Newark schedule—starting July 1 in an effort to relieve congestion and improve operations at the crowded airport https://t.co/q00qj01NvC","date":"Thu Jun 23 20:35:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"He's been everywhere, man: Johnny Cash's former California home is hitting the market for $1.795 million https://t.co/NkfHAI3C0h","date":"Thu Jun 23 20:25:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A Federal Reserve official said the central bank would need to raise interest rates aggressively this year in order to combat inflation https://t.co/NdlC0Q84oJ","date":"Thu Jun 23 20:15:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Oil Refiners are an obvious target during times of surging gas prices, but @JinjLee explains recent profits are an exception, not the rule. #WSJWhatsNow https://t.co/ZDlWhaF3jo https://t.co/SOEPTe8gEw","date":"Thu Jun 23 20:01:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Nike and Cisco said Thursday they are leaving Russia, months after both companies paused operations in the country because of the war against Ukraine https://t.co/aNPZfFcc2o","date":"Thu Jun 23 19:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. intelligence agencies will be permitted to hire job applicants who have used marijuana in the past, under legislation that passed a Senate committee this week  https://t.co/AKFXXEo7hF","date":"Thu Jun 23 19:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Netflix is laying off about 300 employees globally, following cuts last month that affected 150 employees, as the streaming service tries to control costs and drum up new revenue https://t.co/AVNQlzmLHn","date":"Thu Jun 23 19:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"McDonald’s is planning to make some of the biggest changes in decades to its franchising system, as it seeks to reinvigorate its base of restaurant owners https://t.co/Nf6pNYwpmy","date":"Thu Jun 23 19:00:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: In the U.S., the revenge of the locked-down voters is likely to return conservatives to power this year and in 2024, writes @DanHenninger. Republicans should run on just five words: We will do the opposite. https://t.co/iaCtNced00","date":"Thu Jun 23 18:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Intel has delayed a groundbreaking ceremony for an Ohio plant in a show of frustration over proposed congressional support for the U.S. chip industry https://t.co/yHCV1oMkNo","date":"Thu Jun 23 18:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Biden administration is asking Exxon, Shell and other oil companies to shore up supplies as gasoline hovers near $5 a gallon https://t.co/wk7rbddSH7","date":"Thu Jun 23 18:18:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Investigators searched the home of former Justice Department official Jeffrey Clark, people familiar say. He was an ally in Trump's efforts to overturn the election. https://t.co/memFgq6Nb6","date":"Thu Jun 23 18:07:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Thursday's Jan. 6 committee hearing will focus on Trump’s attempts to enlist senior Justice Department officials, including the acting attorney general, into efforts to block state results ahead of the Capitol riot https://t.co/ATPK9sOwOA","date":"Thu Jun 23 18:00:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Here’s what to know about the crackdown on Juul e-cigarettes, and the regulatory efforts by the Biden administration to eliminate menthol cigarettes and reduce nicotine in cigarettes  https://t.co/RIx12AkJJj","date":"Thu Jun 23 17:30:48 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Increased regulation and increased taxation of capital—two Biden administration policy priorities—are supply-side headwinds that make recession more likely, write @davidrhenderson and @caseybmulligan https://t.co/MVvWTMVWOw","date":"Thu Jun 23 17:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The United States has the world’s best track and field athletes. The sport’s leaders want to make track a top-five sport among U.S. fans. https://t.co/qC4LZVbfWk","date":"Thu Jun 23 16:45:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The last Howard Johnson’s restaurant closed but HoJo’s superfans are still sizzling—road-tripping to closed sites, collecting memorabilia and hoping for a revival. “Long live the ‘Orange Roof!’ ” https://t.co/IWhxlcPoeK","date":"Thu Jun 23 16:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Walmart said it has developed the capability to switch between cloud providers and its own servers, saving millions of dollars and offering a road map to other organizations that want to reduce their dependence on giant technology companies https://t.co/KJwrZo1A9r","date":"Thu Jun 23 16:16:45 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"People who live in Nashville face exceptional inflation, explains @jjmccorvey #WSJWhatsNow https://t.co/ycaOJR2QyI https://t.co/iS5qdmdb1c","date":"Thu Jun 23 16:00:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Countries want nuclear power to help tackle climate change and reduce dependence on Russian energy. But projects under way are already years late and billions over budget. https://t.co/60lpLyhkvP","date":"Thu Jun 23 15:50:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Toyota is recalling all of its new battery-powered sport-utility vehicles after finding the wheels could potentially fall off because of issues with bolts. The recall covers about 2,700 vehicles around the world. https://t.co/Yd6iG7yBbW","date":"Thu Jun 23 15:40:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Russia’s invasion has hit some of the most productive agricultural land, disrupting supplies and pushing up food prices. As harvest season begins, farmers are feeling the heat of relentless fighting. “If they start shooting, we’ll run.” https://t.co/lSohiUtDb0","date":"Thu Jun 23 15:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Students and school employees could soon be able to file grievances for all sex-based discrimination, rather than just sexual harassment and assault, the Education Department said https://t.co/s9rWjsf0VD","date":"Thu Jun 23 15:22:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President Biden has called for a three-month suspension of the federal gasoline tax, but politicians and economists are divided over how much help it would provide consumers, @mccabe_caitlin explains #WSJWhatsNow https://t.co/G1SdFWQMkP https://t.co/TUc1YAEtTQ","date":"Thu Jun 23 15:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Breaking: The FDA ordered Juul to halt sales of all of its e-cigarette products in the U.S. https://t.co/HPNUv1Ayca","date":"Thu Jun 23 14:52:42 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Breaking: In the widest expansion of gun rights in a decade, the Supreme Court struck down a century-old New York law on concealed weapons permits that requires applicants to demonstrate “proper cause” and “good moral character” https://t.co/th4vxDbhvY","date":"Thu Jun 23 14:46:45 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ken Griffin's hedge fund Citadel is moving its headquarters to Miami from Chicago, the latest major company to announce plans to leave Illinois (corrects link) https://t.co/dJd5dOUoIh","date":"Thu Jun 23 14:36:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"New York federal prosecutors asked a judge to sentence convicted sex-trafficker Ghislaine Maxwell to 30 to 55 years in prison for helping disgraced financier Jeffrey Epstein sexually abuse underage teens https://t.co/LUPzAOgq46","date":"Thu Jun 23 14:20:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court said top GOP legislators in North Carolina can step in and advocate for a voter-identification law they believe the state’s attorney general, a Democrat, isn’t adequately defending in court https://t.co/jPvYX1YQ59","date":"Thu Jun 23 14:14:49 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In Pope Francis’ view, the war in Ukraine isn’t a straightforward case of good against evil https://t.co/eSUbvrI3WQ","date":"Thu Jun 23 14:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Walking onto a flight with your luggage can be a safer bet these days. Here’s how to pack it expertly https://t.co/ktQmDxhzGe","date":"Thu Jun 23 13:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court has 13 cases remaining from this term on which it still has to issue opinions, including decisions on abortion and gun rights. Here are seven to watch. https://t.co/TE37OBEaF3","date":"Thu Jun 23 13:30:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: Actor and entrepreneur Ryan Reynolds speaks with The Journal about his recent creative-agency merger, his venture into soccer club ownership and how creativity has been impacted by the pandemic https://t.co/Ad4XR2YfPL","date":"Thu Jun 23 13:16:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Suspending the gas tax could represent a 3.7% discount on a $5 gallon of fuel, but it is unclear how much of the savings will reach consumers https://t.co/5XykAKGsJa","date":"Thu Jun 23 13:00:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A bloodhound called Trumpet won the best in show prize at the Westminster Kennel Club Dog Show https://t.co/y8AefZ2xX5","date":"Thu Jun 23 12:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ohio State University has successfully won the trademark for “THE.” Sports columnist and Wisconsin Badger @JasonGay urges Big Ten colleagues to resist Buckeye word tyranny. https://t.co/LSfWm1Zxjh","date":"Thu Jun 23 12:32:40 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The U.S. is stepping carefully into Central Asia—an area Russia sees as its backyard—to coax governments to help fight any terrorism from Afghanistan https://t.co/awvB8UBnv7","date":"Thu Jun 23 12:16:56 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Netflix’s Co-CEO Ted Sarandos says the company is in talks with multiple potential partners to help it enter the advertising business https://t.co/QUyC0PM1Xs","date":"Thu Jun 23 12:00:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: Individual investors are the only ones keeping the ‘buy the dip’ faith alive. But even their appetite for losses may have limits. https://t.co/2oOXPZfY8F","date":"Thu Jun 23 11:50:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Europe’s economy slowed sharply in June as surging prices of energy and food weakened demand for other goods and services, business surveys showed https://t.co/PoxQl26DAx","date":"Thu Jun 23 11:40:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: Management shake-up shows the business of one-time pandemic darling DocuSign hasn’t yet stabilized https://t.co/El4x15bJGd","date":"Thu Jun 23 11:30:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ukrainian forces outside Lysychansk are nearly surrounded after Russian forces advanced https://t.co/JIiZslwKhK","date":"Thu Jun 23 11:20:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Companies in China are cutting back on digital-ad spending as the economy slows and recurring Covid-19 outbreaks weigh on consumption https://t.co/ZsFJadECeW","date":"Thu Jun 23 11:10:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"‘Gigantic money furnaces:’ Elon Musk said Tesla’s factories in Germany and Texas are losing billions of dollars as supply-chain snags and battery-cell manufacturing hurdles limit production #WSJWhatsNow https://t.co/U93VjTCP6u https://t.co/c201nfaRNF","date":"Thu Jun 23 11:00:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The German government moved closer to rationing natural gas after Russia cut deliveries to the country  https://t.co/7Le4XFEWSe","date":"Thu Jun 23 10:50:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Jan. 6 Hearing: Thursday’s hearing is set for live testimony from officials including Jeffrey Rosen, the former acting attorney general who replaced William Barr in the final weeks of the Trump administration https://t.co/FGXA1vewPJ","date":"Thu Jun 23 10:40:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Fed Chairman Jerome Powell is set to testify before the House Financial Services Committee today https://t.co/cvRKZQWUVU","date":"Thu Jun 23 10:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. stock futures wavered and oil prices slipped ahead of a second day of testimony from Fed Chairman Jerome Powell after he warned that rapidly rising interest rates threatened a recession. https://t.co/ZwTJfkpbR4","date":"Thu Jun 23 10:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Instagram’s new age-verification policy makes it tougher for teens to update to adult accounts. But they can still lie about their age in the first place https://t.co/Qb3k5L0EAr","date":"Thu Jun 23 10:05:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Investors face a big reshuffling in the stock market Friday when index provider FTSE Russell is due to rebalance its stock benchmarks, adding and deleting companies from indexes tied to trillions of dollars of investments https://t.co/wgWpT57VH5","date":"Thu Jun 23 09:55:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Tesla battery supplier Contemporary Amperex Technology raised about $6.7 billion in one of the world’s biggest share sales this year, showing the relative resilience of China’s market for stock offerings https://t.co/JMP6h5GoZZ","date":"Thu Jun 23 09:50:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"BMW opens a $2.2 billion plant in China as it looks to catch up with Tesla and local rivals in the electric-vehicle market https://t.co/PuIsuZQT8o","date":"Thu Jun 23 09:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/sTlt1WIUAA https://t.co/zAowfpGm12","date":"Thu Jun 23 09:30:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ukraine is expected to take a step closer to European Union membership as leaders of the world’s liberal democracies kick off a week of summitry  https://t.co/Q1wN9odNj4","date":"Thu Jun 23 09:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Singapore is capital-intensive, it’s skills-intensive, it’s not labor-intensive.” How the city-state reversed its manufacturing downturn by courting highly automated factories. https://t.co/PwFKWLXKp8","date":"Thu Jun 23 09:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: India is cracking down on fintech firms, many backed by foreign capital. Investors should proceed with extreme caution. https://t.co/qdgafceuhO","date":"Thu Jun 23 08:45:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Sri Lanka's prime minister says the island nation faces “complete collapse” after months of double-digit inflation, power blackouts and shortages https://t.co/Sd6EO0X6jl","date":"Thu Jun 23 08:30:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: How a U.S. container ship crew managed to live and work while stranded at a Shanghai shipyard during the city's Covid-19 lockdown https://t.co/1BfGAXe5RC","date":"Thu Jun 23 08:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“This is an arms race.” In his first press conference since LIV Golf teed off, PGA Tour commissioner Jay Monahan addressed the threat posed by the Saudi-backed upstart—and changes aimed at keeping the best golfers. https://t.co/olBuHivyJR","date":"Thu Jun 23 08:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Most tourists to Brazil have never heard of the Route of the Canyons, in the country’s deep south, but if you’re craving adventure and spectacular beauty, it’s well worth seeking out https://t.co/YIMMlKLOqC","date":"Thu Jun 23 07:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Georgia’s Supreme Court overturned the murder conviction of a father whose 22-month-old son died after he left him in a hot car eight years ago https://t.co/zoAVV0uqgK","date":"Thu Jun 23 07:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"An environmental group’s lawsuit seeks to stop a large gas project off Australia’s coast, arguing that it would further damage the Great Barrier Reef https://t.co/Qf6XwJwj52","date":"Thu Jun 23 07:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. gas prices have hit a record high and are showing no signs of going down. Here's why. https://t.co/pCOQWYA8kN","date":"Thu Jun 23 07:00:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Bare feet on the seats or bulkhead. Watching movies without headphones. And worse. Those annoying in-flight behaviors are back and multiplying as planes fill up https://t.co/m5kyOR5yOd","date":"Thu Jun 23 06:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"On Nantucket, a proposal to allow topless beachgoers has won town approval, an unimaginable move for many of the island’s year-rounders and weekender visitors. It might be time “to go out and buy some stock in Banana Boat [sunscreen],” one supporter said. https://t.co/JToOoji2lM","date":"Thu Jun 23 06:00:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Americans could wait longer to start emptying retirement accounts and face fewer restrictions on emergency withdrawals under a bill advanced unanimously by a Senate committee https://t.co/My0YHBbQSM","date":"Thu Jun 23 05:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Daily Harvest, a plant-based meal-delivery service, recalled its lentil and leek crumbles after dozens of customers reported getting sick, with some saying on social media that doctors were puzzled by symptoms including liver damage, stomach pain and fever https://t.co/dTNBYjxtI6","date":"Thu Jun 23 05:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Ohio State University has successfully trademarked the word “THE,” in a victory for the college and its branding that is sure to produce eye rolls from Michigan fans and other rivals https://t.co/doxqJ2EFqE","date":"Thu Jun 23 05:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Elon Musk called Tesla's plants in Germany and Texas “gigantic money furnaces\" that are \"losing billions of dollars\" in an interview released Wednesday https://t.co/ZZRNFufl9G","date":"Thu Jun 23 05:00:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Tony Siragusa, a former defensive tackle for the Baltimore Ravens and Indianapolis Colts, has died at 55 https://t.co/0j4HLq50Iv","date":"Thu Jun 23 04:45:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/mmnwW35sCn https://t.co/V2lscUAD7d","date":"Thu Jun 23 04:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The FDA is investigating a report that another child has died after consuming Abbott’s baby formula https://t.co/u8xBuqfWqA","date":"Thu Jun 23 04:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: By disrupting global food and energy supplies, Russia seeks to spark multiple international crises, forcing the West to pressure Ukraine into negotiations. The U.S. should spoil the Kremlin’s strategy, writes @sethcropsey https://t.co/mA8RS2rTA5","date":"Thu Jun 23 04:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"PGA Tour commissioner Jay Monahan announced increased purse sizes and other incentives as Saudi-backed LIV Golf continues to poach golfers: “This is an arms race, and if the only weapons here are dollar bills, the PGA Tour can’t compete.\" https://t.co/3sik4MaMIi","date":"Thu Jun 23 03:55:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Andrew Gillum, the Democratic nominee for Florida governor in 2018, was indicted by a federal grand jury and arrested by the FBI, according to court documents https://t.co/aAeVBvhD11","date":"Thu Jun 23 03:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Real-estate pros on stumbling across secret rooms while showing homes: “What if I open this up and it’s bodies or something?” https://t.co/IdxDiLl0aK","date":"Thu Jun 23 03:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Americans could wait longer to start emptying retirement accounts and face fewer restrictions on emergency withdrawals under a bill advanced unanimously by a Senate committee https://t.co/AzyUAPzrJQ","date":"Thu Jun 23 03:15:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A pair of treehouses doesn't seem like an obvious choice for a luxury New York apartment. But these homeowners had space to fill and limited options. https://t.co/9TiXHckE2b","date":"Thu Jun 23 03:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Singapore is capital-intensive, it’s skills-intensive, it’s not labor-intensive.” How the city-state reversed its manufacturing downturn by courting highly automated factories. https://t.co/VhDuVfhM7A","date":"Thu Jun 23 02:45:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"After two years of making her house more livable during the pandemic, our décor columnist didn’t have any creative spark left. Online classes with a design pro fired her up. https://t.co/BpNwW7S0YD","date":"Thu Jun 23 02:30:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Juul e-cigarettes could be ordered off the U.S. market by the FDA as soon as this week, people familiar say https://t.co/YYzqCFT7yE","date":"Thu Jun 23 02:15:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: How the crew aboard a U.S. container ship were stranded at a shipyard, struggled to live and work while under lockdown https://t.co/zFrHbNUHTL","date":"Thu Jun 23 02:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President Biden called for a three-month suspension of federal gasoline and diesel taxes, a move that is unlikely to pass in Congress—or do much to fix high gas prices, economists say https://t.co/LUdbxojKls","date":"Thu Jun 23 01:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: If you suspect $5 gas is due to the U.S. and the world keeping Russian energy off the market, think again: The U.S and its allies have largely failed to keep Russian oil off the market, writes Holman W. Jenkins https://t.co/Oc7CgrX9Nd","date":"Thu Jun 23 01:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. gas prices have hit a record high and are showing no signs of going down. Here's why. https://t.co/UokXZMeW8c","date":"Thu Jun 23 01:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Elon Musk called Tesla's plants in Germany and Texas “gigantic money furnaces\" that are \"losing billions of dollars\" in an interview released Wednesday https://t.co/fsDotseGLt","date":"Thu Jun 23 01:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Meta has canceled its sponsorship deal with the organization planning the government’s commemoration of the American Revolution’s 250th anniversary, as the project faces accusations of mismanagement and discrimination https://t.co/yBmjJGF54D","date":"Thu Jun 23 00:50:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Tony Siragusa, a former defensive tackle for the Baltimore Ravens and Indianapolis Colts, has died at 55 https://t.co/pQW16sMsUd","date":"Thu Jun 23 00:45:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Hot pants—a subversive style born in the 1970s—are trending again. How they’ve changed in the modern era—plus four confident styles to try. https://t.co/GZ4nm1c3GZ","date":"Thu Jun 23 00:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"An outbreak of meningococcal disease in Florida has prompted health authorities to urge men who have sex with men, as well as some college students, to get vaccinated against the disease https://t.co/cVTz8YkdWS","date":"Thu Jun 23 00:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"On Nantucket, a proposal to allow topless beachgoers has won town approval, an unimaginable move for many of the island’s year-rounders and weekender visitors. It might be time “to go out and buy some stock in Banana Boat [sunscreen],” one supporter said. https://t.co/8t61z86jP3","date":"Thu Jun 23 00:00:21 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Pete Arredondo, the school-district police chief at the center of the broadly criticized response to the elementary school mass shooting in Uvalde, Texas, has been put on administrative leave, the school district said https://t.co/1aRRkzABRj","date":"Wed Jun 22 23:47:34 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A man charged with driving his car into a crowd in New York’s Times Square in 2017, killing one teenager and injuring more than 20 others, was found not responsible because of mental illness https://t.co/VJynIBhKo3","date":"Wed Jun 22 23:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Do Kwon used swagger and a cultlike Twitter following to build a crypto empire that collapsed in a $40 billion crash. Now the South Korean entrepreneur is attempting a comeback. https://t.co/TZu4Tq9pby","date":"Wed Jun 22 23:30:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Some ALS patients in the U.S. are weighing a trip to Canada to obtain Albrioza, a newly approved drug for fatal disease. “Getting more months with my family is worth a trip.” https://t.co/bqVAxvwuEh","date":"Wed Jun 22 23:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: “My university does not have to defend my ideas, but it must defend the freedom to express those ideas,” writes Richard Hammond III, a student at Ohio State University https://t.co/qlcB8OLlAh","date":"Wed Jun 22 23:00:20 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"🎧 Listen: In today’s episode of The Journal podcast, reporter Ted Mann discusses the future of WWE after CEO Vince McMahon stepped aside following allegations he had an affair with a former employee and agreed to pay $3 million to keep it a secret https://t.co/AsfRGKNLLy","date":"Wed Jun 22 22:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"One sign U.S. inflation is becoming a major problem: the rising cost of your haircut, which just saw its largest price hike in 40 years https://t.co/PjCOqhRCzS","date":"Wed Jun 22 22:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Russian businesses are imitating and trying to swipe iconic trademarks of companies that left after the invasion of Ukraine https://t.co/ldTFjeeQGd","date":"Wed Jun 22 22:20:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The FDA is investigating a report that another child has died after consuming Abbott’s baby formula https://t.co/1u2b2iZqIe","date":"Wed Jun 22 22:10:33 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Doctors can’t fully explain the death of the first recipient of a genetically modified pig heart, but they offered several theories in a new study—and said clinical trials of pig-to-human organ transplantation should begin despite the continuing mystery https://t.co/ASVAAfIhSn","date":"Wed Jun 22 22:00:26 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A Texas lawmaker sued the state’s Department of Public Safety, claiming the agency was illegally withholding records related to the shooting in Uvalde https://t.co/nA12bMuXJC","date":"Wed Jun 22 21:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Businesses in different industries are rescinding job offers they made just a few months or weeks ago, in a sign the tightest labor market in decades may be showing cracks. “I just couldn’t believe what I was hearing.” https://t.co/W4ko62TdRR","date":"Wed Jun 22 21:35:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The California man arrested outside Supreme Court Justice Brett Kavanaugh’s home earlier this month has pleaded not guilty to an attempted assassination charge https://t.co/f2g0Ia14Ea","date":"Wed Jun 22 21:25:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Saudi Crown Prince Mohammed bin Salman visited Turkey for the first time since the 2018 killing of journalist Jamal Khashoggi https://t.co/8w1sgRKJft","date":"Wed Jun 22 21:15:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Traders have found the latest meme stock in the makeup aisle. Revlon shares surged in Wednesday afternoon trading, following the cosmetic maker's mid-June bankruptcy filing. https://t.co/GXmFZ6mUxx","date":"Wed Jun 22 21:00:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Georgia’s Supreme Court overturned the murder conviction of a father whose 22-month-old son died after he left him in a hot car eight years ago https://t.co/YI41I1EGne","date":"Wed Jun 22 20:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Betsy DeVos is on a mission to rescue teachers unions’ “hostages.” In an interview, the former education secretary says she thinks the pandemic was an inflection point, writes @jasonrileywsj\nhttps://t.co/qmfmE59LT3","date":"Wed Jun 22 20:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Rolls-Royce is offering U.K. staff a one-time payment of £2,000, equivalent to about $2,450, hoping the bonus will help ease pressure from employees over rising inflation while keeping a lid on the company's costs https://t.co/NNxJ0xb4PN","date":"Wed Jun 22 20:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Wall Street’s current estimates for Apple aren’t baking in a global recession, explains @djtgallagher #WSJWhatsNow https://t.co/65wjiD5mgg https://t.co/pJS8NCzrHE","date":"Wed Jun 22 20:10:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Ohio State University has successfully trademarked the word “THE,” in a victory for the college and its branding that is sure to produce eye rolls from Michigan fans and other rivals https://t.co/fmgzeESeGe","date":"Wed Jun 22 19:59:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Daily Harvest, a plant-based meal-delivery service, recalled its lentil and leek crumbles after dozens of customers reported getting sick, with some saying on social media that doctors were puzzled by symptoms including liver damage, stomach pain and fever https://t.co/jOTYml40In","date":"Wed Jun 22 19:50:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Moderna said it would manufacture vaccines in the U.K. as part of a deal with the British government aimed at ensuring speedy access to mRNA vaccines https://t.co/2aqzNLod97","date":"Wed Jun 22 19:42:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Andrew Gillum, the Democratic nominee for Florida governor in 2018, was indicted by a federal grand jury and arrested by the FBI, according to court documents https://t.co/MWMF2w2srn","date":"Wed Jun 22 19:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Divisions over military aid for Ukraine have triggered a split in Italy’s biggest parliamentary party, reflecting ambivalence in the country about how deeply to get involved in Kyiv’s resistance to Russian forces https://t.co/gMvyLQXnbv","date":"Wed Jun 22 19:20:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. regulators are moving to slash the fees that banks charge customers for late credit-card payments, potentially jeopardizing billions of dollars in industry earnings https://t.co/eoTmXqpNBG","date":"Wed Jun 22 19:10:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Americans could wait longer to start emptying retirement accounts and face fewer restrictions on emergency withdrawals under a bill advanced unanimously by a Senate committee https://t.co/6kNvpLGoPs","date":"Wed Jun 22 19:00:21 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Polio has been detected in London’s wastewater system, U.K. health authorities said, putting clinics on high alert for an infectious disease that hasn’t been recorded in Britain for nearly four decades https://t.co/OseaNcUEhr","date":"Wed Jun 22 18:50:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"NFL commissioner Roger Goodell on Wednesday defended the league’s handling of workplace misconduct allegations against the Washington Commanders and owner Dan Snyder in a contentious congressional hearing https://t.co/5Yfw1hwr4f","date":"Wed Jun 22 18:40:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Michigan’s hopes are rising and Iowa’s are dimming as Democrats decide which states will go first on the 2024 nomination calendar https://t.co/LikVprIZjl","date":"Wed Jun 22 18:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"NBCUniversal and Google have emerged as top contenders to partner with Netflix and help the streaming giant create an advertising-supported tier https://t.co/FoggJCr1V8","date":"Wed Jun 22 18:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The White House endorses a House bill that would require the Federal Reserve to include racial equity in making monetary policy decisions. Such racial favoritism almost certainly violates the Constitution.\nhttps://t.co/IN02OGGjSy","date":"Wed Jun 22 18:05:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Jaylon Ferguson, a linebacker for the Baltimore Ravens, has died at age 26 https://t.co/HGoykA5Mua","date":"Wed Jun 22 17:55:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Many cryptocurrency brands are putting the brakes on their marketing spending, a shift that has left ad sellers and agencies questioning whether crypto is going to be the cash cow they had anticipated https://t.co/MCrERifaGj","date":"Wed Jun 22 17:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Archaeologists say they have discovered an ancient mosque more than 1,200 years old in the Israeli desert, providing details of early Islamic history in the region https://t.co/ACMhPBQ93e","date":"Wed Jun 22 17:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"An environmental group filed a lawsuit that seeks to stop a large offshore gas project off Australia’s coast, arguing that it would further damage the Great Barrier Reef by leading to the release of more greenhouse gases into the atmosphere https://t.co/S0GrxBk5ur","date":"Wed Jun 22 17:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The IRS is trying to clear its tax-return-processing backlog by the end of the year. That will take an extraordinary amount of work, a new report says. https://t.co/flvG9MrB7f","date":"Wed Jun 22 16:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"On Nantucket, a proposal to allow topless beachgoers has won town approval, an unimaginable move for many of the island’s year-rounders and weekender visitors. It might be time “to go out and buy some stock in Banana Boat [sunscreen],” one supporter said. https://t.co/3ZcXQyyzY7","date":"Wed Jun 22 16:30:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: U.S. gas prices have hit a record high and are showing no signs of going down. Here's why. https://t.co/EIvLpn8OfT","date":"Wed Jun 22 16:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"How do you know if your kid’s videogame habit is helpful or if it’s too much time on the console? @juliejargon looks at the research #WSJWhatsNow https://t.co/43vQ9uAyKW https://t.co/tTICa3S4Z0","date":"Wed Jun 22 16:00:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Fed Chairman Jerome Powell said \"it's certainly a possibility\" that interest rates will rise to levels that cause a recession https://t.co/8gQrdoydmz","date":"Wed Jun 22 15:56:42 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Moderna said its tweaked Covid-19 vaccine, which targets both the original virus strain and Omicron, produced a strong immune response against subvariants BA.4 and BA.5 in a study https://t.co/uqm3txp7dz","date":"Wed Jun 22 15:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Apprenticeships, not college, can help reduce unemployment. A flexible, industry-driven alternative for workforce education has a proven record of success, write @paulwinfree and Rachel Greszler\nhttps://t.co/1QflpyfaH9","date":"Wed Jun 22 15:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Singapore is capital-intensive, it’s skills-intensive, it’s not labor-intensive.” How the city-state reversed its manufacturing downturn by courting highly automated factories. https://t.co/bVOTDKLkMt","date":"Wed Jun 22 15:15:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Twitter and Shopify said they are teaming up to make it easier for people to buy items that Shopify merchants post on Twitter https://t.co/Dmi03tAciz","date":"Wed Jun 22 15:00:20 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Shipping prices between the U.S. and China have cooled in recent months as some U.S. importers cut orders amid a backlog of inventory #WSJWhatsNow https://t.co/V4TW6A5r5y https://t.co/IBOwPIi2xe","date":"Wed Jun 22 14:53:25 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The small discounts offered by gasoline-tax holidays tend to get buried amid larger shifts in the underlying price of the fuel https://t.co/TCK7srHoXE","date":"Wed Jun 22 14:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"What the rising cost of your haircut—which just saw its largest annual price hike in 40 years—says about the underlying trends fueling inflation in the U.S. https://t.co/GjGVB2i242","date":"Wed Jun 22 14:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A little-known Buffett family foundation that supports abortion rights is making plans for a possible windfall after the billionaire dies.  https://t.co/W0YQW0wQu5","date":"Wed Jun 22 14:15:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Bare feet on the seats or bulkhead. Watching movies without headphones. And worse. Those annoying in-flight behaviors are back and multiplying as planes fill up https://t.co/OIlg2xACQ1","date":"Wed Jun 22 14:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Juul e-cigarettes could be ordered off the U.S. market by the FDA as soon as today, people familiar say https://t.co/Wr7d1p8Igp","date":"Wed Jun 22 13:32:28 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The U.S. economy faces elevated risks of a recession over the next one to two years due to rising imbalances in markets for goods and services, including labor, according to a new research paper from a Federal Reserve economist https://t.co/gXrECcSzi9","date":"Wed Jun 22 13:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"International banks have provided services to Iranian companies, documents show, as part of Tehran’s efforts to steer capital toward its embattled economy and defy U.S. pressure to restrict its nuclear program https://t.co/1Pt3bGSG1q","date":"Wed Jun 22 13:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Jerry Jones’s natural-gas gambit: The Dallas Cowboys owner bought control of Comstock Resources at the depths of the gas bust, and now his stake is worth more than twice what he paid https://t.co/u9gH0vk173","date":"Wed Jun 22 13:00:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"As nearly 20 million children 6 months to under 5 years of age are newly eligible for the Covid-19 vaccine, some parents are finding it hard to find appointments. “We want him to be as protected as he can as soon as possible.” said one parent. https://t.co/CBfbXNGJBo","date":"Wed Jun 22 12:45:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Businesses in different industries are rescinding job offers they made just a few months or weeks ago, in a sign the tightest labor market in decades may be showing cracks. https://t.co/yTERiBQmK5","date":"Wed Jun 22 12:30:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A top French court ruled against allowing head-to-foot swimsuits at public pools in Grenoble, the latest move amid a debate over how to balance France’s values of liberalism and secularism https://t.co/1H6mAivJTd","date":"Wed Jun 22 12:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"American drivers are starting to buy less gasoline as they feel the economic burden of record prices that continue to hover near $5 a gallon https://t.co/CHj8tZcN0c","date":"Wed Jun 22 12:00:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A major Russian oil and gas refinery close to the Ukrainian border was set ablaze after a drone allegedly controlled by Kyiv’s forces crashed into it     https://t.co/RfFqCuVOGz","date":"Wed Jun 22 11:50:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Ford plans to build a next generation of electric vehicles at its factory in Valencia, Spain, leaving the future of its factory in Saarlouis, Germany, uncertain https://t.co/RECOx8W7Ap","date":"Wed Jun 22 11:40:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President Biden is set to announce a federal gas-tax suspension on Wednesday, as American drivers start buying less gasoline with prices continuing to hover near $5 a gallon #WSJWhatsNow https://t.co/ax46x0uudK https://t.co/2uyeEOkHlx","date":"Wed Jun 22 11:37:42 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: Cash has been pouring into residential property on the assumption that an unprecedented run up in rents will continue https://t.co/yIeuWDYTiq","date":"Wed Jun 22 11:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Tens of thousands of Ukrainians are staying in British homes, but as the war drags on the reality for guests and hosts is setting in https://t.co/ymqu1188vw","date":"Wed Jun 22 11:20:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: Uber and Lyft want to share the wealth, cheaply  https://t.co/TVGS8KRM5s","date":"Wed Jun 22 11:10:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Streetwise: Are bitcoin and other crypto tokens crashing because of the excesses that accompany advances in finance, or do they have fundamental flaws? Asks @jmackin2 https://t.co/MhSa2VCDYn","date":"Wed Jun 22 11:00:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Freight rates from China to the U.S. West Coast are down by a third since the start of the year as some importers cut orders https://t.co/5IP2HbURME","date":"Wed Jun 22 10:50:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.K. recorded the sharpest rise in prices among large, rich countries in May, with little respite in sight for hard-pressed workers https://t.co/fXcltJqPIz","date":"Wed Jun 22 10:40:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The worst bond rout in decades has meant double-digit losses for leveraged municipal bond funds https://t.co/tHj5eFyUzw","date":"Wed Jun 22 10:30:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Investment in energy supplies, including clean energy, should jump this year, energy watchdog says. But it won’t be enough to tame prices. https://t.co/myfwvotx8I","date":"Wed Jun 22 10:20:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Caution over weapons sales illustrates how Turkey has catered to both sides in the Russia-Ukraine war  https://t.co/HyHCf3iLla","date":"Wed Jun 22 10:10:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President Biden is planning to call for a three-month suspension of the federal gasoline and diesel taxes, according to senior administration officials https://t.co/ZcgzTy58YV","date":"Wed Jun 22 10:00:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"At least 920 people were killed by an earthquake in eastern Afghanistan. Officials said they expect that number to rise as rescue efforts get under way. https://t.co/zwdTvm6uXg","date":"Wed Jun 22 09:54:38 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Blackstone’s bet on acquiring Australian casino operator Crown Resorts yielded an early dividend for the American private equity giant after a local regulator granted permission for Crown to open its new casino in Sydney.  https://t.co/KyeHhxsqvf","date":"Wed Jun 22 09:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcTXY https://t.co/W08rwIg0S2","date":"Wed Jun 22 09:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Saudi crown prince is set to visit Turkey for the first time since the 2018 killing of journalist Jamal Khashoggi https://t.co/DsSpJgPTOd","date":"Wed Jun 22 09:25:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. stock futures fell sharply, oil prices dropped and bond yields ticked lower after major indexes rallied to start the trading week https://t.co/G8VBEm3bOT","date":"Wed Jun 22 09:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"When it comes to exercise, more isn't always better. Here's what scientists are learning. https://t.co/TtbZK9UdDh","date":"Wed Jun 22 09:00:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: Chinese space authorities said parts of the Long March-2F re-entered Earth’s atmosphere on Tuesday https://t.co/N7W0aoFhPU","date":"Wed Jun 22 08:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Meeting with your boss to talk about a big raise? Or getting together with the whole department to kick around ideas? There is a simple strategy that can make things a lot more productive: Keep quiet. https://t.co/IcQB9ZKKwb","date":"Wed Jun 22 08:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In Washington's San Juan Islands, a 15-acre property that includes 1,000 feet of frontage on the Haro Strait and whale-watching decks is asking $14.5 million https://t.co/JjRtG1ON3b","date":"Wed Jun 22 08:00:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Footwear designer Manolo Blahnik says he sometimes gets his best ideas in his sleep: “I dream of something and I have a little pencil and paper next to my head.” https://t.co/xIbydOTxYR","date":"Wed Jun 22 07:30:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Two top executives at the parent company of Pornhub have resigned, amid scrutiny of allegations that nonconsensual sexually explicit videos were hosted on the site https://t.co/cx29oGQTAj","date":"Wed Jun 22 07:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Cash will always trump everything else.” https://t.co/sLJNckB1IU","date":"Wed Jun 22 06:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Parental advisory required. Don’t play the license-plate game in Maine.” https://t.co/5WRc72Px7W","date":"Wed Jun 22 06:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"One of the most important skills for anyone in their career is how to negotiate. https://t.co/qtRgHE8gzr","date":"Wed Jun 22 05:30:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Future American officials should carefully study the evolution of the Biden administration’s approach to Saudi Arabia. It’s a textbook example of the damage that good intentions can do when linked with weak analysis, writes @wrmead. https://t.co/gQE8xSZzRi","date":"Wed Jun 22 05:15:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The crypto-reckoning has been swift and brutal, but true believers are hanging on. “My thesis is the same as in 2012.” https://t.co/idjUCbyfrI","date":"Wed Jun 22 05:00:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/pwO41kscIW","date":"Wed Jun 22 04:45:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Kellogg plans to break up its business into three companies, seeking to jump-start its larger, faster-growing snacks business while helping its namesake cereal brands regain their footing on supermarket shelves https://t.co/TfODtkJCCs","date":"Wed Jun 22 04:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Home prices hit a record median of $407,600 in May. Sales slipped as mortgage rates soared. https://t.co/C9UN1wRjaD","date":"Wed Jun 22 04:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“There is nowhere I feel safe,” Georgia 2020 election worker Ruby Freeman said in video testimony during Tuesday's hearing. “Do you know how it feels to have the president of the United States target you? ”https://t.co/BnMfjwzeWY","date":"Wed Jun 22 04:04:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Hailey Bieber, who just last week launched a skincare line under the name Rhode, is being sued for trademark infringement by a fashion brand of the same name https://t.co/fDwaz3Mc5z","date":"Wed Jun 22 04:00:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Warren Buffett long ago promised most of his fortune to the Gates Foundation. Now another foundation is bracing for a windfall. https://t.co/PK3SicW9Dz","date":"Wed Jun 22 03:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Biden administration has unveiled a plan to mandate the removal of nearly all nicotine from cigarettes, a plan that would upend the $95 billion U.S. cigarette industry and, health officials say, prompt millions of people to quit smoking https://t.co/9qz81BMGM0","date":"Wed Jun 22 03:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Maybe the headlines are going to be ‘City of Uvalde sues DPS,’ ‘City sues district attorney for information,’\" Uvalde's mayor said during a hearing before a Texas Senate committee Tuesday. “Because we damn sure aren’t getting it any other way.” https://t.co/8Efe7eFZ0h","date":"Wed Jun 22 03:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Government prosecutors in the criminal-fraud trial of Theranos's former second-in-command, Ramesh “Sunny” Balwani, made their final pitch to the jury in closing arguments Tuesday https://t.co/YQk4uaTDHP","date":"Wed Jun 22 03:00:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Republican voters in Alabama have selected Trump-backed Katie Britt as their nominee for Senate in a runoff primary election https://t.co/fJRBLypeTI","date":"Wed Jun 22 02:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Kellogg's finance chief is tackling the task of splitting his company’s balance sheet into three pieces, following the food maker’s decision to spin off its cereal and plant-based food businesses https://t.co/N3V5XmriLm","date":"Wed Jun 22 02:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: A bee is a fish, a puddle is a river, protests cure pandemics, war is peace, freedom is slavery, ignorance is strength. Beware of manipulative narratives, writes @andykessler. https://t.co/iyhugy3vRh","date":"Wed Jun 22 02:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A 25-look collection dubbed HA HA HA, codesigned by Harry Styles and Gucci creative director Alessandro Michele, will hit Gucci stores in October https://t.co/tqFTzyveMr","date":"Wed Jun 22 02:00:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In Washington's San Juan Islands, a 15-acre property that includes 1,000 feet of frontage on the Haro Strait and whale-watching decks is asking $14.5 million https://t.co/3fdiOMYVw4","date":"Wed Jun 22 01:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The tight labor market could aid the Fed in combating inflation without significantly increasing the unemployment rate, Treasury Secretary Janet Yellen said Tuesday https://t.co/9OYgX7BePb","date":"Wed Jun 22 01:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Gunmen killed two Jesuit priests inside their church in an indigenous region of northern Mexico fought over by drug cartels, authorities and the Roman Catholic order said Tuesday https://t.co/vzNw4gAvlS","date":"Wed Jun 22 01:21:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“President Biden has made clear he is committed to doing everything he can to reduce gas prices for the American people, and he will have more to say on this tomorrow,” a White House official said Tuesday evening https://t.co/MUpQ4d8mgu","date":"Wed Jun 22 01:15:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Gunmen killed two Jesuit priests inside their church in an indigenous region of northern Mexico fought over by drug cartels, authorities and the Roman Catholic order said Tuesday https://t.co/Pp2fBm0y94","date":"Wed Jun 22 01:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Watch: A recent wave of layoffs and hiring freezes has hit tech – and analysts say tech stocks will continue to suffer. Here’s why the buzzy industry is faring worse than some other sectors. https://t.co/auVFLT5Bem","date":"Wed Jun 22 01:00:17 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"American businesses in China say they fear a U.S. law blocking most imports from China’s Xinjiang region that went into effect Tuesday might interrupt shipments and raise compliance costs https://t.co/WOUNzCGlXw","date":"Wed Jun 22 00:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Some flood-prone residents of Miami Beach suing the city as its efforts to confront rising sea levels by lifting roads divert water into their homes. “There is a pool inside the house right now.” https://t.co/KwhaLd8L3S","date":"Wed Jun 22 00:30:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The job market is still really hot. But concerns about the economy have many people wondering if their jobs are secure enough to survive. https://t.co/GuHhl4ahQo","date":"Wed Jun 22 00:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Biden administration announced a plan to eliminate nearly all nicotine from cigarettes. Here's the science behind the decision https://t.co/wCFXCJJslZ","date":"Wed Jun 22 00:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"President Biden is planning to call for a temporary suspension of the federal gasoline tax as soon as Wednesday, according to people familiar with the matter https://t.co/TqHTyrbUf5","date":"Tue Jun 21 23:44:45 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Jurors at a civil trial Tuesday found that Bill Cosby sexually abused a 16-year-old girl at the Playboy Mansion in 1975 https://t.co/dcUVlcQPdr","date":"Tue Jun 21 23:40:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: If Beijing develops durable advantages across the semiconductor supply chain, it would generate breakthroughs in foundational technologies that the U.S. cannot match, write @GrahamTAllison and @ericschmidt https://t.co/6QfNKvaj9k","date":"Tue Jun 21 23:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Two top executives at the parent company of Pornhub have resigned, amid scrutiny of allegations that nonconsensual sexually explicit videos were hosted on the site https://t.co/BIwggi9CKj","date":"Tue Jun 21 23:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Who needs customer service? Some e-commerce companies have found a way to outsource minor disputes: Let other users be the judge https://t.co/ngtYYY3vTW","date":"Tue Jun 21 23:00:25 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Senators have released a bill to curb gun violence, focused on removing firearms from people deemed dangerous, as well as school safety and mental-health services:  “We’ve reached agreement.\" https://t.co/AJ2C49jxr3","date":"Tue Jun 21 22:45:35 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court agreed to decide whether New Jersey can pull out of a bistate crime-fighting agency it has operated with New York for nearly 70 years https://t.co/EshNc5A9j4","date":"Tue Jun 21 22:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A battle has broken out in bond markets, pitting investors’ fears of inflation against their concerns about slowing growth https://t.co/XVGjuwSpfZ","date":"Tue Jun 21 22:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A U.S. Forest Service review detailed errors of the prescribed burn that led to the largest wildfire in New Mexico state history https://t.co/ub3RnvBclq","date":"Tue Jun 21 22:00:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A 3,600-acre ranch on Maui's eastern coast is hitting the market for $75 million, making it one of the largest pieces of land for sale in Hawaii https://t.co/V0TW5m01G6","date":"Tue Jun 21 21:45:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Government prosecutors in the criminal-fraud trial of Theranos's former second-in-command, Ramesh “Sunny” Balwani, made their final pitch to the jury in closing arguments Tuesday, as the Silicon Valley case moves closer to a resolution https://t.co/3Jozymqwzv","date":"Tue Jun 21 21:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A bipartisan group of senators was set to release on Tuesday its much-anticipated legislation to curb gun violence, in what could represent the first major federal change to gun laws in decades https://t.co/vqBz6Orw90","date":"Tue Jun 21 21:15:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"China offered to serve as a peace mediator Horn of Africa conflicts, the latest sign Beijing is expanding trade dominance into matters of war and peace https://t.co/jFSebQUBgV","date":"Tue Jun 21 21:00:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: The shadowy group Jane’s Revenge issues a call to \"riot\" against the Supreme Court if it overturns Roe v. Wade. The Justices and the Court as a democratic institution have to be protected. https://t.co/isGHV3l6ha","date":"Tue Jun 21 20:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Hailey Bieber, who just last week launched a skincare line under the name Rhode, is being sued for trademark infringement by a fashion brand of the same name https://t.co/0xdo2MDXIk","date":"Tue Jun 21 20:35:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Biden administration unveiled a plan to mandate the removal of nearly all nicotine from cigarettes, a plan that would upend the $95 billion U.S. cigarette industry and, health officials say, prompt millions of people to quit smoking https://t.co/j95kQwFE9X","date":"Tue Jun 21 20:29:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"State legislators and election officials recalled how former President Donald Trump pressured them to try to alter the result of the 2020 presidential election, in testimony at Tuesday’s hearing of the House committee investigating the Jan. 6 Capitol riot https://t.co/xUEep8cmEX","date":"Tue Jun 21 20:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The S&amp;P 500 surged almost 2.5%, rebounding after its worst week in more than two years. The Dow jumped more than 600 points and bitcoin gained. https://t.co/oGmGhnLVjm","date":"Tue Jun 21 20:11:42 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Dartmouth College is eliminating student loans from its financial-aid packages and will replace them with expanded scholarship grants, a move the school says will save middle-income students an average of $22,000 in debt over four years https://t.co/jbLURFMItU","date":"Tue Jun 21 20:00:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Solar and wind face logistical challenges that could impact renewable energy’s future, explains @JinjLee #WSJWhatsNow https://t.co/K24neCD43p https://t.co/crmYrsrWKY","date":"Tue Jun 21 19:45:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Bitcoin and other cryptocurrencies bounced back Tuesday, after a tumultuous holiday weekend marked the lowest prices in more than a year https://t.co/yg7r5cHpHv","date":"Tue Jun 21 19:37:29 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Meta agreed to adopt new online advertising practices to settle an investigation by federal officials, who said its ads discriminated against users by race, gender and other factors https://t.co/NOCn3Gzi10","date":"Tue Jun 21 19:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Bill Gates and Warren Buffett built two of the world’s biggest fortunes and have promised to give their riches away. Here's a look at their friendship over the decades. https://t.co/XpIHz02DpC","date":"Tue Jun 21 19:05:26 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Warren Buffett long ago promised most of his fortune to the Gates Foundation. Now a little-known Buffett family foundation that supports abortion rights is making plans for a possible windfall after the billionaire dies. https://t.co/YTO4lYjvXX","date":"Tue Jun 21 19:03:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Gunmen killed two Jesuit priests inside their church in a lawless indigenous region in northern Mexico fought over by drug cartels, authorities and the Roman Catholic order said https://t.co/I6HXe1gyZL","date":"Tue Jun 21 18:45:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: Rather than block other countries’ path to development, wealthy nations should do the sensible thing and invest meaningfully in the innovation needed to make green energy more efficient and cheaper than fossil fuels, writes @BjornLomborg https://t.co/pxUkwBMXY9","date":"Tue Jun 21 18:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Amazon has named longtime executive Doug Herrington as its new boss of world-wide stores following the departure of Dave Clark, who led its warehousing and e-commerce operations and is leaving the company to join a logistics startup https://t.co/NVrFrbISY8","date":"Tue Jun 21 18:15:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Broadway theaters are dropping their mask mandates on July 1, letting audience members opt to go maskless for the first time since theaters fully reopened last September https://t.co/K9fM7lv1EE","date":"Tue Jun 21 18:00:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The collapse of Israel’s ruling coalition gives Benjamin Netanyahu, the former prime minister of Israel, his fifth and what could be his last chance in three years to form a stable government\nhttps://t.co/33iFSrm0h2","date":"Tue Jun 21 17:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Companies face new increases in logistics costs this year as they try to reset their supply chains and rebuild inventories amid continuing disruptions and rising inflation, freight-sector experts say https://t.co/Fq1y0zu2Pd","date":"Tue Jun 21 17:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"NFL quarterback Deshaun Watson has settled 20 of the 24 of the sexual misconduct lawsuits filed against him, the plaintiffs’ lawyer said, a move that begins to clear his legal future while his playing future remains uncertain https://t.co/Zpxqp0xCEE","date":"Tue Jun 21 17:13:26 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Talks on a bipartisan gun-control bill were delayed as people familiar with the negotiations said senators had come to a compromise on the language but disagreed over a provision that would ban the use of federal spending on abortion https://t.co/0AV0Up5FTE","date":"Tue Jun 21 17:00:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Frýdek-Místek natives Pavel Kubina and Ondrej Palat won Stanley Cups with the Lightning two decades apart—and forever endeared their NHL team to residents of the area around the city of 55,000. https://t.co/KOkyawbabQ","date":"Tue Jun 21 16:45:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Donald Trump’s efforts to pressure state legislators and election officials to alter 2020 election results will be in focus at Tuesday’s hearing of the House select committee investigating the Capitol attack. Here's what happened so far and what’s next. https://t.co/Rukdayc5Xi","date":"Tue Jun 21 16:30:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The classroom door in the Uvalde shooting wasn't locked and officers at the scene had nothing barring them from entering, Texas' chief of public safety said https://t.co/Q5qRevuIi9","date":"Tue Jun 21 16:24:46 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Who needs customer service? Some e-commerce companies have found a way to outsource minor disputes: Let other users be the judge https://t.co/tVajNAgeon","date":"Tue Jun 21 16:15:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"If your employer asks you to use your own computer or phone for work, here’s what you need to know, explains @nicnguyen #WSJWhatsNow https://t.co/W5BDpdPugc https://t.co/Sd6oVGeuYq","date":"Tue Jun 21 16:00:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Drugmakers have found powerful new tools to help overweight people shed pounds by tapping into treatments for another disease: diabetes https://t.co/qeEo2TFMPA","date":"Tue Jun 21 15:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. Attorney General Merrick Garland is making an unannounced visit to meet with Ukraine’s prosecutor general to discuss efforts to help the country investigate war crimes https://t.co/VlrnhDHhXg","date":"Tue Jun 21 15:30:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Uber is bringing back shared passenger rides in several U.S cities, including New York City and San Francisco. With UberX Share, riders can receive an upfront discount and get up to 20% off the total fare if matched with another rider. https://t.co/mPxd2A9ntx","date":"Tue Jun 21 15:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Big mining companies are giving priority to investor payouts instead of funding for new projects, threatening to slow down the transition away from fossil fuels #WSJWhatsNow https://t.co/TdYFHozzSv https://t.co/adZ9ViOrwr","date":"Tue Jun 21 15:20:00 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"From @WSJopinion: It’s time to get America back on track and leave the disastrous social and economic policies of the radical leftists in the past where they belong. If we’re going to rescue America, it’s time to get back to work, writes @SenRickScott. https://t.co/04e5TjiAp2","date":"Tue Jun 21 15:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Warren Buffett long ago promised most of his fortune to the Gates Foundation. Now another foundation is bracing for a windfall. https://t.co/sR7Al6mE6S","date":"Tue Jun 21 15:09:29 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court ruled religious schools can’t be excluded from a Maine program that pays private-school tuition for students in areas lacking public schools https://t.co/6aWEQZcB12","date":"Tue Jun 21 14:46:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Darius Lee, a 21-year-old star player for the Houston Baptist University men’s basketball team, was killed in a shooting in Harlem early Monday. Eight other people were shot, police said. https://t.co/bSjy8NTTwK","date":"Tue Jun 21 14:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Home prices hit a record median of $407,600 in May. Sales slipped as mortgage rates soared. https://t.co/XKff4RWHjU","date":"Tue Jun 21 14:23:31 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The job market is still really hot. But concerns about the economy have many people wondering if their jobs are secure enough to survive. https://t.co/jSj3rXNkUt","date":"Tue Jun 21 14:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Delays, cancellations, long lines and lost baggage are plaguing air travel world-wide, as airlines and airports struggle with soaring summer demand and staff shortfalls https://t.co/GSqr8cOeKv","date":"Tue Jun 21 14:00:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court declined to hear a bid by Bayer to end thousands of lawsuits alleging its weedkiller Roundup causes cancer, potentially costing it billions of dollars in legal settlements https://t.co/yd2UJ5Hfzh","date":"Tue Jun 21 13:48:22 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Dow rose more than 400 points in early trading, as stocks regained some ground after big losses last week https://t.co/l5sK7D0yC8","date":"Tue Jun 21 13:34:36 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Enjoy today’s extra sunlight: Seasons will shift and the Northern Hemisphere will experience its longest day of the year on Tuesday’s summer solstice https://t.co/uxlufSxjVi","date":"Tue Jun 21 13:30:13 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Supreme Court has 17 cases remaining from this term on which it still has to issue opinions, including decisions on abortion and gun rights. Here are eight to watch. https://t.co/ODwWN9zGoD","date":"Tue Jun 21 13:23:31 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A little-known Las Vegas company won a huge federal bid to provide broadband to rural U.S. communities, but more than 18 months later hasn’t delivered. What went wrong?  https://t.co/0PkeUT2Iok","date":"Tue Jun 21 13:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Elon Musk clarified that his plans to cut 10% of Tesla’s salaried workforce would happen over roughly the next three months. Speaking at Bloomberg’s Qatar Economic Forum, he said “we grew very fast on the salaried side.” https://t.co/Ck7PVtl6l5","date":"Tue Jun 21 13:00:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Could eliminating nearly all nicotine in cigarettes help people quit? The science behind the Biden administration’s plan https://t.co/CaGoFYF0ZY","date":"Tue Jun 21 12:45:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Two of Asia’s financial hubs aimed to reinvent the SPAC. So far, it is proving slow going.  https://t.co/to22Ih4wvZ","date":"Tue Jun 21 12:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Google's commitments are part of a changing approach in a global debate over how tech companies should pay for news content  https://t.co/VndVLRdozE","date":"Tue Jun 21 12:15:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Foreign investors selling stocks and bonds are hoarding the U.S. dollar as market volatility picks up https://t.co/EhP16Zw1ma","date":"Tue Jun 21 12:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Hundreds of companies were quick to promise an exit from Russia, but as one CEO says, finding a way out can be ‘so bloody complex’ https://t.co/csIKHThvQN","date":"Tue Jun 21 11:50:01 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"South Korea joined an elite group of countries by placing a large satellite into orbit, harnessing technology that could be used to monitor and track North Korea’s military activity https://t.co/lbgPbp9JZE","date":"Tue Jun 21 11:40:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A group of American renewable-energy developers is making a $6 billion offer to solar manufacturers: Build panels in the U.S. and we will buy them  https://t.co/HJusRikTGz","date":"Tue Jun 21 11:30:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Kellogg said it plans to split into three publicly traded companies, prompting a surge in its shares in premarket trading https://t.co/uIYGSHA1ht","date":"Tue Jun 21 11:26:46 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Russia stepped up its major offensive to take a chemical plant that serves as the last Ukrainian stronghold in Severodonetsk     https://t.co/FyvHjExgA4","date":"Tue Jun 21 11:20:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"South Korea joined an elite group of countries by successfully launching a large satellite into orbit, harnessing technology that could be used to monitor and track North Korea’s military activity #WSJWhatsNow https://t.co/sYPKU2laNM https://t.co/xRbDsY9ZZE","date":"Tue Jun 21 11:19:40 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"S&amp;P 500 futures jumped almost 2% in the wake of the index's biggest weekly loss in more than two years, and bitcoin regained some ground https://t.co/qBXiJJuMGn","date":"Tue Jun 21 11:10:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Donald Trump’s efforts to alter results of the 2020 election will be in focus at a hearing of the committee investigating the Jan. 6, 2021, attack on the Capitol  https://t.co/mHKaIuHEkm","date":"Tue Jun 21 11:00:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"David Taylor, former CEO of Procter &amp; Gamble, is joining Clayton Dubilier &amp; Rice, a private-equity firm, as a senior operating adviser https://t.co/z7e7s08ZC8","date":"Tue Jun 21 10:50:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A battle has broken out in bond markets, pitting investors’ fears of inflation against their concerns about slowing growth https://t.co/NNfVi3GsDG","date":"Tue Jun 21 10:40:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Florida homeowners will see another increase in insurance premiums this year, as storm risks and questionable claims drive up reinsurance rates https://t.co/wot2IxNAGN","date":"Tue Jun 21 10:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"\"I feel responsible for what my country is doing,\" said Dmitry Muratov editor-in-chief of the Russian Novaya Gazeta newspaper https://t.co/5dzwarQXhj","date":"Tue Jun 21 10:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Venture Global LNG struck the first binding deals by a U.S. natural-gas exporter to supply natural gas to a German company, as the European nation turns to America to help replace supplies from Russia  https://t.co/YbbGXYQjVA","date":"Tue Jun 21 10:00:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Caution over weapons sales illustrates how Turkey has catered to both sides in the Russia-Ukraine war  https://t.co/mByImmLJhQ","date":"Tue Jun 21 09:50:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"U.S. stock futures climbed, pointing to a strong start for major indexes after the Juneteenth holiday break. https://t.co/oURO3xFvDw","date":"Tue Jun 21 09:43:25 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/xMwbS0q4Ji https://t.co/3vauiCgLzi","date":"Tue Jun 21 09:30:11 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The Ford-GM rivalry is taking on an urgent new dimension as the companies enter the electric age and take on Tesla. “This will make for a great business-school case study someday.” https://t.co/ALXuO1p4lG","date":"Tue Jun 21 09:15:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"R.I.P., Internet Explorer https://t.co/7U8iy1DL9s","date":"Tue Jun 21 09:00:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"In the countryside south of Paris, two stars of the city’s bistro scene have created a quintessential farm-to-table destination https://t.co/CMvu0B4JWT","date":"Tue Jun 21 08:30:12 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Meet Kanye West and Cardi B’s secret shopping weapon: \"Meech\" https://t.co/EnfZ5CJMdb","date":"Tue Jun 21 08:00:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Inflation in Australia is on track to rise to 7% by the end of the year, while in South Korea it could exceed the 4.7% pace recorded during the financial crisis in 2008, the central bank said https://t.co/wW6I3hPbHc","date":"Tue Jun 21 07:45:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"The crypto-reckoning has been swift and brutal, but true believers are hanging on. “My thesis is the same as in 2012.” https://t.co/OGNXqpDBga","date":"Tue Jun 21 07:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“He is still alive, but he won’t survive.” Russian soldiers are combing Europe’s largest nuclear power plant looking for workers loyal to Ukraine. https://t.co/KMPjhfNVGM","date":"Tue Jun 21 07:00:15 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"A surgeon lost his life savings. Others have given up on their dreams. All of them were swept up in crypto mania—and the crash. https://t.co/ephP7kZ2Mm","date":"Tue Jun 21 06:30:06 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Advertisers are increasingly turning to once-obscure streaming platforms with quirky names to reach people who aren’t paying for cable TV or subscribing to streaming services. https://t.co/X5scgYarZj","date":"Tue Jun 21 06:00:16 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Layoffs in the crypto market will provide some relief to companies in need of engineers and other technologists,” said one recruiter, but added they’re “a drop in the bucket.” https://t.co/tyqcvx9SsP","date":"Tue Jun 21 05:30:04 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“For any company that thinks it may have a sanctions problem, our message is unequivocal: Pick up the phone and call us—don’t wait for us to call you.” https://t.co/qvP0SZCRgt","date":"Tue Jun 21 05:00:14 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"One of the most important skills for anyone in their career is how to negotiate. https://t.co/HDdKD7lRUE","date":"Tue Jun 21 04:45:02 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Take an early look at the front page of The Wall Street Journal https://t.co/Bv8NBvgk8N https://t.co/4JJzkhfTcR","date":"Tue Jun 21 04:30:07 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"When child athletes train for hours a day, forgo a normal education and put themselves at regular risk of stress and injury, are they playing? Or working? https://t.co/C7HTDMPIKn","date":"Tue Jun 21 04:15:03 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"When it comes to exercise, more isn't always better. Here's what scientists are learning. https://t.co/lRHMLZohOQ","date":"Tue Jun 21 04:00:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Millions of Americans converted to garlic between the 1970s and the 1990s. From 1975 to 1994, U.S. garlic production more than tripled, from 140 million pounds to 493 million pounds. https://t.co/mipmeQX9Uo","date":"Tue Jun 21 03:45:08 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Heard on the Street: E-cigarettes have the edge over heated tobacco in the U.S, but it may not last https://t.co/dNQlFL1Z6D","date":"Tue Jun 21 03:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Bill Gates said he thinks cryptocurrencies and NFTs are “100%” based on the greater fool theory https://t.co/ZAbwvxmHDg","date":"Tue Jun 21 03:15:05 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Parental advisory required. Don’t play the license-plate game in Maine.” https://t.co/uhdfFnoiXr","date":"Tue Jun 21 03:00:18 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"Meeting with your boss to talk about a big raise? Or getting together with the whole department to kick around ideas? There is a simple strategy that can make things a lot more productive: Keep quiet. https://t.co/W0auAvfJHE","date":"Tue Jun 21 02:45:09 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"“Cash will always trump everything else.” https://t.co/NrUYzDvKK0","date":"Tue Jun 21 02:30:10 +0000 2022","user_id":"3108351"},{"handle":"wsj","text":"What should you do when the bear market comes for you? The answer, says @jasonzweigwsj, depends largely on whether you’re saving or spending. https://t.co/YleeYzKunC","date":"Tue Jun 21 02:15:07 +0000 2022","user_id":"3108351"}]