[{"handle":"asu","text":"An @ASUEngineering team took third place overall and first place in the defense category at the Western Regional Collegiate Cyber Defense Competition. Congratulations! 👏 🔱\n\nhttps://t.co/UvZZFpBbfK","date":"Wed Jun 22 17:01:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Renowned product innovator and innovation expert Luis Angarita has been named as the new head of @ASUDesignSchool's Industrial Design program.","date":"Wed Jun 22 15:00:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Nikki Leon is one of the first students to graduate with a degree from #ASULocal in Los Angeles. \n\nNikki chose @ASUinCA because of its opportunities, generous scholarships and proximity to home. \n\nRead her story: https://t.co/Clpc7JqQm7 https://t.co/XztUxUBabX","date":"Wed Jun 22 02:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"An ASU-led team has observed the fastest nova ever. ✨\n\nThey hope to find answers to not only the nova’s many baffling traits, but to larger questions about our solar system and the universe. https://t.co/KWscJ5wQ9l","date":"Wed Jun 22 00:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUCommunities #ASUGrad Tanner Smith was inspired to change her major after enrolling in a parks and recreation class her freshman year. \n\nNow, the @asupublicsvc alum is looking forward to a career of positive impact on her community. 🎓https://t.co/s5dZJxx4He https://t.co/nE13ajBegR","date":"Tue Jun 21 22:01:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Summer travel season is upon us and more demand for fuel is likely. How will that impact prices in the near future? \n\n@Thunderbird Professor Andrew Inkpen explains what to expect in the next few months.⛽️  https://t.co/zGTXnoLWLv","date":"Tue Jun 21 20:01:30 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"To say #ASUgrad student veteran Maria Adney is unique and talented would be an understatement.\n\nAdney served in the @usairforce and @USCG and now is ready to embark in a new phase of her life: working as a speech therapist for @higleydistrict. 🎓 https://t.co/n6dXyjIOMY","date":"Tue Jun 21 18:02:18 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Be sure to follow @asu_usp for more tips on how to introduce sustainability into your life this summer. 🌱\n\nForks Up, sunscreen on — have a safe summer, Sun Devils! #SummerOfSustainability (3/3) https://t.co/FTO3ciYTFy","date":"Tue Jun 21 16:02:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asu_usp recommends using mineral based sunscreens for sun protection. Mineral based sunscreens protect coral reefs and are 100% biodegradable. ☀️\n\n (2/3) https://t.co/k9k2cB20Q7","date":"Tue Jun 21 16:02:10 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's the first official day of summer, and whether you're spending your summer at the beach, at home or even catching some rays on Hayden lawn, make sure that you protect your skin while also protecting the environment. 🏖\n\n (1/3) https://t.co/vtNtJRh6oM","date":"Tue Jun 21 16:02:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The ASU Bee Lab Annex, located near the ASU Polytechnic campus, is one of the largest bee laboratories in the US, where @ASU researchers are studying bee immunization, social behavior and evolution, and more. \n\nStudents can even take hobby beekeeping courses there! 🐝","date":"Tue Jun 21 01:30:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"After 39 years with @TheSunDevils, Senior Associate Athletic Director Mark Brand has announced his retirement. 🔱  https://t.co/w4G4vAGCPP","date":"Mon Jun 20 23:00:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUCollegeOfLaw professor Joshua Sellers has been awarded an @AmericanAcademy #BerlinPrize fellowship to expand his research into election law. https://t.co/SBQJY2UAHt","date":"Mon Jun 20 21:00:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Read more about @ASUinCA:  (5/5) https://t.co/1C34b9cSgb","date":"Mon Jun 20 19:06:52 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“With the support and resources here, Maria has become a confident young leader. The program has been nothing short of transformative for her,” says Maria Visoso’s success coach. \n\nVisoso is a first-generation college student at ASU Local. https://t.co/1C34b9cSgb \n\n (4/5) https://t.co/FN1h4QyTo7","date":"Mon Jun 20 19:06:52 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“The coaches and staff and director of recruitment — my boss — are hardworking and sweet people. I really like being a work-study student and learning from them,” says Kara Smith, a mass communication and media studies major.  https://t.co/1C34b9cSgb \n\n (3/5) https://t.co/yvyNNvJGww","date":"Mon Jun 20 19:06:51 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“They reached out to me. They broke down the financial plan. They followed me every step of the way. I feel like I belong here,” says Victor Sanchez.\n\nASU Local is helping him pursue his dream of building affordable housing in Koreatown. https://t.co/1C34b9cSgb \n\n (2/5) https://t.co/yRhrDgee1o","date":"Mon Jun 20 19:06:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"🧵 Thread: Sun Devils are earning their degrees in the heart of @downtown_la with ASU Local, located about 10 minutes from Dodger Stadium. Recently, some of these students shared their experiences as ASU Local students in Los Angeles. #LearnToThrive https://t.co/1C34b9cSgb  (1/5) https://t.co/mzqSZtGUlv","date":"Mon Jun 20 19:06:49 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Congratulations to recent @ASUEngineering grad Danika Kartchner who has been awarded a @FulbrightPrgrm scholarship! 👏 🔱","date":"Mon Jun 20 17:06:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU recently became the new institutional home to assembling a detailed blueprint, or “workbook,” for carrying forward The American Diplomacy Project’s mission of revitalizing and modernizing the U.S. Foreign Service.","date":"Mon Jun 20 15:08:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuonline #ASUGrad Ahmed Radwan, who graduated this May from @asupublicsvc with a Master's of Science degree, was one of 190 students graduating this spring through support from @AGFforE .\n\nhttps://t.co/CMdOrNMhDU","date":"Mon Jun 20 00:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"'Survivor Link', an @ASUSocialWork program that trains students to help domestic violence survivors, is expanding nationwide after receiving a federal grant.\n\nhttps://t.co/Eqxm0DPVMN","date":"Sun Jun 19 21:00:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@barretthonors #ASUGrad Shelly Smith-Phillips looks forward to attending @asuEnglish for her master's degree in linguistics and applied linguistics after graduation. 🎓 🔱 \n\nhttps://t.co/ti02PKp7Di https://t.co/2ZzMdtkgfo","date":"Sun Jun 19 18:01:13 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"We want to wish a Happy Father's Day to all Sun Devil dads — you're the best!  🔱\n\nFind stickers and gifs to celebrate the Sun Devil dad in your life: https://t.co/FnpQM0xgPR https://t.co/4smHhE0mJr","date":"Sun Jun 19 15:01:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Still trying to decide what your major should be? Make sure you've chosen a major that's the best fit for you by taking this quiz from #ASUadulting. 🎓\n\n 💻: https://t.co/1kfqImcdfn https://t.co/yoBOdXB6c9","date":"Sun Jun 19 01:00:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Thunderbird's Director General and @deankhagram recently joined more than 12,000 leaders from business, government and civil society at the @UN Global Compact Leaders Summit.\n\nhttps://t.co/kqAMOBLVze","date":"Sat Jun 18 22:00:30 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Cronkite_ASU #ASUGrad Randy Chavez has become one of the first two students to graduate from @ASUinCA! \n\nChavez leaves @ASU with a bachelor's degree in communication and looks forward to a future producing podcasts for @NFL!  https://t.co/p5uDw5DHBe","date":"Sat Jun 18 19:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuSOLS Assistant Professor Candace Lewis is conducting a research study on how stress can change children's DNA and, later, their behavior. https://t.co/cJjVgYICmD","date":"Sat Jun 18 16:01:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@arizonapbs has launched a new, redesigned website that aims to connect viewers with important resources and information, and offer top-quality, entertaining content for all ages. \n\nhttps://t.co/49jtJZLruy","date":"Sat Jun 18 01:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Happy #NationalMascotDay to the one and only @SparkySunDevil! 🔱 https://t.co/qOTorC0ZHw","date":"Fri Jun 17 23:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"On Sunday, the U.S. will celebrate #Juneteenth, which recognizes and honors the end of slavery and is considered the longest-running African American holiday. \n\n@ASUSST Associate Professor Rashad Shabazz helps us understand the historical significance of this holiday. https://t.co/tycNA0Ndzs","date":"Fri Jun 17 21:07:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Read more: https://t.co/oM81eVgLC1  (5/5)","date":"Fri Jun 17 19:56:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Right now in @PHXBioCore, teams are developing life-changing health innovations that can benefit people worldwide. \n\nImagine if your family could be vaccinated against cancer or nicotine addiction became a thing of the past. https://t.co/oM81eVgLC1  (3/5) https://t.co/ycLUZfZ7Yb","date":"Fri Jun 17 19:56:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The health innovations coming out of @PHXBioCore can give the U.S. a competitive edge in health care. \n\nIn translation, you could see better access to more quality health care at a lower cost. https://t.co/oM81eVgLC1  (4/5) https://t.co/VKTmddXbJ5","date":"Fri Jun 17 19:56:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"🧵 Thread: Here’s how the @PHXBioCore benefits you, even if you don’t work in health care or live in Arizona. It’s why @CityofPhoenixAZ, @asuhealth, @ASUBiodesign and others are investing in this space. #health #innovation https://t.co/oM81eVgLC1  (1/5) https://t.co/2ttz6EpWTx","date":"Fri Jun 17 19:56:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Arizonans will benefit from a boost to the state economy through @PHXBioCore’s success — such as more freedom in lifestyle choices from a higher standard of living, higher wages or greater improvements in public services.\n\nhttps://t.co/oM81eVgLC1  (2/5) https://t.co/pS69lGLdKh","date":"Fri Jun 17 19:56:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_UTO has partnered with @robotsNpencils and @SlackHQ to create chatbots that aim to help serve @ASU students.\n\nhttps://t.co/Vcj8KkMLDv","date":"Fri Jun 17 17:01:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"For the first time in nearly 20 years, @barretthonors will have new leadership as Tara Williams becomes the college's next dean. \n\nhttps://t.co/DlfhvysETk","date":"Fri Jun 17 15:01:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@sundevilmgolf Head Coach and recent #ASUGrad Matt Thurmond was pushed by the pandemic to pursue a masters degree! Thurmond says the degree from @Thunderbird will help him better relate culturally, as well as academically to his players. \n\nhttps://t.co/u8eO0CIP8U","date":"Fri Jun 17 02:00:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"After years of hard work, overcoming many hurdles and challenging cultural barriers, a Guatemalan team that launched their nation's first \"CubeSat\" satellite has been awarded $7,500 through @II_ASU’s \"CubeSat Delivery Prize.\"\nCongratulations! 🔱 🛰\n\nhttps://t.co/5YncYitf0r","date":"Fri Jun 17 00:01:19 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@WPCareySchool #ASUGrad Chikezie Anachu is combining his knowledge of law and business as he prepares for an associate position @McKinsey in Dallas post graduation! \n\nhttps://t.co/GR85AMx45e","date":"Thu Jun 16 22:01:10 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@MayorOfLA Eric Garcetti and mayors from Colombia, Guatemala and Costa Rica met up at the ASU California Center recently to discuss strategies for ending violence. \n\nhttps://t.co/cT9RCUt89g","date":"Thu Jun 16 20:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@NERC_Official recently alerted that two-thirds of the U.S. could experience summer blackouts due to demands on the power grid and higher-than-normal temperatures.\n@AsuEnergy Assistant Professor Anamitra Pal explains why. \n\nhttps://t.co/AAXl5YJnN7","date":"Thu Jun 16 18:02:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Jonice Bernard's love for musical theatre brought them to a Bachelors of Music in performance from @ASU_MDT. They plan to foster a career of community and equality in the field of musical theatre performance!\n\nhttps://t.co/eZ4xY1eEJw https://t.co/SjmRtsIscj","date":"Thu Jun 16 16:03:17 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new @ASUEngineering initiative is partnering students and faculty with  industry and agency partners to build stronger, more cost-efficient roads.\n\nhttps://t.co/t3yFtmxRg7","date":"Thu Jun 16 02:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Go Devils! 🔱 https://t.co/dYHCQ31Q7N","date":"Thu Jun 16 01:05:59 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Stephanie Gerhart's time at @ASU was highlighted by her dedication to leadership, service and fostering a community. Now, she plans on attending law school while continuing to volunteer for causes she's passionate about.\n\nhttps://t.co/lThZqlAZ7Y","date":"Thu Jun 16 00:01:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"International award-winning professional dancer, educator, choreographer and fitness instructor Shola K. Roberts, a Caribbean dance expert, will be joining the dance faculty of @ASU_MDT.\n\nhttps://t.co/fC430KTKTq","date":"Wed Jun 15 22:01:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"\"@ASU provided courses that allowed me to understand many different viewpoints and cultivate relationships with intellectual people,” said #ASUGrad Maggie Sullivan, who just graduated with a double major in communications and political science. 🎓\n\nhttps://t.co/eP2SCl5hWV","date":"Wed Jun 15 20:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"For the first time ever,  @TheSunDevils lead the Pac-12 with an all-time high multiyear APR score. ASU has received its highest-ever Academic Progress Rate score for a year from the @NCAA and scored its all-time high over a four-year period. #ForksUp! 🎓🔱\nhttps://t.co/DL8Blw7WxC","date":"Wed Jun 15 18:02:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUBeingHuman #ASUGrad Janet Nalubega Ross focuses her career on reproductive health as she graduates from the @ASU_GHP PhD program!\n\nhttps://t.co/zifz5IrQTY","date":"Wed Jun 15 16:02:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Trinity Winton's admiration for public speaking has led her to become a second time #ASUGrad, receiving a masters degree in the communication studies program!\n\nShe plans to work for @asuSOLS as a graduate recruitment program coordinator.\nhttps://t.co/tTooNxOOjk","date":"Wed Jun 15 00:30:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUHIDA #ASUGrad Olivia Hernandez combined creative practice and technology through her MFA coursework. She reflects on her years in @ASU_MDT and @ASU_ArtsMedia and how they culminated into her thesis project at @ideaMuseumMesa! \n\nhttps://t.co/KZ9My8v31j","date":"Tue Jun 14 21:00:42 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"After completing an online graduate certificate from @ASUPsych, #ASUGrad Cynthia Bleiler has found her true passion in helping those suffering from substance-abuse disorders. \n\nhttps://t.co/GtXYFqIyEJ","date":"Tue Jun 14 19:01:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@barretthonors double major in theatre and philosophy Cory Drozdowski is combining experiences from both programs to help people better understand each other. The #ASUGrad looks forward to a masters degree program in the future, and a career in acting. 🎭\nhttps://t.co/6JuxgGK17L https://t.co/8ZcL2zCwZt","date":"Tue Jun 14 17:01:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ICYMI @Cronkite_ASU hosted its first ever \"Media Summit of the Americas\". U.S. Secretary of State @SecBlinken attended the event where issues such as disinformation and its effect on our society were discussed.\n\nhttps://t.co/HYJFifLD5t","date":"Tue Jun 14 15:01:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"One month ago today we celebrated the last convocation of the Spring 2022 semester. \n\nTo the #ASUgrad Class of 2022: all of us at @ASU are so proud of all of your hard work, your support for each other and all your achievements. https://t.co/NlId2rRgwV","date":"Tue Jun 14 01:09:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Ellianna Lederman, #ASUGrad and @ASUTheCollege's Deans Medalist for Spring 2022, looks forward to attending @ColoradoSPH to pursue her masters in public health policy in the fall. Congratulations! \n\nhttps://t.co/spNBThR1M4","date":"Mon Jun 13 23:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASULibraries are co-hosting a Juneteenth event at the Arizona Heritage Center. @asunews spoke to ASU Assistant Archivist of Black Collections Jessica Salow to learn more about the event, and the day itself. \n\nhttps://t.co/8HjjSMYNvx","date":"Mon Jun 13 21:00:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_MDT #ASUGrad Lauren Jimenez found a home for her passions while at @ASU, serving as the president of the dance student organization and interning with @conderdance! \n\nhttps://t.co/gIxF2RZMsB https://t.co/U1cJ4YU7rW","date":"Mon Jun 13 19:01:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Accomplished playwright @MadelineSayet, who is currently touring the country performing her one-woman play 'Where We Belong', will teach a Native American Drama course at @asuEnglish \nThe course will take place during the Spring 2023 Semester.\n\nhttps://t.co/Pl5yPSKWy2","date":"Mon Jun 13 17:02:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In May 2021, Lauren Hardy earned her bachelor's degree in computational mathematics, and continued at ASU as part of the 4+1 program, graduating this spring with a Master of Arts in mathematics from @ASUMathematics! \n\nhttps://t.co/r8qav8vheH","date":"Mon Jun 13 15:01:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Broadway League’s Vice Chair Colleen Jennings-Roggensack will serve as Arizona's only @TheTonyAwards voter. 🎭 \nThe executive director of @ASUGammage will appear on the red carpet wearing Phoenix designer Melissa Torres custom dress.\n\nhttps://t.co/1aVzRwTegX","date":"Mon Jun 13 01:00:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@barretthonors #ASUGrad Andrea Yang discovered a love for film during an internship with @CopaShortsFilm. Now, she hopes to help promote stories that accurately represent the communities they are based on. \n\nhttps://t.co/7cK5M6D6rA","date":"Sun Jun 12 22:00:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SecBlinken recently spoke at the Media Summit of the Americas, hosted by @ASUinCA. Throughout the event, Blinken emphasized the importance of a free press in a democracy.  \n\nhttps://t.co/KQ6TkxYUxb","date":"Sun Jun 12 19:00:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Yishu Li has defied the odds to achieve her dreams of graduating as a double major with degrees in Asian Languages (Japanese) and Art! She details her journey as she prepares to attend @hgse this fall! \n\n@barretthonors @ASUSILC @ASUSchoolOfArt \nhttps://t.co/N9Me32o5UU","date":"Sun Jun 12 16:01:15 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_MDT welcomes international pianist Miki Aoki as assistant professor of collaborative piano. \n\nhttps://t.co/U28RcFix46","date":"Sun Jun 12 01:00:18 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Mother of five and @asuonline #ASUGrad Nicole Blossey is graduating in two and a half years with a degree in Organizational Leadership! She reflects on the challenges faced and overcame on her way to graduating with honors! \n\nhttps://t.co/g2vEth7N8I","date":"Sat Jun 11 22:00:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@wecomefromaway is coming to @ASUGammage June 14-19! \nBased on the true stories of crew and passengers aboard grounded flights during 9/11, the musical presents an uplifting message of how people come together in the wake of tragedy. \n\nhttps://t.co/ASeM9Do4Jp","date":"Sat Jun 11 19:00:56 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering #ASUGrad Margarito Hernandez Fuentes is committed to a career in community impact. \nLooking forward to graduate studies, Hernandez Fuentes plans on a career treating patients and conducting research in a hospital setting. \n\nhttps://t.co/7z1DmEVpvo https://t.co/L71PMed7kD","date":"Sat Jun 11 16:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUCollegeOfLaw #ASUGrad Rahnee Jackson has always been passionate about sports. Graduating with a Masters of Sports Law and Business, she looks forward to a dream career working with the @Suns!\n\nhttps://t.co/PZ6whP0XVE https://t.co/XvFtwLRsGs","date":"Sat Jun 11 01:00:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Payton Major, a senior who is double majoring in geography (meteorology) @ASU_SGSUP and journalism and mass communication @Cronkite_ASU has been chosen as the @CNN Summer Weather and Climate Intern for 2022. \n\nhttps://t.co/cB3EEav1CA","date":"Fri Jun 10 23:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Erin Alexander has been recognized as the 2022 Deans Medalist by @ASUTheCollege!\n\nShe reflects on her time @SESEASU as she graduates with a degree in Earth and Space Exploration, and looks forward to pursuing a masters degree this fall @ASU.\nhttps://t.co/QXlH3xNCPk","date":"Fri Jun 10 21:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych President's Professor Douglas Kenrick and co-author David Lundberg-Kenrick have published a new book that focuses on how many of modern society's problems stem from how our brains evolved. \n\nhttps://t.co/9D1OXcUjT7","date":"Fri Jun 10 19:01:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As a child in the Czech Republic, Roman Buss knew that he wanted to become a lawyer. Now, the @ASUCollegeOfLaw #ASUGrad looks back on his experience as he enters a career in law! ⚖️\n\nhttps://t.co/jLyu4Innwo https://t.co/AueOefRpUX","date":"Fri Jun 10 17:01:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASULibraries is partnering with @AZHistSociety and the Black Family Genealogy and History Society to bring the first #Juneteenth Celebration at the Arizona Heritage Center in Phoenix/Tempe. \n\nhttps://t.co/8HNdJsRn7m","date":"Fri Jun 10 15:01:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Today we celebrate @ASU being named a Hispanic-Serving Institution and joining @HSRUalliance. \n\nThis achievement echoes the importance of our university charter: to measure ourselves by whom we include and how they succeed. #HSRUAlliance \n\nMore: https://t.co/BGZb2boGEQ https://t.co/yVdoUrRbj7","date":"Fri Jun 10 01:00:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A team made up of @ASUEngineering students, known as the \"Air Devils\", placed 7th out of 127 teams in the @aiaa \"Design/Build/Fly\" competition. \n\nCongratulations! 👏\nhttps://t.co/IABmRguAIv","date":"Thu Jun 09 23:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@UnivOfKansas Public Administration Professor Shannon Portillo has been named as the new Director of @ASUPubAffairs. \n\nhttps://t.co/v2Q7YFhYuT","date":"Thu Jun 09 21:01:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad Andrew Columbro found a love for #PublicRelations and Marketing while at @Cronkite_ASU. Now, he's ready to jump right in to the workforce at @commlinks, a PR and Marketing agency in Scottsdale. \n\nCongratulations! \nhttps://t.co/h99lNVht1B","date":"Thu Jun 09 19:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Inspired by the love her dog gave her during tough times, @ASUCommunities #ASUGrad Kari Barber is looking forward to a career in nonprofit leadership and management! \n\nhttps://t.co/XTf9hAy60Y https://t.co/j3ubnQG8oM","date":"Thu Jun 09 17:01:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"BREAKING NEWS: @ASU has been named a Hispanic-Serving Institution by the @usedgov, a major milestone in its commitment to increase the diversity of its student body. 🎓 https://t.co/3AJfiDPTRX","date":"Thu Jun 09 14:07:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SESEASU Regents Professor @ltelkins has released a new memoir that explores finding meaning in the wonders of the universe around us. ✨\n\nhttps://t.co/AxkyVDtsj5","date":"Thu Jun 09 01:00:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuEnglish #ASUGrad Chael Moore started as a nursing major. She soon discovered that her passion was humanities, and now, she hopes to honor her heritage through creative writing. ✍️\n\nCongratulations!\nhttps://t.co/9n1P3PRcKF","date":"Wed Jun 08 23:00:30 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"5 @ASU students have been awarded with prestigious @BorenAwards \n\nCongratulations! 👏🔱\nhttps://t.co/TSocPpKCn3","date":"Wed Jun 08 21:00:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new book from @ASU_MDT Associate Director Karen Schupp examines age and aging in relation to dance. \n\nhttps://t.co/FnFpDWkVbF","date":"Wed Jun 08 19:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SpaceForceDoD and Arizona State University have signed an agreement making ASU the newest member of the service's University Partnership Program. \n\nhttps://t.co/jhGZuVWFjl","date":"Wed Jun 08 17:01:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A career aptitude test helped @SanfordSchool #ASUGrad Jennifer Rivera find her calling: sociology. Now, she hopes to use her degree and passion to advocate for inclusive, comprehensive sex education in the United States. \n\nCongratulations! 🎓\nhttps://t.co/ewp5waBBrT https://t.co/h4UDRwLNPC","date":"Wed Jun 08 15:01:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Jeffery Pendleton used his time at @asuonline to use what he learned around the world. Pendleton spent three-and-a-half years traveling around Europe to see how anthropology applies in other countries. \n\nRead his unique story ⤵️ \nhttps://t.co/hkZR9TiODY","date":"Wed Jun 08 02:00:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU is receiving funds from the state of Arizona to help elementary, middle and high school students whose learning was disrupted by COVID-19. \n\nhttps://t.co/TKJHQfD1Lq","date":"Wed Jun 08 00:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Natalie Zarasian is combining her two passions, graduating with a degree in supply chain management and sports business. \nAnd that's not all — she is now looking forward to a future @ASUCollegeOfLaw with a focus on sports law! \n\nhttps://t.co/qvwVyHOrMz https://t.co/2Y6NNJg56D","date":"Tue Jun 07 22:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Join ASU’s @Ten_Across initiative for a free virtual panel discussion on the \"Importance of Nonprofit Journalism in Today's Democracy\" with @Cronkite_ASU's @susanbgoldberg - June 8 at 7 a.m. MST. \n\nSign up today: https://t.co/VZWQnB1kRo","date":"Tue Jun 07 20:00:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Colleen Price has always enjoyed learning, which made it difficult to decide on a major. \nThat was until a @netflix \"aha\" moment helped her decide to pursue a bachelor’s in philosophy from @ASU_SHPRS. \n\nhttps://t.co/2ZbNob1JMl https://t.co/uHdnyXa1Hb","date":"Tue Jun 07 18:02:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ihr_asu, along @ASU_SHPRS, hosted a delegation from @ANajahUni to discuss ways of motivating students to study humanities in a time of crisis. \n\nhttps://t.co/GojvXGoysA https://t.co/p9lPynGUaY","date":"Tue Jun 07 16:03:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUBiodesign Executive Director Joshua LaBaer, along with his colleagues, has lead a research to explore components of the immune system known as autoantibodies, which have been identified as central players in a range of serious autoimmune diseases. 🔬\nhttps://t.co/UZdbnOMyLO","date":"Tue Jun 07 02:00:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Michael Esposito used his time at @asuSOLS to excel in biological research. Now, he's planning to become a nurse practitioner to help others and to pursue his love for science. \n\nRead his story ⤵️\nhttps://t.co/6tMzW8eOcS","date":"Tue Jun 07 00:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new study from @ASUBiodesign Center for Fundamental and Applied Microbiomics has provided key into the infectious disease risk that occurs during space flight.\n\nhttps://t.co/TI9uq6nxQ5","date":"Mon Jun 06 22:01:59 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Congratulations to @ASUEngineering computer science student Josh Tint, who's one of three winners of @Apple's #WWDC22 Swift Student Challenge! 👏","date":"Mon Jun 06 21:31:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Xuecong Fan's longtime interest in geography led her to pursue a degree in Parks and Recreation Management through @asupublicsvc!\n\nhttps://t.co/UDnlkUr8RZ","date":"Mon Jun 06 20:01:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new @asuSOLS study is the first to indicate the perceived impact of an instructor revealing her LGBTQ identity to students in the U.S.\n\nhttps://t.co/nXuHw1eFq4","date":"Mon Jun 06 18:01:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuhealth #ASUGrad Kaley Matthews overcame her speech difficulties to learn to help others. \nNow, she hopes to use her experience and degree in speech and hearing science to help people who went through the same obstacles. \n\nhttps://t.co/tDM9ywS1f2 https://t.co/FMZmmciQuu","date":"Mon Jun 06 16:02:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Mackenzie King has always had a love for stories. This passion led her to double-major in history and English and helped her get involved at @ASU \n\nCongrats! 🎓\nhttps://t.co/wh9SNL8V9F","date":"Mon Jun 06 00:00:42 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SSEBEatASU Director Ram Pendyala is teaming up with researchers from @UTAustin to try and find out why it is so hard to get people to utilize mass transit options.\n\nhttps://t.co/5kPpBSfJIc","date":"Sun Jun 05 22:00:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuhealth Biomedical Informatics students recently pitched innovative health solutions at the @MayoClinic Sprint Competition for the chance to win $30,000. \n\nhttps://t.co/yZNhGOeaSn","date":"Sun Jun 05 19:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Are you interested in taking a B-session summer class? You still have time! \n\n#ASUSummerSessions can help you catch up, get ahead or just learn something new! ☀️\n\nRead more about the benefits ⤵️\nhttps://t.co/mDfYfOzmcd https://t.co/PU1dRSfqf6","date":"Sun Jun 05 16:01:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"DYK: there's a website where you can find collections of books, poetry and essays that are written or edited by @ASU faculty, staff, alumni and students?\n\nCheck out \"Sun Devil Shelf Life.\" 📚","date":"Sun Jun 05 01:03:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@CISAASU Associate Professor Lorena Cuya Gavilano is offering tips to multilingual job seekers on how to leverage their unique skills. 🗣\n\nhttps://t.co/Wiu6Pf4eBj","date":"Sat Jun 04 22:30:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Coming into college, #ASUgrad Audi Miller had her heart set on being a performer. But she said a dance history class with @ASU_MDT faculty member Naomi Jackson completely changed her perspective. 🩰\n\nhttps://t.co/L1nFjlSPd2","date":"Sat Jun 04 20:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SSEBEatASU Assistant Professor Christian Hoover has earned @NSF support for his research into the mechanics of materials at the smallest scale.\n\nhttps://t.co/tE9IzKHAN4","date":"Sat Jun 04 16:01:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Professor Daniel Buttry, the inaugural director of @ASU_SMS is retiring after an exemplary career.\n\nhttps://t.co/a9xXyVx5k8","date":"Sat Jun 04 01:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUHIDA's Design and Arts Corp students recently helped Emerson School, a school in Phoenix that teaches kindergarten through eighth grade, celebrate 100 years of history. 🖍📓\n\nhttps://t.co/zTSv83TaA9","date":"Fri Jun 03 23:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The ASU-built Europa Thermal Emission Imaging System (E-THEMIS), led by @SESEASU's Philip Christensen for @EuropaClipper, has arrived at @NASAJPL prior to launching for its mission to investigate Jupiter's moon Europa. 🛰\n\nhttps://t.co/KSQBG0tpfu","date":"Fri Jun 03 21:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In collaboration with CALACA Cultural Center, @ASULibraries announce the opening of a new exhibit at ASU's Downtown Phoenix campus' Vault Gallery.\n\nhttps://t.co/mHXxnE3dXm","date":"Fri Jun 03 19:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_MDT students and faculty brought fun interactions to ASU's Tempe campus with the inaugural 'Mash Up' event.\n\nhttps://t.co/fRtuGq5VbE","date":"Fri Jun 03 17:01:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“Before I entered college, I was very undecided which education path I would take or how it would be paid for,” said #ASUgrad Danica Marshall, a Native American student from the Havasupai tribe.\n\n“Thanks to ASU, they helped me resolve both issues.”\nhttps://t.co/mrLMny2dpx","date":"Fri Jun 03 15:01:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU Regents Professors Ana and Tom Moore recognized for decades of achievement during their time at @ASU_SMS.\n\nhttps://t.co/FWLJc5yptM","date":"Fri Jun 03 02:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“I knew I was home when I chose to enroll.”\nThose are the words #ASUgrad Pedro Gorozpe Aguilar used to describe his time at @Thunderbird as he reflects on what drove him to the school.\n\nhttps://t.co/p0c1rTS9ba https://t.co/lZxX1ByN9M","date":"Fri Jun 03 00:01:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@NASA Administrator @SenBillNelson and @SenMarkKelly were “back in school” during a visit to @SESEASU. 🛰\n\nhttps://t.co/4Lqyr90OSX","date":"Thu Jun 02 22:01:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The project, called “A Conversation on Stuttering,” is a documentary film by two @ASU_filmschool students aimed at raising awareness about stuttering. 🎥\n\nhttps://t.co/4KhOGAMGx3 https://t.co/z6RaROXTOn","date":"Thu Jun 02 20:01:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUTheCollege has recognized two outstanding faculty with the 2022 Gary Krahenbuhl Difference Maker Award for their work solving various problems associated with the COVID-19 virus. \n\nhttps://t.co/atc1J6DsLn","date":"Thu Jun 02 18:01:56 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A small-town girl from Parker, Arizona, #ASUgrad Jurni Anderson has always wanted to explore the world. \n\nNaturally, she fit right in at @Thunderbird from where she received her Master of Global Management this May.\nCongrats! 🎓\nhttps://t.co/Ql7TmtPmPm https://t.co/PlnYKBWPky","date":"Thu Jun 02 16:02:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Three @ASU students curate 'extraordinary' SRP art collection that had been lost to time. \n\nhttps://t.co/FZzTKiKAmx","date":"Thu Jun 02 01:00:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Associate Professor K. Hazel Kwon will direct the new Media, Information, Data and Society (MIDAS) lab @Cronkite_ASU, working to combat the spread of misinformation within media and journalism. \n\nhttps://t.co/5doVpmKIFk","date":"Wed Jun 01 23:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Happy #PrideMonth Sun Devils! 🏳️‍🌈\n\nLearn more about the resources available for LGBTQIA+ students: https://t.co/aLL9XHFLQV https://t.co/elbrWbDLnV","date":"Wed Jun 01 21:00:44 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@arizonapbs will join America Amplified's Election 2022 initiative, a movement to empower voters ahead of midterm elections and promote community engagement journalism. 🗳  \n\nhttps://t.co/Z16jdSt4Yz","date":"Wed Jun 01 19:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUNewCollege master's graduate Yasmina Fayed combines psychology and literature through an interdisciplinary studies degree, creating  new approaches to cognitive behavioral therapy.\n\nhttps://t.co/uZHUP38neZ","date":"Wed Jun 01 17:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU professors Melanie Gall and Natasha Mendoza are part of a team that developed HazardAware, a database that lists properties at risk of wind and flooding damage in Gulf Coast homes.\n\nhttps://t.co/PlxrTha63T","date":"Wed Jun 01 15:01:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUHIDA's School of Art has named their new director and she is here to shine the spotlight on art education and its impact on the world. \n\nhttps://t.co/cWnI2CzJwp","date":"Wed Jun 01 02:00:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A workshop made possible by @ASULibraries and @acmrs_asu gave students the opportunity to study rare documents from New Spain (1519–1821), now Mexico. 📖 https://t.co/sLJsn0dunn https://t.co/9lduDpdkpS","date":"Wed Jun 01 00:01:14 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad @ASUMathematics Charlotte Cliatt is the recipient of the 2022 Charles Wexler Mathematics Prize, the highest honor a mathematics undergraduate can receive. Congratulations! 🎓\n\nhttps://t.co/N2G6e54fnc https://t.co/8RgHOs3tYP","date":"Tue May 31 22:01:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Students from @asuhdshc have proven to be invaluable communications interns at many companies, according to internship director Kristin Dybvig-Pawelko.\n\nhttps://t.co/XhuzEPvEPM https://t.co/wVDWOIVs5A","date":"Tue May 31 20:01:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad and Moeur Award recipient Savanna Prida reflects on her experience being part of @ASU_PSA's Next Generation Service Corps (NGSC) for four years. 🎓\n\nhttps://t.co/5jDga5kqHo","date":"Tue May 31 17:01:22 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As we say goodbye to the month of May, we continue to celebrate our #ASUgrad Class of 2022! \n\nHere, some images from our Asian/Asian Pacific American Convocation. \n\nCongratulations graduates! 🎓🔱\n\n#AAPIHeritageMonth https://t.co/Y63GqXLjPE","date":"Tue May 31 15:01:42 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"An ever-present reminder that freedom is not free.  🇺🇸\n\nThis past Friday, in anticipation of #MemorialDay, @ASU_Alumni paid tribute to the 137 ASU alumni who have died in service to our nation during the annual Reading of the Names at Old Main. https://t.co/ezBdLuEPfe","date":"Mon May 30 22:20:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Today, and every day, we honor those who have given their lives in service of our nation. 🇺🇸\n\n#MemorialDay https://t.co/frJS5gxex4","date":"Mon May 30 14:03:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The new Sol supercomputer, an initiative of @ASUResearch’s Research Computing facility, expands power and capability for researchers and students alike. \n\nhttps://t.co/3qXOH39x7X","date":"Mon May 30 00:00:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"This new collaboration will give select @mcccd students scholarship funding to pursue undergraduate degree at @WPCareySchool. https://t.co/jVqgvSjLlE","date":"Sun May 29 21:00:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad Alejandro Hernandez’s passion for history goes as far back as his childhood, when he watched the Indiana Jones movies and the @HISTORY Channel. \nNow, he has received his bachelor’s degree in history from @ASUNewCollege. Congrats! 🎓\n\nhttps://t.co/6Qf3xfTG4e","date":"Sun May 29 18:00:59 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering Associate Professor Brent Nannenga has earned the Chemical Engineering Early Career Impact Award from @UW, his alma mater.\nCongratulations! https://t.co/tRCCM4wNOM","date":"Sun May 29 15:00:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@PolySchoolASU Instructional Professional Richard Filley will retire in June but leaves behind a robust legacy, including the \"Richard D. Filley Make a Difference Award\" that he established for @ASUEngineering students. \n\nhttps://t.co/apND2b5mrW","date":"Sun May 29 01:00:19 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUCommunities' Anne Kotleba encouraged the #ASUgrad Class of 2022 to \"dream big, take risks\" during ASU's Rainbow Convocation Ceremony. \n\nhttps://t.co/OP3UXFclbv https://t.co/Xvr7b760Gr","date":"Sat May 28 23:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@PolySchoolASU professional flight student Grant Penderghast was inspired by his family history to take to the skies, while also being a member of @barretthonors and pursuing a music performance minor. ✈️  🎶  https://t.co/rxwoNaasO9","date":"Sat May 28 19:00:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Students at @PCCLancer will have a streamlined path to a four-year degree at @ASU, thanks to @mypath2asu. 🎒\n\nhttps://t.co/52d0weR1L6","date":"Sat May 28 16:01:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych's Clinical Psychology Center is offering their online summer camp again this year. \nASU’s Skills Program Inspiring and Reinforcing Excellence, or Camp ASPIRE (for short) has three upcoming session this summer. \n\nGet more info here: https://t.co/Eqq4RxOavB","date":"Sat May 28 01:00:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"\"I have always envisioned a future where my roots and language could be a part of my work, and that was a huge part of what brought me to @Thunderbird\" — #ASUgrad Grace Guerrero, who graduated with degrees from Thunderbird and @WPCareySchool! 🔱 👏\n\nhttps://t.co/ZumjOfvsXU","date":"Fri May 27 23:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering celebrated their biggest Grand Challenges Scholars Program cohort yet. \nThe program participants prepare to address global concerns, considering all aspects of a problem and creating value for society. 🔱\n\nhttps://t.co/SwcajaEMJ9","date":"Fri May 27 21:00:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuEnglish's #ASUgrad and @usairforce Capt. Kimberly “Kimber” Jackson has graduated with a Master of Arts in English through @asuonline while maintaining her active-duty career. 👏 🔱\n\nhttps://t.co/zc0ikboB4b","date":"Fri May 27 19:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ICYMI: @Cronkite_ASU's @BizJournalism has announced the awards categories for the 2022 edition of their annual Bartlett and Steele Awards. 🔎  https://t.co/MnGGula2Xl","date":"Fri May 27 17:01:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_MDT's #ASUgrad Kristina Friedgen is headed to Washington, D.C., where she has accepted the position of director of innovation and engagement at @sitarartscenter. 🎓🔱\n\nhttps://t.co/SohO3udbQU","date":"Fri May 27 15:01:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Summer is right around the corner, and if you're looking for ideas on what to do this summer with your #FutureSunDevil, here are 10 ideas from @FutureSunDevils on what to do for your summer send-off with your student.  ☀️⛱\n\n📝: https://t.co/8SdDDGACmn https://t.co/cfYbI6M4nV","date":"Fri May 27 01:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“I was tired of all the barriers to make my ideas a reality — coding allowed me to go from ideation to creation with just a computer.”\n\n#ASUgrad Yasser Mountasir Dbeis recently received his bachelor’s degrees from @ASUEngineering. 👏\n\nhttps://t.co/2qWna0leve","date":"Thu May 26 23:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Today, the Maryvale One Square Mile Initiative is one of the most notable examples of @asupublicsvc's mission to #BeTheSolution and one of ASU's best-known examples of its commitment to social embeddedness.\n\nhttps://t.co/RgByK7z91L","date":"Thu May 26 21:00:44 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad Fatma Abid never thought she’d study journalism, let alone be honored as an Outstanding Graduate Student at @Cronkite_ASU’s spring 2022 convocation ceremony.\n\nNow, Abid’s goal is to see more people like her anchoring the news.\n\nhttps://t.co/daMU0VSFan","date":"Thu May 26 19:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new study led by @ASUPsych shows the benefits of fostering a dog. 🐶 \n\nhttps://t.co/OXhWys5Q54","date":"Thu May 26 17:01:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“I knew I was home when I chose to enroll.”\nThose are the words #ASUgrad Pedro Gorozpe Aguilar used to describe his time at @Thunderbird, as he reflects on what drove him to the school.\n\nhttps://t.co/qLaBbfuRi8","date":"Thu May 26 15:01:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_SPGS Professor of Practice @AzmatZahra was recently awarded a #Pulitzer Prize for International Reporting in recognition of her work on the @nytimes series \"\"The Civilian Casualty Files\"\".\nCongratulations! 👏\n\nhttps://t.co/sFJhBuTMLw","date":"Tue May 24 21:00:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A small-town girl from Parker, Arizona, #ASUgrad Jurni Anderson has always wanted to explore the world. \nNaturally, she fit right in at @Thunderbird, from where she received her Master of Global Management this May.\nCongrats! 🎓\n\nhttps://t.co/NOCY2mQZJB","date":"Tue May 24 19:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU researchers have joined a study with @UniofOxford to uncover important information about the response of tropical forests to climate change.\n\nhttps://t.co/OYBLus4o6s","date":"Tue May 24 17:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"\"Let's go discover things about our solar system that we have no other way to do\" — @ltelkins, Principal Investigator, @MissionToPsyche and Foundation and Regents Professor, @SESEASU. \n\nJoin the journey:\n\nhttps://t.co/Yqm8XDBCz1","date":"Tue May 24 15:00:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"\"Faculty at ASU really opened my eyes to the variety of ways that we as educators can reach students and help them discover and cultivate their own musical journeys\" — @barretthonors, @ASU_MDT #ASUgrad Shawn Schive. 🔱 🎶 \n\nhttps://t.co/MiTnILRGuk","date":"Tue May 24 02:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Nearly two dozen women from South America spent the past week at ASU to become more empowered to fight climate change in their communities. 🌎 \n\nhttps://t.co/7xiwtSe5GD","date":"Tue May 24 00:01:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad Ana “Juli” Rincon used her time volunteering as a child to inspire the major and minor she chose. \nThis spring, the @barretthonors student graduated with her Bachelor of Science in nursing and a minor in integrative health from @asunursing. 🎓🩺\n\nhttps://t.co/XLMCm6KUKs","date":"Mon May 23 22:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@WPCareySchool Professor Hitendra Chaturvedi explains why there could be more supply chain crises ahead as U.S. avoids risk planning.\n\nhttps://t.co/6jZoLtgdSp","date":"Mon May 23 20:01:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"We have to change the world now. Watch this video to see how we – the #ASU community – can do it together. 🔱 https://t.co/SZ1kotqHw3","date":"Mon May 23 18:02:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@Thunderbird's #ASUgrad Ashraf A. Ismail, who graduated with a Masters in Global Management,  founded Knowledge Ark, a startup helping refugees thrive educationally and earn a globally recognized high school diploma, receive vocational training and more. https://t.co/ZI95mDN9o8 https://t.co/7MGmX0qd0U","date":"Mon May 23 16:02:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Ed Buie II has always had a passion for math and physics, and this interest was fostered at a young age by his dad. \n\nNow, Buie is an #ASUgrad with a PhD in astrophysics from @SESEASU. Congrats! 🎓💫\n\nhttps://t.co/TtIxxrXHSq https://t.co/9k7vqdTgs0","date":"Mon May 23 01:00:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's grad season for high schools throughout the country, and many of these new graduates are excited about their next phase: college.\n\nHere, some tips from @FutureSunDevils about how to make the transition from high school to college go smoothly. 🎓 📚  https://t.co/Lrx0liUJKR https://t.co/0JaKJtaxR7","date":"Sun May 22 22:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The newest alumni from @asupublicsvc were encouraged to dedicate themselves to serving others.\n\nCongratulations #ASUgrad Class of 2022! 🎓🎉\nhttps://t.co/eesU2USh5j","date":"Sun May 22 19:00:30 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_MDT first-year MFA student Chris Ignacio spent the Spring 2022 semester in New York, working with @MetOpera as a cover puppeteer! \n\nFor more on his experience ⤵️\nhttps://t.co/iHub8ZcdAs","date":"Sun May 22 16:01:17 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad reflects back on their experience as an @asuonline @ASUNewCollege #SCAP student: “If you would have told me two years ago I would be sitting here now, I would not have believed you.”\n\nCongratulations! 🎓\nhttps://t.co/m82AV5f1bg","date":"Sun May 22 02:05:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A group of nine former Marines has maintained their bond through college life at ASU, supporting each other as they navigate civilian life.\nvia @MilitaryTimes.\n#NationalArmedForcesDay\n\nhttps://t.co/GK8bf8fseR","date":"Sat May 21 23:00:17 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUCollegeOfLaw Spring 2022 graduates reflect on their experiences as they look forward to careers in public service.\n\nhttps://t.co/LWT69WmgGC","date":"Sat May 21 20:00:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"On this #NationalArmedForcesDay, we want to celebrate our recent #ASUgrad student veterans! 🇺🇸 🔱\nHere, some images from the Veterans Honor Stole Ceremony organized by Pat Tillman Veterans Center. \n\nCongratulations graduates! https://t.co/Z4pNwNTCmv","date":"Sat May 21 17:00:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Future health care entrepreneurs, nurses, compliance officers and researchers are ready to make an impact in health care, having just earned their degrees from @asunursing. \n\nCongratulations to the #ASUgrad Class of 2022! 🎓🎉 \nhttps://t.co/bS6kxnqm9V","date":"Sat May 21 01:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In honor of #EndangeredSpeciesDay, we take a look at @neon_sci, a group of facilities that collect long-term, open-access ecological data to observe changes to U.S. ecosystems — and the NEON Biorepository at @ASU is the primary host of the samples from across the country.\n\nMore:","date":"Fri May 20 23:17:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@barretthonors #ASUgrad Bronwyn Elizabeth can't wait to see what the future has in store for her. 🎓\n\nThis summer, she moves to London to study classical drama at the world-renowned @LAMDAdrama, just a stone's throw away from Shakespeare’s Globe Theatre: https://t.co/9JLhjKT8st https://t.co/NtXb6ssSwR","date":"Fri May 20 21:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The ASU Center for Mindfulness, Compassion and Resilience has recorded hundreds of guided meditations ranging from five to 15 minutes in duration. \n\nOn this #WorldMeditationDay, take a moment  to try one yourself.  \n\n🧘‍♂️  https://t.co/ieUaRUm9Ic https://t.co/wAjpyLmBBl","date":"Fri May 20 19:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"When the Pappas family — mom Maria and daughter Katianna — began their educational journeys at @asuonline, it wasn’t their grand plan to earn their diplomas at the same time. \n\nBut the timing worked out just so. Congratulations to this #ASUgrad duo! 🎓\nhttps://t.co/YTm2ZsCBX7 https://t.co/Fd5eS9dZfJ","date":"Fri May 20 17:01:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Did you know it’s #WorldMeditationDay? 🧘‍♂️ \n\nResearch at @asuhealth shows meditation not only calms you but can help you feel more creative, remember things better and even improve your immunity. \n\nhttps://t.co/xQD0gle5QJ https://t.co/MZbBZjTMkv","date":"Fri May 20 15:01:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"PhD student and current @asucli participant Gina Scarpete Walters received a scholarship from the Melikian Center Awards Program to study Albanian in support of her doctoral research.\n\nCongratulations!\n\nhttps://t.co/vlAxztE1AC","date":"Fri May 20 02:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ThePublicSquare has announced author @hmcghee as the winner of the 2022 Zócalo Public Square Book Prize and @chelsearathburn as the winner of the 2022 Zócalo Poetry Prize.\n\nCongratulations!\n\nhttps://t.co/DBO7I33wIY","date":"Fri May 20 00:01:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Arizona is on the hunt for high-tech industry, and one of the lures are five science and technology centers being built by @ASU. \n\nOne of these, the AMPED science and technology center at ASU, is helping to energize the New Economy Initiative.\n\nhttps://t.co/QK5BDIiNL3","date":"Thu May 19 22:01:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"An @ASUPsych program helps military families adapt to life back home. \n\nhttps://t.co/KVKziIL4an","date":"Thu May 19 20:01:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A team of @ASUEngineering students is the first from @ASU to compete in the @TMSSociety’s Bladesmithing Competition. \n\nThe team won the Creative Use of Materials Award for their innovative use of magnetite. Congratulations! ⚔️\n\nhttps://t.co/qHlKhys7RG","date":"Thu May 19 18:02:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"No. 8 seed @ASUSoftball punched the program's 17th-straight ticket to the NCAA Tournament, and will host a Tempe Regional on May 20-22! 🔱 🥎\n\nhttps://t.co/pvfFWJ1VLc","date":"Thu May 19 16:03:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@apsFYI, @SRPconnect, @TEPenergy and @SWGas have formed a coalition with @ASU, @uarizona and @NAU to achieve a carbon-neutral economy in Arizona. 🏜\n\nhttps://t.co/7o00g26Dgs","date":"Thu May 19 02:00:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad Lianyue Zhang followed her MAPP @MyPath2ASU to transfer from @GCCaz to @ASU ensured she took the right courses at the right time. 🎓\n\nZhang shares more about her journey to ASU and the advice she has for future transfer students: https://t.co/5x1HW1Rz2m https://t.co/TfbfycabAt","date":"Thu May 19 00:17:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUBiodesign researcher Jeffrey Kordower and his team have found a potential treatment that could effectively reverse motor symptoms due to Parkinson’s disease. \n\nMore: https://t.co/Q8fb5CmkZG","date":"Wed May 18 22:40:20 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@AccessCoASU has been recognized for its advocacy for marginalized groups and those living with disabilities at @ASUStudentLife's annual Pitchforks Awards! \n\nhttps://t.co/ZxINJwwkL8 https://t.co/DAz0jYvdTG","date":"Wed May 18 19:01:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Constance-Sophie Almendares found her future in public relations at @Cronkite_ASU and is excited to travel and work in freelance internal and external PR. \n\nhttps://t.co/vaaixvmLjM","date":"Wed May 18 17:01:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"DYK: Orange Mall on ASU's Tempe campus is a @SITEScertified sustainable location, providing both improved comfort and lower maintenance costs. 🌴\n\nTake a virtual tour: https://t.co/o6OFaas6Ap https://t.co/QY5ZTCJKoe","date":"Wed May 18 15:01:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Miles English found his niche in technological leadership by creating an approachable K-12 aerospace education course. https://t.co/gvc9zT1fFT","date":"Wed May 18 02:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU Narrative Storytelling Initiative is partnering with @TempleUnivPress to create a new book series that will connect both scholarly and wide public audiences. 📚https://t.co/yQ81iTVLjE","date":"Wed May 18 00:01:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Founder of @HugsAz Austin Davis has made the most of his time as a #SunDevil. The #ASUGrad has published four books and toured the country, while assisting and feeding the homeless in his free time. \n\nFor the full story ⤵️\n\nhttps://t.co/3GLrNkG6rn","date":"Tue May 17 22:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new joint study by @UCSanDiego, @ASUPsych, @BarrowNeuro, @nmsu, @VASanDiego and the Neurtex Brain Research Institute has revealed the marble-sized portion of the brain that is responsible for 'what, where, when' information.  https://t.co/as4qxhJg6d","date":"Tue May 17 20:01:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"To become part of @ASUEngineering Grand Challenges Scholars community, students must exhibit five competencies through research or a creative project, multidisciplinary learning, entrepreneurship, multicultural experience and a service-learning project.\n\nhttps://t.co/jgh4lGKXhI","date":"Tue May 17 18:02:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The past four decades have seen many advances in electron microscopy at ASU, and Ray Carpenter, professor in @ASU_SMS and @EyringCenter, has been instrumental in many of them.\n\nhttps://t.co/Kime9l7FTD","date":"Tue May 17 16:02:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Kiera Charley is a star student — a Flinn Scholar, starting college at 16 and studying astrophysics. \n\nThis is her story, the story of one Navajo teen's transition to ASU — and how higher education is changing to better serve the needs of Native American students.","date":"Tue May 17 01:00:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuhdshc Professor Laura Guerrero has received the 2022 Teaching Award from @IARRofficial! \n\nThis award recognizes excellence in the teaching field of personal relationships. Congratulations!\n\nhttps://t.co/O4I8hI738T","date":"Mon May 16 23:30:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"STEM education isn’t typically offered at the grade-school level, but a group of local science, technology, engineering and math activists, including @ASUEngineering faculty members and students and industry mentors from @GM and @intel, are working to change that.","date":"Mon May 16 22:00:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych has launched a new Online Master of Science in Addiction Psychology to prepare students to use evidence-based treatment strategies to assist those dealing with addiction. https://t.co/E6BEACSL1J","date":"Mon May 16 20:30:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@GlobalSportASU, working alongside @GOTRI and @i9Sports, is offering an Applied Coaching Communication course that addresses the female opportunity gaps in sports. ⚽️\n\nhttps://t.co/47qCZ52BMs","date":"Mon May 16 19:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In a statewide effort to track the COVID-19 pandemic in Arizona, a coalition of researchers from universities and health agencies, including @ASU, @NAU, @TGen, @AZDHS and @uarizona, has sequenced over 100,000 samples of the SARS-CoV-2 virus. https://t.co/3brhOUHDHD","date":"Mon May 16 17:30:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Today is the first day of classes for Summer 2022 sessions A and C — good luck to all #SunDevils who are continuing their education this Summer! 📚\n\nHave questions about Summer sessions? More info:  https://t.co/TTTmtXznlH https://t.co/R2FMvRnY6J","date":"Mon May 16 15:01:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"At a recent event hosted by @asuhealth and @asunursing Chef Kenneth Moody instructed students on how to use a pressure cooker to make easy and healthy recipes. 🍲 \n\nhttps://t.co/Yo9Ztz3dQ5","date":"Mon May 16 02:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"If you're looking for a new read, check out @ASUEngineering's 11th annual list of book recommendations. 📖 https://t.co/QBvt4u5evn","date":"Sun May 15 23:30:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUTheCollege has recognized faculty excellence with the 2022 Zebulon Pearce Teaching Awards, the highest recognition of teaching in The College. \n\nCongratulations to these faculty members! 🔱 https://t.co/CI3fPOLcHH","date":"Sun May 15 21:00:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering Professor Daniel E. Rivera has recently been named as a fellow of the American Institute of Chemical Engineers (@ChEnected) for his standout work in the field.\n\nCongratulations! https://t.co/p5c6iqY0tw","date":"Sun May 15 18:30:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As we wrap up graduation week, let's look back on the creativity displayed in these #ASUgrad caps! \n\nWell done, Class of 2022! 🎓🎉 https://t.co/hsIJFyCvTp","date":"Sun May 15 16:01:15 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"You did it, #ASUgrad! 🎓\n\nWatch highlights from all four years of your Sun Devil experience and revel in those amazing moments you shared with friends, your accomplishments and being part of the Sun Devil community!  🔱 https://t.co/04u2bSkYbv","date":"Sun May 15 01:06:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"“I didn't have a home before I came to ASU, and ASU became my home — as soon as I started college I knew that I had nothing to worry about.” \n#ASUgrad Yajaira Medina talks about her experiences at @ASUNewCollege. \n\nCongratulations Yajaira! 🎓🔱 \nhttps://t.co/S88X1gQICJ https://t.co/g1G0pNVVo4","date":"Sat May 14 22:30:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad George Ramos reflects on his undergraduate experience @ASU and how he found his niche in speech and hearing sciences! \n\nhttps://t.co/0wzuBWwXXv","date":"Sat May 14 20:00:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As her honors thesis project for @barretthonors, #ASUgrad Devany Detwiller established a scholarship called F.L.O.S.S. (Future Leaders of Smiles Scholarship) to help cover dental school expenses for pre-dental students.\n\nhttps://t.co/ha2Qcxrvrc","date":"Sat May 14 17:30:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Check out some images from the seven special-interest convocations we celebrated this past week. \n\nCongratulations #ASUgrad Class of 2022! 🎓🎉\n\n📸 More images: https://t.co/WtN10cisAo https://t.co/y4AAgZDKVL","date":"Sat May 14 16:01:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Relive the amazing moment when ASU undergrads turn their tassel and get ready to embark on their next adventure.\n\nCongratulations #ASUgrad Class of 2022! 🎓🔱 https://t.co/nk9C76cqB3","date":"Sat May 14 01:04:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Army veteran (and now #ASUgrad) Tae Chong shows that it is never too late to learn something new. ❤️💛\n\nvia @abc15. \nhttps://t.co/pOpVggb3zr","date":"Fri May 13 23:00:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Some quick facts about our #ASUgrad Class of 2022 🎓\n\nCongratulations graduates! 🎉🔱 https://t.co/0zDtiQ1OFI","date":"Fri May 13 21:06:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Sisters Rania and Juliana Jundi of @ASUNewCollege reflect on their journey and the obstacles they have faced as they graduate with bachelor's degrees in biology!\n\nhttps://t.co/is04mKi346","date":"Fri May 13 19:01:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Alejandro Caballero has won the best poster at the AZPURC research conference, presented by the Psi Chi Psychology honors society for his work on child resilience in the Emerging Minds Lab! \n\nhttps://t.co/O0VK4aCNKa","date":"Fri May 13 17:01:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad week comes to a close today, but we still have a lot to celebrate! 🎉\n\nToday's ceremonies schedule:\n\n🎓 2 p.m. @wpcareyschool Graduate convocation\n\n🎓 7 p.m. Hispanic Convocation\n\nLivestream info:","date":"Fri May 13 15:03:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As master scholars and doctors, the #ASUgrad Class of 2022 will be a major force in making the world a better place. \n\nSee highlights from ASU's Spring 2022 Graduate commencement.\n\nCongratulations grads! 🎓🎉 https://t.co/GbKKkXCro7","date":"Fri May 13 01:22:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_SPGS Dean's Medalist Theresa DeConcini will be coming back to @ASU to pursue her master's next fall! She has felt fulfilled with the opportunities she has found here and is eager to learn more. \n\nRead her story ⤵️\nhttps://t.co/Cc95cZeB42","date":"Thu May 12 23:00:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@FrankWilczek, a Nobel Prize-winning theoretical physicist, author and ASU Distinguished Professor, has been selected as the winner of the 2022 @TempletonPrize. \n\nCongratulations!\nhttps://t.co/pgz83qgHLo","date":"Thu May 12 21:00:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUGrad Kelly Erickson found her passion for anthropology while traveling the world. Through @ASU's partnership with @Uber Kelly has been able to explore education and is now applying for her PhD. 🎓\n\nRead her unique story ⤵️\nhttps://t.co/DLWZZWjh6d https://t.co/TI1HIO3uTp","date":"Thu May 12 19:01:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Air Force Veteran, National security professional, and now #ASUGrad Jennifer Counter is graduating with her third master's degree from @asuonline. 🎓\n\nRead her amazing story ⤵️\nhttps://t.co/FyTn0ggtqd https://t.co/RBFXkRnqYC","date":"Thu May 12 17:01:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad week is almost over, but the celebrations continue! 🎉\n\nToday's ceremonies schedule:\n\n🎓 9 a.m. @CISAASU\n🎓 11 a.m. Black African Convocation\n🎓 2 p.m. @asunewcollege\n🎓 7:30 p.m. @ASUEngineering\n\nLivestream info:","date":"Thu May 12 15:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_SMS Dean's Medalist Aaron Jafar Hernandez Flores has radiated enthusiasm throughout all of his years at ASU. Now, the first-generation #ASUGrad wants to come back to ASU for his PhD and inspire others. 🎓\n\nRead his story ⤵️\nhttps://t.co/siF0yruBiR","date":"Thu May 12 01:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Are you familiar with @ASU's \"No Pity for the Kitty\" shirts? For the past four years, #ASUgrad William Simmons has designed them. Now, he'll be working as a designer and art director. 🎓\n\nRead his story ⤵️\nhttps://t.co/jvn3OgwOrV https://t.co/3nncaimvcT","date":"Wed May 11 23:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Henry Louis Gates Jr. talked about his interest in genealogy and the origins of his show, \"Finding Your Roots\" during “Past Connections That Bind Us All: A Conversation with Henry Louis Gates Jr.,” a Q&amp;A event by @arizonapbs and @Cronkite_ASU.\n\nhttps://t.co/yr75zeWcGA","date":"Wed May 11 21:00:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_Alumni Medallion Scholar and #ASUGrad Alyssa Duran plans to use her degree from @WPCareySchool to work in digital marketing, helping companies form real connections with their customers. 🎓\n\nRead more about her story at ASU ⤵️ \nhttps://t.co/unV7rRiNgu https://t.co/UxLLOg7EwL","date":"Wed May 11 19:30:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Army Lt. Gen. H.R. McMaster, who served as the 26th assistant to the President of the United States for National Security Affairs asked graduating veterans to do two things: strengthen the nation and build a better future for generations to come. 🎓\n\nhttps://t.co/azebqV3rr5","date":"Wed May 11 18:01:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@WPCareySchool faculty spoke at the annual Economic Outlook webcast, discussing the future of the Arizona economy. 📊\n\nhttps://t.co/fEbuoSBVnR","date":"Wed May 11 16:30:16 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad convocations continue! 🎉\n\nToday's ceremonies schedule:\n\n🎓 9 a.m. @asunursing\n🎓 9 a.m. @asuhida\n🎓 11 a.m. Asian/Asian Pacific American Convocation\n🎓 2 p.m. @asuhealth\n🎓 4 p.m. American Indian Convocation\n🎓 7:30 p.m. @ASUTheCollege\n🎓 7:30 p.m. @ASUCollegeOfLaw","date":"Wed May 11 15:00:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The #ASUgrad class of 1972 returned to campus yesterday to celebrate their Golden Reunion! 🎉\n\nRead the story of one ASU Golden Grad who joined Angel Flight, a women’s auxiliary supporting the Air Force Reserve Officer Training Corps. ✈️ \nhttps://t.co/AKEJeyn8ih https://t.co/5VGoXlJ8fh","date":"Wed May 11 02:00:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Lonnie G. Bunch III, the 14th secretary of the @smithsonian Institution, encouraged the #ASUgrad Class of 2022 to cherish their relationships, reminded them that they have the power to affect change and empowered them to \"Find your own good fight.” 🎓\n\nhttps://t.co/RVHjRYNHYf https://t.co/FwEjtAREm5","date":"Wed May 11 00:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In the last eight years, the @asuonline and @Starbucks College Achievement Plan has graduated over 8,500 partners. This year was their biggest class yet with nearly 900 graduates. Congratulations! ☕️🎓\n\nhttps://t.co/rfiUsJHaR2","date":"Tue May 10 21:30:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Five Afghan refugee students @ASU spoke at the @MilkenInstitute's Global Conference in Los Angeles, detailing the balance within their lives right now.  https://t.co/Mg2boSgtzw","date":"Tue May 10 19:01:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"With speakers such as Former Arizona Supreme Court Chief Justice Ruth V. McGregor and Nicole Mayberry, the outgoing president of the Graduate Professional Student Association, @ASU grads felt the words of pride, hope and reflection. \n\nhttps://t.co/bTc5PSmVwc https://t.co/gysaFu0XFd","date":"Tue May 10 17:19:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad celebrations continue! 🎉\n\nToday's ceremonies schedule:\n\n🎓 9 a.m. @asueducation\n🎓 11:30 a.m. Rainbow convocation\n🎓 2 p.m. @asupublicsvc\n🎓 2 p.m. @ASUCollegeofGF\n🎓 4 p.m. @Thunderbird\n🎓 7:30 p.m. @WPCareySchool\n🎓 7:30 p.m. @Cronkite_ASU\n\nLivestream info ⤵️","date":"Tue May 10 15:00:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Congratulations #ASUgrad Class of 2022! 🎓🔱🎉 https://t.co/yPjgsOennK","date":"Tue May 10 03:57:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"LIVE from Sun Devil Stadium: we're celebrating ASU's Undergraduate Commencement.  Congratulations #ASUgrad Class of 2022! https://t.co/QsfffUvYdG","date":"Tue May 10 02:26:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"We're just a few minutes away from our #ASUgrad Undergraduate commencement ceremony! \n\nCannot be here in person? Livestream it at:\n📱 Facebook https://t.co/W50WLNYmQa\n🐦 Twitter @ASU\n💻 LinkedIn https://t.co/qQaP9drhY3\n🖥 https://t.co/olrC6SVuAu\n\nStarting at 7:30 p.m. (AZ) https://t.co/xwbDVN46BD","date":"Tue May 10 02:25:22 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"LIVE from Desert Financial Arena: we're celebrating ASU's Graduate commencement — congratulations graduates! #ASUgrad https://t.co/lzHAneOiwq","date":"Mon May 09 15:55:48 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's almost time for our Graduate commencement ceremony!\n\nCannot be here in person? Livestream it at:\n📱 Facebook https://t.co/W50WLNYmQa\n\n🐦 Twitter @ASU\n\n💻 LinkedIn https://t.co/qQaP9drhY3\n\n🖥️ https://t.co/olrC6SVuAu https://t.co/uJh7cRAYwm","date":"Mon May 09 15:45:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Let the celebration begin, #ASUgrad! 🎉\n\nCommencement activities begin tomorrow, get ceremony and events details here. ⤵️\nhttps://t.co/WMt1bmLVLs","date":"Mon May 09 01:00:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The spring 2022 convocation will be a special one for @barretthonors. 🎓 \n\nhttps://t.co/ZdREImkJI6","date":"Sun May 08 22:00:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Graduation season for our spring 2022 class has started! 🎉\nCheck out our #ASUGrad social media toolkit for all the fun ways to celebrate graduation. 🎓 \n\nhttps://t.co/D2lAEuLzve https://t.co/EceT1eLkDU","date":"Sun May 08 19:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"We are wishing all the Sun Devil moms out there a wonderful Mother's Day! Our Sun Devils wouldn't be here without you. 💛 https://t.co/504TPHXD6d","date":"Sun May 08 16:01:55 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Want to support your #ASUGrad? Check out our Giphy channel! \nWe have lots of new stickers and gifs to celebrate our 2022 grads. 🎓\n\nhttps://t.co/ubW2qSGpFd https://t.co/JaZLfSExBd","date":"Sun May 08 02:00:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"What’s key to understanding the economics of Mother’s Day?\n@WPCareySchool Economics Professor Lee McPheters took a look at Mother’s Day spending projections for this year. 💐\n\nhttps://t.co/4JB4Ylk5xs","date":"Sun May 08 00:00:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A @barretthonors student has won the nation’s most prestigious award for undergraduates who are pursuing careers in public service.\n\nCongratulations! 🔱\nhttps://t.co/Ntg3zP4mj8","date":"Sat May 07 21:30:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Downtown Phoenix Farmers Market has found its new home at the Phoenix Bioscience Core. \nThe market will work with the Bioscience High School to reduce and divert food waste and with @ASU programs to support entrepreneurs and farmers. 🥬🍅 \n\nhttps://t.co/DKEbVr76gx","date":"Sat May 07 19:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"If you’re heading to the veterans or international student stole ceremonies today, use Loop 202 Santan or Red Mountain freeways as alternate routes.","date":"Sat May 07 17:08:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Are you in town for graduation? Purchase a lawn sign to support your #ASUgrad! 🎓\n\nAvailable for purchase at @SunDevilBooks, while quantities last. https://t.co/Rsi5WvFCQc","date":"Sat May 07 17:00:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Hey #ASUGrad! Want to celebrate your graduation on social media? Use some of our AR filters on Instagram! We have campus backgrounds, grad cap filters and more! 🎓\n\nhttps://t.co/yVirfpN6ky https://t.co/9PrxvsybWc","date":"Sat May 07 02:00:30 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Entrepreneurs were pitching for dollars (and change) at @EntrepreneurASU's bi-annual Venture Devils 'Demo Day' event. Funding was awarded to companies in the areas of water conservation, baking, phone charging and more!\n\nhttps://t.co/BWhHzzkhn4","date":"Sat May 07 00:00:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A group of @ASU researchers and local Arizona teachers are bringing biotechnology to Arizona classrooms through a virtual curriculum to introduce the subject to the next generation of scientists and decision-makers.\n\nhttps://t.co/vAXVgZy29r","date":"Fri May 06 22:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Show off your cap, #ASUgrad! 🎓 \n\nSend us pictures of your decorated grad caps via \n\n• Facebook DM \n• Instagram DM \n• or use #ASUgrad\n\nfor a chance to be featured in our social accounts or https://t.co/rtW1zWRZcB! https://t.co/lDozQpwz6D","date":"Fri May 06 20:00:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It started with a family photo album that led to an @ASULibraries archivist. Now, that inquiry led to a major discovery of a piece of ASU's history. \n\nRead the story of Estella Rochelle McHenry, ASU's first female African American graduate. ⤵️\nhttps://t.co/5W3h7dQvGS","date":"Fri May 06 18:01:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering Professor Anamitra Pal is leading award winning research, supported with the CAREER award from the @NSF, to better monitor and control the national electric power infrastructure.\n\nhttps://t.co/Xh9vKbyLvn","date":"Fri May 06 16:03:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"You've made it through the thesis, lectures and presentations  —  and now it's time to celebrate everything you've accomplished. \n\nHere's how to wear your doctorate cap and gown for your big day, #ASUgrad. 🎓😈 https://t.co/ECL1ewxs0Y","date":"Fri May 06 02:05:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych's Hyperactivity, Executive dysfunction, and Attention problems (HEAT) Clinic is launching a new program that identifies how to help a parent with ADHD be successful when trying to help their child with ADHD.  https://t.co/oZbLTe6cp4","date":"Fri May 06 00:01:10 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Abhinav Acharya, an assistant professor of chemical engineering in @ASUEngineering, is exploring metabolism and immune response in order to develop new techniques that could treat multiple diseases. \n\nhttps://t.co/gFbJ6tOrmg","date":"Thu May 05 22:30:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU and @salesforce's Trailhead Academy are joining forces to enable students to sharpen their technical and creative skill sets even more. 💻\n\nhttps://t.co/9Apzop78li","date":"Thu May 05 21:00:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUSocialWork students visited the borderlands recently to learn about immigration issues and border culture. \n\nhttps://t.co/xv7TAVXgAF","date":"Thu May 05 19:01:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering, @SEMTEatASU Assistant Professor Kenan Song is developing a new method to enhance 3D printing to enhance manufacturing precision at very small scales with a wider range of materials.\n\nhttps://t.co/vMySqwSdpq","date":"Thu May 05 17:01:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Today is #CincoDeMayo — but what's the true origin of this day?\n@ASU_SHPRS Professor Alexander Aviña and @ASU_Transborder Professor Monica De La Torre explain everything you should know about this holiday.\n\nhttps://t.co/H0XkRg8awA","date":"Thu May 05 15:01:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Don't let a wardrobe malfunction ruin your day, #ASUgrad!\n\nHere's how to correctly wear your master's cap and gown — hint, Master's regalia includes a hood, but it isn't worn on your head. 🎓 https://t.co/OYYib82Mhj","date":"Thu May 05 02:08:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"They're all good boys! 🐶\n\nA study worked on by @asuSOLS professor Noah Snyder-Mackler shows that a dog's temperament is not determined just by their breed. https://t.co/h6bkPCRX4p","date":"Thu May 05 00:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Sun Devil 100 honoree Michael Focareto’s nonprofit @VetTix has helped more than 11.5 million veterans and first responders attend concerts, comedy shows, movies, festivals, car auctions, ballet performances, museums and more. #GoDevils (2/2) https://t.co/VwM3CvUeQw","date":"Wed May 04 22:03:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"What started as an ASU class project in a garage has supplied free event tickets to more than 11.5 million #veterans and first responders. 🇺🇸 💛 (1/2) https://t.co/3KMFyewodr","date":"Wed May 04 22:03:49 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @McCainInstitute hosted the Sedona Forum last week where world challenges were addressed by more than 70 national and international leaders including FBI Director Christopher Wray and former Ukraine President Petro Poroshenko.\n\nhttps://t.co/KN8geSZsrz","date":"Wed May 04 20:01:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"For the first time ever, scientists have mapped live coral before and after a marine heatwave, uncovering new information about the impact of rising temperatures on corals. \n\nExplore the study by @ASU_GDCS, @ASUGlobalFuture and @NOAA: https://t.co/TOzDAciI6Y https://t.co/yLMhJ298ox","date":"Wed May 04 18:02:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"May the Fourth be with you! 💫\n\nDid you know that @ASULibraries has the droids you are looking for? The Nicholas A. Salerno #StarWars Collection houses publicity materials and merchandising products for the Star Wars film series from 1976-2005.\n\n#StarWarsDay #MayThe4thBeWithYou","date":"Wed May 04 16:00:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Get ready to turn that tassel, #ASUgrad! \n\nCheck out this video if you have any questions about how to wear your bachelor's cap and gown. 🎓 https://t.co/qUDDyefqlx","date":"Wed May 04 02:02:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Anthony J. Brazel Lecture, hosted by @ASUrbanClimate, heard from @IPCC_CH's Karen Seto on how cities can help solve the climate crisis. \n\nhttps://t.co/Ap5uTVjChN","date":"Wed May 04 00:30:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU professors Anne Feldhaus and Carlos Vélez-Ibáñez are among those newly elected to @americanacad!\n\nFor more ⤵️\nhttps://t.co/me8ckSxJTp","date":"Tue May 03 22:30:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@WPCareySchool alumnus Josh Cohen was recognized as the top @ASU_Alumni's Sun Devil 100 Class of 2022 company, with the fastest-growing Sun Devil-led company, @pc_sportscards! \n\nhttps://t.co/eGFFiFzgKZ","date":"Tue May 03 20:30:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asueducation Dean Carole Basile explains the importance of showing appreciation to educators beyond Teacher Appreciation Week. \n\nhttps://t.co/pz4XBjSmNV","date":"Tue May 03 18:30:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Four @ASUFootball Sun Devils have been selected in the 2022 NFL Draft, with three being selected in the top-150 picks. \nCongratulations to these student athletes! 🔱 🏈\n\nhttps://t.co/tnUoKIyeQl","date":"Tue May 03 16:30:13 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Panelists from four ASU organizations, including @ASURainbowCo and @ASULibraries, gathered for a discussion titled \"Queer in Academia\" to advocate for increased representation, awareness and involvement for LGBTQ+ students in academia. \n\nhttps://t.co/E7j0CUtPZc","date":"Tue May 03 14:30:15 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@PHXBioCore benefits you, even if you don’t work in health care or live in Arizona. It’s why @CityofPhoenixAZ, @asuhealth, @ASUBiodesign and others are investing in this space. #health #innovation","date":"Tue May 03 14:00:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Congratulations to Evelyn Farkas, the new executive director of the @McCainInstitute. As a foreign policy expert and former @DeptofDefense official, she will bring a wealth of knowledge to her new position. \n\nhttps://t.co/rymSdEucYQ https://t.co/02KJsAAr9O","date":"Tue May 03 02:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Annual Regents' Cup competition was held on Saturday at @NAU with students from Arizona's three public universities coming together to debate and participate in storytelling competitions to win thousands of dollars in scholarships.\n\nhttps://t.co/oMw09uLzuI","date":"Tue May 03 00:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Read more about how @PHXBioCore is poised to revolutionize health and drive economic growth to benefit Arizona and beyond. (7/7) https://t.co/3bT9eevqqi","date":"Mon May 02 22:16:51 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@uarizona spinoff BacVax is developing a safer approach to preventing bacterial infections — alternative to frequent antibiotic use. Its founder is the former senior vice president of research at @PhxChildrens Hospital, Dr. Terrence Stull.\n (6/7) https://t.co/3bT9eevqqi https://t.co/ckJE3f8XFy","date":"Mon May 02 22:16:51 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuhealth Professor Scott Lieschow is developing a plant-based drug that can help people overcome nicotine addiction. Lieschow is in the process of testing the drug at @PHXBioCore with the help of community volunteers. (5/7) https://t.co/3bT9eevqqi https://t.co/0iI5QcGTKz","date":"Mon May 02 22:16:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Shu Wang, a nutrition professor at @asuhealth, is exploring new treatment and prevention for chronic diseases, especially cardiovascular disease and obesity. She aims to translate her research from the lab to real-life health intervention. (4/7) https://t.co/3bT9eevqqi https://t.co/uUM3u45Qr3","date":"Mon May 02 22:16:49 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@OncoMyx, an ASU spinoff, is working on oncolytic immunotherapies that use viruses to infect and destroy cancer cells. One of @PHXBioCore’s first tenants, the company was co-founded by @ASUBiodesign Director and Professor @grantmcf_grant.\n (3/7) https://t.co/3bT9eevqqi https://t.co/VJsuE9bgFR","date":"Mon May 02 22:16:48 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"🧵 Thread: \n\nWill the cure for cancer come from Phoenix? We’re getting closer. In @PHXBioCore, startups are pursuing life-changing #health #innovations — a result of collaboration with the @CityofPhoenixAZ, @asuhealth, @ASUBiodesign and others. (1/7) https://t.co/3bT9eevqqi https://t.co/jmQOEdHB4S","date":"Mon May 02 22:16:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Calviri, a company founded by a scientist at @ASUBiodesign, is developing a cancer vaccine that can help dogs and people. (2/7) https://t.co/3bT9eevqqi https://t.co/mrYiZgIH1x","date":"Mon May 02 22:16:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A @barretthonors program is offering first-year honors students to help them adjust to college life and become more involved in the Barrett community. ☀️\n\nhttps://t.co/uhjFGLyMP0","date":"Mon May 02 21:00:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Durham Hall's reopening on April 26th highlighted it's significance as a center for cultural learning. The building, home to @ASUSILC, hosts 11 humanities centers, more than 20 languages are taught here, with ten thousand students using it every day.\n\nhttps://t.co/cDXplsDLOi","date":"Mon May 02 17:01:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The countdown is on, #ASUgrad! 🎓\n\nIf you're attending ceremonies at Sun Devil Stadium or Desert Financial Arena, check out this video for some tips on how to make your big day run smoothly. https://t.co/glIs3A0pmx","date":"Mon May 02 15:06:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_ArtsMedia Director @pturaga1 has won a million-dollar federal grant to improve the way that computers discern images for @DeptofDefense. Congratulations! 🔱 \n\nhttps://t.co/UZ3e9rnqBW","date":"Mon May 02 01:00:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPhysics professor Siddharth Karkare is part of a research 'Dream Team' that is developing next generation \"Brighter-Beam\" lasers. \n\nhttps://t.co/ty8UKJuW0C","date":"Sun May 01 23:00:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A team of ASU scientists, lead by @ASU_SMS and @SESEASU's Everett Shock, are studying microorganisms on Earth to gain insights into life on other planets. 🪐 \n\nhttps://t.co/NlglRu518X","date":"Sun May 01 21:00:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU Researchers are helping people, robots and AI interact more safely and effectively. \n@ASU's 'GHOST' lab, a new scientific test bed that doubles as an art installation, helps researchers examine people’s ability to work with robots and AI. 🤖 \n\nhttps://t.co/3j6Mvo9TOA","date":"Sun May 01 18:00:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#CollegeSigningDay is today! \n\nWe are so excited to welcome all of our #futuresundevil students! 💛 😈\n\nhttps://t.co/JnGvLtP6og","date":"Sun May 01 15:00:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It’s not about where you start — it’s where you end up.\nPersistence leads two ASU graduates to win prestigious scholarships for their graduate studies. Congratulations! 🔱 \n\nhttps://t.co/ucsYRwvtjW","date":"Sun May 01 00:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering Center for Efficient Vehicles and Sustainable Transportation Systems (EVSTS) has been awarded funding by @NSF to research vehicle energy efficiency and sustainability. 🚗 \n\nhttps://t.co/Gj0FEBrytc","date":"Sat Apr 30 22:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUTheCollege will recognize its highest-achieving students from the social sciences, natural sciences and humanities at the spring 2022 convocation.\n\nMeet the students that will be awarded the prestigious Dean’s Medal ⤵️ \nhttps://t.co/U3ka4CtYV2","date":"Sat Apr 30 19:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new study by @asuhealth Associate Professor Matthew Buman aims to help you put the phone and remote away. 📱 \n\nhttps://t.co/8EQApLsKs0","date":"Sat Apr 30 17:00:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's 10 days 'til Spring Commencement! 🎓\n\nCelebrate your #ASUgrad by using our graduation toolkit to showcase this achievement online, including on your social media and with your friends and family! 🎉 \nhttps://t.co/gOnu2BrUft https://t.co/1A06sEkUqR","date":"Sat Apr 30 15:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Over 4,000 students and lifelong learners from across the nation have taken part in ASU’s @MissionToPsyche Student Collaborations. 🚀 \n\nhttps://t.co/FmpR60t1gB","date":"Sat Apr 30 00:00:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUDesignSchool students took to the streets of central Phoenix to show their support for Ukraine with a painted colorful mural complete with the country's flag colors as well as the country’s symbol, the sunflower. 🌻 \n\nhttps://t.co/8eu9sWcTr3","date":"Fri Apr 29 23:00:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"More: https://t.co/Izi3r3QWKc","date":"Fri Apr 29 21:58:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In a new publication, @ASU_SGSUP assistant professor Sara Meerow and @UArizonaCAPLA  assistant professor Ladd Keith highlight the problems that heat is causing urban communities.\n\nhttps://t.co/JoebHZQX1F","date":"Fri Apr 29 21:00:44 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Congratulations Sun Devils — you made it to the end of the semester!\n\nFinals week is almost here, so make sure to check out all of the the resources available to students through @ASULibraries. \n\n📚 https://t.co/22SFwHMSsa https://t.co/p8YCx1pwAC","date":"Fri Apr 29 19:01:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ICYMI: @ASUPresOffice along with @NAUPresident and @UArizonaPres spoke at an event hosted by @phxchamber. \nThe three university presidents said that the support from the business community is integral to preparing Arizona's future workforce.\n\nhttps://t.co/Yf1zxLh0yy","date":"Fri Apr 29 17:01:30 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"People all across the world celebrated #EarthDay in many ways. \n\nSun Devils spent their Earth Day cleaning up the Rio Salado river.  🌎\nhttps://t.co/vnK0lJA2qs","date":"Fri Apr 29 15:01:48 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU Native American student Shundene Key was recently awarded a @NSF Graduate Research Fellowship Program grant funding her work on surface proteins in the immune system.\n\nCongratulations! 🔱","date":"Fri Apr 29 02:00:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych Rishika Shah conducts research in four different labs, conducting her thesis on \"depression and social support in military populations.\"\n\nRead more about her research and thesis: https://t.co/igKPahOI9p","date":"Fri Apr 29 00:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU's new online Master of Arts in international affairs and leadership program comes from a partnership between @ASU_SPGS and the newly launched @asu_ldns.\n\nhttps://t.co/AvT4QUIYpi","date":"Thu Apr 28 22:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"At a recent gathering of ASU-affiliated media, Mi-Ai Parrish, managing director of the ASU Media Enterprise,  spoke on the goals and growth of this endeavor.\n\nhttps://t.co/fCnvZVyFrg","date":"Thu Apr 28 20:01:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUTheCollege, @ASUMathematics Professors Abba Gumel and Rosemary Renaut have been announced as 2022 class of SIAM Fellows by @TheSIAMNews. \n\nCongratulations! 🥳 \nhttps://t.co/cqmlHpUFbz","date":"Thu Apr 28 18:01:51 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Jessica Hirshorn, principal lecturer in leadership and integrative studies at @CISAASU, had seen first hand what the people of Ukraine needed during this time of crisis. \nSo, she got to work on doing what she could to help. 💛\n\nhttps://t.co/opXvVUincb","date":"Thu Apr 28 16:03:18 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As you get to the middle of finals week, take good care of yourself and spend the time you need to study, sleep, move and eat in a way that supports your success and well-being. \n\nhttps://t.co/nzS2sImVM7 https://t.co/bLMIXvCjfV","date":"Thu Apr 28 01:00:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU alumna Demi George couldn't find a swimsuit that fit right. So she designed one and launched her own swimwear business, @shopheartglass 🩱\n\nhttps://t.co/Dde0FhgG7A","date":"Wed Apr 27 23:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"How and why do new diseases emerge? \n@ASUBeingHuman Regents Professor Anne Stone posed this question to @GuggFellows and has been awarded a 2022 Guggenheim Fellowship to pursue the answer.\nCongratulations! 👏\n\nhttps://t.co/gyG2ZLt9PG","date":"Wed Apr 27 21:00:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU has been recognized as a global leader in sustainability efforts, coming in second in the world and first in the U.S. in the @timeshighered Impact Rankings released Wednesday.","date":"Wed Apr 27 19:20:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@arizonapbs and @Cronkite_ASU are hosting a dynamic event April 30 at 7 p.m featuring @HenryLouisGates, who will offer exclusive insights on the discovery process for celebrity guests of #FindingYourRoots — his successful @PBS series!\n\nTicket info: https://t.co/wBj2zYGqNz https://t.co/JvL6tPwIz4","date":"Wed Apr 27 17:01:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In the coming years, around 22 million new project management jobs are expected to open around the world. This certificate, offered through @ASU in partnership with @Pathstream, can help you increase your earning potential in 2022.","date":"Wed Apr 27 15:00:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering students taking the Embedded Systems Design Project II course, EGR 314, have the unique opportunity to see what their engineering future holds through mentorship from industry professionals who took the same course as ASU students.\n\nhttps://t.co/xvy36ofsts","date":"Wed Apr 27 01:30:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Will fire season start earlier this year due to climate change? Or is 2022 a fluke?\n\n@asuSOLS environmental historian Stephen J. Pyne talks with @asunews to answer these questions. \nhttps://t.co/a0Pw4BGapX","date":"Wed Apr 27 00:01:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Jack Waddell, an @ASUPsych doctoral student, has received a grant from @NIH to study the negative outcomes associated with the co-use of alcohol and cannabis. \n\nhttps://t.co/ZcJczZ0Nho https://t.co/phVBrZJGyD","date":"Tue Apr 26 22:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@LWFONSA has announced that a record high 1️⃣3️⃣ students have been selected for the DAAD Rise award! The program offers summer research internship opportunities for undergraduate students in Germany!\n\nhttps://t.co/Z6oej2raI5","date":"Tue Apr 26 20:01:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@smithsonian Secretary Lonnie G. Bunch III (@SmithsonianSec) and former Arizona Supreme Court chief Ruth V. McGregor will be speaking at the upcoming #ASUgrad commencement ceremonies. They will both also receive honorary degrees. \n\nhttps://t.co/2efluJ13pJ","date":"Tue Apr 26 18:01:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU students have been instrumental in creating a new imaging tool. The world's first compact x-ray free electron laser (CXFEL for short) will help researchers explore the structure and dynamics of nature like never before.\n\nhttps://t.co/n5gJOcsNZl","date":"Tue Apr 26 16:02:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"From T-shirt designers to chemistry students, this year's #ASUgrad class has students from all backgrounds who have excelled during  tumultuous times to shine next to their peers.","date":"Tue Apr 26 01:08:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"📣 Registration is now open for Sun Devil Kids' Camps! \n\nIf you have youngsters or teens ages 5-15, Sun Devil Kids’ Camp is the perfect option for kids interested in STEM-focused activities, arts and crafts, swimming lessons and more.\n\n📅 Check out the full schedule:","date":"Mon Apr 25 23:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@USDOT @SecretaryPete Buttigieg joined ASU’s @FutureTenseNow for a conversation about infrastructure and imagination. https://t.co/DkhGjKQHFs","date":"Mon Apr 25 21:00:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"After decades of service to the ASU community, @ASU_SPGS Advisory Board members Herb and Laura Roskind's latest gift creates new opportunities for students. https://t.co/onobFI4KXe","date":"Mon Apr 25 19:01:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Afghan students transition to life as Sun Devils while keeping sight on restoring their homeland. https://t.co/vYGZOECyK6","date":"Mon Apr 25 17:01:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In a new study about malaria-prevention techniques,  @evmedasu assistant professor Krijn Paaijmans and his colleagues show that day-to-day household practices and additional construction can reduce treatments' effectiveness over time. #WorldMalariaDay 🦟\n\nhttps://t.co/0hpRWn2Z2F","date":"Mon Apr 25 15:02:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Stay ahead of the pressure of midterms, finals and final projects by taking a little time each day to rest, recharge and reconnect. 🧘 \n\nResources to help you achieve balance in your life: https://t.co/ELSBNXhNQt https://t.co/X8Td31hk8q","date":"Mon Apr 25 00:00:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Come Together and experience the world’s most iconic band with RAIN – A TRIBUTE TO THE BEATLES April 27 at @ASUGammage!  @RainTribute 🎶","date":"Sun Apr 24 21:06:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Renowned choreographer, performer, writer and @ASU_MDT's Institute Professor Liz Lerman will be presenting a virtual FRANKx Lecture on Wednesday, April 27.","date":"Sun Apr 24 18:00:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's starting to look a lot like commencement season! 🎓\n\nCheck the latest ceremony schedule here 📲: https://t.co/6H8LCQAz6a\n\nPictured:\n\n📍 ASU 2022 sign outside Old Main, ASU's Tempe campus. \n\n📍 #ASUgrad banner at Fulton Center,  ASU's Tempe campus. https://t.co/NlOUpeIQJL","date":"Sun Apr 24 15:00:53 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ASUgrad ceremonies are almost here! 🎓\n\nIf you need a primer on how to prepare for commencement or convocation, check out the video below ⤵️ https://t.co/b7Uw34anSu","date":"Sun Apr 24 01:00:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Three @asuSOLS students have been named 2022 Graduate Research Fellows by the @NSF. \n\nCongratulations! 🔱\nhttps://t.co/u8ZP1PjGtM","date":"Sat Apr 23 22:00:28 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#EarthDay 2022 might be over, but at @ASUTheCollege, there are ways to continue learning about what makes our Earth so great (and how to help her) year-round. 🌎 https://t.co/fXRWeGno5I","date":"Sat Apr 23 19:00:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Did you know there are 27 varieties of palm trees on the Tempe campus?\n\nIn addition, there are hundreds of varieties of trees, flowers and shrubs just on the Tempe campus alone. Find more information on the botanical collections and their location with ASU’s online guide ⤵️","date":"Sat Apr 23 16:02:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new process being developed by @ASUEngineering professor Chao Wang enables color printing on a microscale, which could open new avenues for color printing on surfaces such as flexible displays and wearable optical devices. \n\nhttps://t.co/3cE1nHOn71","date":"Sat Apr 23 02:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"On April 23, join @942Crew, the Sun Devil Marching Band, the ASU Spirit Squad and @SparkySunDevil for ASU night at the @ArizonaCoyotes! \n\nAll ASU students get a special upper level ticket of $15.00 with no fees. Use code word: Sparky.","date":"Sat Apr 23 00:07:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych has unveiled the naming of the Robert B. Cialdini Social Psychology Laboratories, in honor of @RobertCialdini, an ASU professor emeritus of psychology and marketing who has given 51 years of service to the university. https://t.co/jrGfozkBoO","date":"Fri Apr 22 22:00:56 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Former U.S. Vice President @algore spoke virtually at the 2022 Democracy and Climate Change Conference, hosted by @ASUTheCollege for #EarthWeek. 🌎 https://t.co/6AjcTOel4i","date":"Fri Apr 22 20:30:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASULandArch alumna @MicheleShelor, who co-owns @colwellshelorLA, took part in redesigning the area to incorporate many elements of sustainability. (7/7) \n\nRead more about this project: https://t.co/llEUdUJnpP","date":"Fri Apr 22 18:13:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"This used to be a road for vehicles. Now, it’s a space for students to connect or relax. \n\nThe lower levels, called bioswales, create a natural system to clean and control campus stormwater runoff while helping grow a desert oasis. 🌴 (6/7) https://t.co/IFaqfYjvWE","date":"Fri Apr 22 18:13:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"This may look like a hallway or office space but it’s actually a rooftop terrace with the perfect overhead view of Orange Mall. The shade for this area comes from the solar panels overhead. ☀️  (5/7) https://t.co/t1uTUlJsro","date":"Fri Apr 22 18:13:39 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"At least 400 students, faculty and staff can sit and relax in this area. The plants create a natural cooling effect and the terraced steps provide seating near a rain garden for mental restoration. 🧘 (4/7) https://t.co/lJu5wZK1Z7","date":"Fri Apr 22 18:13:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"These suspended brass pipes represent stalactites in Arizona caves. They use condensation from air conditioning units on the roof to water plants, repurposing as much as 1,000 gallons of water. 💧 (3/7) https://t.co/5qWNBqWpXZ","date":"Fri Apr 22 18:13:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"This bioretention garden is the largest basin and last stop for stormwater. It helps prevent flooding on campus — as much as a 25-year storm’s worth! (2/7) https://t.co/jxP3rMR2Fc","date":"Fri Apr 22 18:13:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"🧵 For this #EarthDay, take a photo tour through the recently redesigned Orange Mall at Student Pavilion on @ASU's Tempe campus — a project earning SITES Silver and LEED Platinum certification.  (1/7) https://t.co/2KEgcKwzJv","date":"Fri Apr 22 18:13:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Pat Tillman Veterans Center, the annual Pat Tillman Run and @ASUFootball's tradition of touching his statue as they run out onto the field before each home game are some of the examples of how we are keeping his memory alive every day. https://t.co/HtsH1ROmzi","date":"Fri Apr 22 16:03:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"On April 22, 2004, we lost an exceptional Sun Devil: Pat Tillman. \n\nToday we remember Pat Tillman and his legacy of service. https://t.co/BPwHFDKRA0","date":"Fri Apr 22 16:03:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Alex Thien, @ASU_SPGS' alumnus is aspiring to cultivate change through his current position in the @StateDept Office of Science and Technology Cooperation.\n\nhttps://t.co/ADUbUD1txX https://t.co/DCPxOGPjn7","date":"Fri Apr 22 02:30:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Pat's Run returns this Saturday, April 23rd. 🏃\n\nHere's everything you need to know regarding this year's event: https://t.co/x5pxLWsE9T\n\nvia @abc15.\n\n📸: 2019 https://t.co/Xji8FmpXz8","date":"Fri Apr 22 00:30:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_Alumni honored 160 current and former student government leaders at its annual Affinity Reunion! \nFor the first time since 2020, alumni were able to reconnect with colleagues and network with new generations of Sun Devils!\n\nhttps://t.co/QJVsQvQ3bZ","date":"Thu Apr 21 20:30:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Andrew Dana Hudson wrote a novel based on his masters thesis while at @ASU_SOS. Now, his novel is being published and @asunews spoke with him about the novel, climate change and speculative fiction. \n\nhttps://t.co/0IdArh5jcY","date":"Thu Apr 21 20:01:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering profesor Samuel Ariaratnam has been appointed to the @USDOT pipeline advisory committee to help ensure the pipelines through which important resources are moved stay up and running across America. Congratulations! 👏\n\nhttps://t.co/pwt7PLgzW1","date":"Thu Apr 21 18:30:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Rio Reimagined #EarthDay Cleanup Event will take place this Saturday, April 23rd, from 8:30-10:30am and is looking for volunteers!\nThe cleanup will include opening remarks from Mayor Kate Gallego and Councilwoman Yassamin Ansari.\n\nFor more info ⤵️\nhttps://t.co/bmdqBaWhfE","date":"Thu Apr 21 16:30:14 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Gabriel José Bolaños, assistant professor of composition in @ASU_MDT has received a $5,000 yearlong grant and the 2022 Suzanne and Lee Ettelson Composer's Award!\n\nCongratulations! 👏\nhttps://t.co/wd6f2vYWsK","date":"Thu Apr 21 02:00:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"For the sixth consecutive year, ASU has been ranked as a top producer of educators by @TeachForAmerica. 📚\n\nhttps://t.co/4Xjy4K1kcC https://t.co/dkqQmwlQ5c","date":"Thu Apr 21 00:01:10 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU students Hiram Bowen, Lakota Kinlicheenie and Shaandiin Parrish have relaunched the Native American Business Organization in an effort to foster community and provide networking opportunities.\n\nhttps://t.co/QhHaFqfkwd https://t.co/qp65y7bYDh","date":"Wed Apr 20 22:01:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUBeingHuman professor Abigail York says climate change isn’t a one-solution-fits-all problem — but there are multiple reasons to be hopeful for the future. 🌎 💚\n\nhttps://t.co/RqTiHm7hCs","date":"Wed Apr 20 20:01:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych undergraduate students recently presented their honors thesis to a committee of external examiners, competing for the title of \"Best Undergraduate Honors Thesis.\"\n\nFor more info ⤵️\nhttps://t.co/sZHvvvCfZp","date":"Wed Apr 20 18:01:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"We are halfway through #EarthWeek, and there's still a lot to come!\nCheck out our blog for more #EarthWeek coverage. 🌎\n\nhttps://t.co/B8W56om1CA","date":"Wed Apr 20 16:02:48 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The newest addition to @ASU’s Tempe campus has a new name: The Rob and Melani Walton Center for Planetary Health.\n\nRead more about how Rob and Melani Walton have made a long-term commitment to ASU and sustainability solutions: https://t.co/N3k9MoUfkT https://t.co/7MPuMiUtNW","date":"Wed Apr 20 01:10:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As the Spring semester winds down, you might feel that you need a good method for managing your time.\nIf so, check out these three strategies from #ASUAdulting to help you with this task. ✔️\n\nhttps://t.co/cKlNizuOth https://t.co/H3NsSvAB7o","date":"Tue Apr 19 23:00:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A panel discussion about homelessness featured speakers reflecting on a new @MorrisonASU report in an effort to create effective solutions. \n\nhttps://t.co/5wfcAusJBy","date":"Tue Apr 19 21:00:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In a new study published in @ASMicrobiology journal, @ASUBiodesign researchers explore how the byproducts of microbial communities in landfills, primarily carbon dioxide (CO2) and methane, could be the converted into electricity and fuels.\n\nhttps://t.co/7rIQ0rOb1L","date":"Tue Apr 19 19:01:13 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The first commercial-scale \"MechanicalTree\" has been installed on the Tempe campus! The device will collect carbon from the atmosphere, in an effort to combat climate change. #ASUInnovation\n\nhttps://t.co/d3J2yOiRcw","date":"Tue Apr 19 17:01:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Want to join in the fun of #EarthWeek2022 with @ASUGlobalFuture? Get the full schedule of events here: https://t.co/lrYFIuXeic\n\nTune in to the livestream of all the events at the link below. ⤵️\nhttps://t.co/G3jtCmkQpk https://t.co/yFbsvwuZ8T","date":"Tue Apr 19 15:01:55 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU's 2022 Spring Dance Fest will feature world premieres of new dance works produced by @ASU_MDT students.\n\nTimes, dates and ticketing info can be found below. \nhttps://t.co/p2YkGQIBJN","date":"Tue Apr 19 02:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Matthew Adkins, an @ASUEngineering grad student has landed a job working at the Advanced Development Program of @blueorigin. Congratulations! 👏\n\nhttps://t.co/eoSYqjCQ45","date":"Tue Apr 19 00:01:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Pat Tillman Veterans Center hosted a panel on April 12th featuring Senator Mark Kelly on mental health and the military. \nThe panel spoke on military suicide and the new Brandon Act, recently passed legislation introduced by Senator Kelly.\n\nhttps://t.co/XkOL6Rje1V","date":"Mon Apr 18 22:00:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"An ASU research team has developed the first-of-its-kind study that combines conservation with practical economic tools for a case study of Colombia. 🇨🇴\n\nhttps://t.co/MZnejQRQIH","date":"Mon Apr 18 20:01:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@ASUSocialWork will offer fully synchronous degree programs in Social Work starting this Fall. This will increase access to the programs for those who cannot attend on campus full-time.\n\nhttps://t.co/kgCiFPrrkF","date":"Mon Apr 18 17:01:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Presented by @ASUTheCollege, the \"2022 Democracy and Climate Change Conference\" will take place April 19-20 with keynote speaker, former Vice President @algore.\n\n🗓 Full schedule: https://t.co/jNpNwwHC96\n🖥 Livestream link: https://t.co/JtoEjY1PuL https://t.co/HF95dLejNl","date":"Mon Apr 18 14:02:13 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SESEASU Assistant Professor Daniel Jacobs has been selected to receive the prestigious Faculty Early Career Development program award.\n\nCongratulations!  👏\nhttps://t.co/jbDa6HNwZQ","date":"Mon Apr 18 00:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The 18th annual @ASUPhysics Undergraduate Physics Symposium had 16 incredible student presentations, with four awards given to show excellence within the department! \n\nRead more ⤵️\nhttps://t.co/QqLwGHpuvC","date":"Sun Apr 17 21:00:22 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In partnership with @EdEquityLab and @awscloud, @WPCareySchool and @ASU_UTO are working to co-deliver a course on the foundations of #CloudComputing to high school students. 🌐\n\nhttps://t.co/UAg9TIPY6Y","date":"Sun Apr 17 18:00:52 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Laura Ackerman-Biegasiewicz, professor in @ASU_SMS, has been awarded the 2022 Distinction of Merit and Scholastic Occupation teacher award! This award is given by the Student Affiliates of the American Chemical Society. \n\nhttps://t.co/NyK4LdeAsi","date":"Sun Apr 17 15:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @barretthonors' student-led @azmicrocredit is entering its 11th year as a nonprofit, assisting underserved entrepreneurs to start or expand business ventures!\n\nhttps://t.co/aQlUVFSbhe","date":"Sun Apr 17 02:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In honor of #EarthMonth @asu_usp and @ZeroWasteASU are commissioning local artists to make chalk art on three different Tempe campus locations! \n\nFor locations and more information ⤵️\nhttps://t.co/HCKUuEYJfC https://t.co/dS94OUpgPV","date":"Sat Apr 16 23:00:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The REACT clinic on @asuwestcampus is a student-led partnership with @MayoClinicSOM designed to help refugees navigate the health care system.\n\nhttps://t.co/zetrafWzTV","date":"Sat Apr 16 20:00:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU's Center for Education Through Exploration has announced the launched of \"Infiniscope\" 2.0, the next generation of the Nasa-funded K-16 digital learning platform. \n\nhttps://t.co/6INJz5h19z","date":"Sat Apr 16 16:01:18 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#WebAccessibility and inclusivity efforts by @ASU_UTO have led to screen readers being now compatible with an ASU portal for Sun Devils. 🌐 \n\nhttps://t.co/3qMxtOlMT5","date":"Sat Apr 16 01:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@AZRegents awarded $3.1 million in research funding to The Valley Fever Collaborative in a statewide effort to identify, characterize and map hotspots. \n\nhttps://t.co/yuVj0XjskR","date":"Fri Apr 15 23:00:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Masha Gessen, Russian journalist and speaker at @ASUSST's John P. Frank Memorial Lecture, discussed fears regarding the conflict in Ukraine. \n\nhttps://t.co/1BNEbpLlpb","date":"Fri Apr 15 21:00:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUGlobalFuture, @asu_csrc and the Narrative Storytelling Initiative launched the first-of-its-kind Climate Narratives Prize, which will be awarded on Earth Day at an event titled \"Hope, Alarm and Climate Change\". 🌎\n\nhttps://t.co/gIJHT1bZOo","date":"Fri Apr 15 19:01:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Orange Harvest at @ASU has started! If you'd like to volunteer to spend time in the citrus farm picking and sorting oranges, you can join in tomorrow, Saturday April 16th from 8am-10am.\n\nRSVP to volunteer below. ⤵️\nhttps://t.co/XfFOvc2DSO","date":"Fri Apr 15 17:01:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@arizonapbs, @ASUGammage and @Cronkite_ASU will host a dynamic event \"Past Connections That Bind Us All: A Conversation with Henry Louis Gates Jr.\" on April 30 at 7 p.m. at Gammage! \n\nFor ticket information ⤵️\nhttps://t.co/ilhr1R2WMg","date":"Fri Apr 15 15:02:16 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPhysics Assistant Professor Antia Sanchez Botana is on a quest to find new materials that could lead to the next innovation wave.\n\nhttps://t.co/X700yFr6Ca","date":"Fri Apr 15 02:00:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Why some people become addicted and others don’t, and why some can quit and others cannot, is a major focus of addiction research.\nNew @ASUPsych professor Jonathan Gewirtz is working to untangle genetic contributors to opioid vulnerability.\n\nhttps://t.co/D1pid9WFGY","date":"Fri Apr 15 00:01:14 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Cronkite_ASU has launched a graduate partnership with the @najournalists and @IndianCountry to support an outstanding NAJA member to pursue a masters degree. \n\nhttps://t.co/RKdB8Yii0M https://t.co/4o2C8Ar5v4","date":"Thu Apr 14 22:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Award-winning Broadway musical show @hadestown comes to @ASUGammage April 19-24! 🎭\n\nFor more info ⤵️\nhttps://t.co/D6yT36uzsx","date":"Thu Apr 14 20:01:27 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUSILC held its annual Language Fair, showcasing the over 2️⃣0️⃣ university language programs to prospective students from high schools across Arizona. 🔱\n\nhttps://t.co/V8PnbMYqnh","date":"Thu Apr 14 18:01:53 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Four #SunDevils have been nominated for the Udall Undergraduate Scholarship! This federal fellowship highlights sophomores and juniors who show commitment to issues regarding Native American nations or environment. \n\nhttps://t.co/TGnGcE81e3","date":"Thu Apr 14 16:03:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The tenth annual Pitchfork Awards are happening next week! Mark your calendars for April 21 as we celebrate students, organizations and events that make an impact at @ASU.\n\nhttps://t.co/LKYjFE2eSg https://t.co/NmsBZXs63o","date":"Thu Apr 14 01:00:44 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"On April 20th @FutureTenseNow is hosting a conversation with Secretary of Transportation @PeteButtigieg and three Future Tense Fiction authors about the future of transportation and the role of imagination in policymaking. \n\nhttps://t.co/q2P7BnR6Dd","date":"Wed Apr 13 23:00:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The Narrative and Emerging Media program, a collaboration between @ASU_filmschool and @Cronkite_ASU, welcomes award-winning British director Mary Matheson as professor of practice! 🎥\n\nhttps://t.co/ZWCFe8gdZ9","date":"Wed Apr 13 21:00:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"From @FrozenBroadway to @ANNIEonTour and @hairsprayontour, @ASUGammage's 2022-23 season is going to be a great one! 🎭 \n\nCheck out all the upcoming shows, dates and how to get tickets here: https://t.co/Igo7oelhcT","date":"Wed Apr 13 19:01:22 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's a movie that's been called \"ahead of its time.\"\nThe 1973 film showed a bleak, dystopian future — a future taking place in 2022.\nNow, @ASU professors across multiple colleges and schools are discussing which elements of \"Soylent Green\" ring true today.\nhttps://t.co/imbhNlVNL3","date":"Wed Apr 13 17:01:48 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUHIDA industrial design seniors Meng Jye Lin and Abbie Cheng have created interactive installations to showcase the partnership between ASU and the Cox Connected Environments Collaboratory.\n\nCheck out their \"Instagram worthy\" designs below. ⤵️\nhttps://t.co/ltGa0XXOgX https://t.co/5w1QKXtCQo","date":"Wed Apr 13 15:02:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUSocialWork students are filling the need for more social workers in a new program that combines hospital social work and mental health services training.\n\nhttps://t.co/xomCLvLcH6","date":"Wed Apr 13 02:00:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"📣 Calling all students 📣 \nTomorrow from 6-10 p.m., the Labriola Center is hosting a Lo-Fi Study Session with @apetight [apǝˌtīte] from the Salt River Pima-Maricopa Indian Community who will be providing a deejay/beat set in Hayden Library.\n\nhttps://t.co/cseJzoKLc0","date":"Wed Apr 13 00:01:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"\"The biggest advice I can give is if that's what your dream is, do what you can to make it happen\".\n\nMeet the women of @SunDevilHockey. 🏒\nhttps://t.co/MdDAMCJyGY","date":"Tue Apr 12 22:00:59 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A pitch-style event co-hosted by @ASU and @MayoClinic allowed eight companies to present their ideas to address gaps in health care. \n\nLearn more about these companies, their pitches and who won the competition: https://t.co/YhpRiueBV8","date":"Tue Apr 12 20:01:19 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#ChangeTheWorld 2022 highlights the great work hundreds of Sun Devils are doing collectively to improve our planet and our communities. \n\nThe next great idea is ready to be discovered: register your project or idea and attend an on-campus event ⤵️ \nhttps://t.co/JYoQVBuZmT https://t.co/GaKMQhocNx","date":"Tue Apr 12 18:01:48 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Thunderbird celebrated the grand opening of its new headquarters in honor of the school's 75th anniversary. 🎉\n\nhttps://t.co/t5X3l5djE9","date":"Tue Apr 12 16:02:36 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Conservation biology and ecology @barretthonors student, Sydney Lewis will be getting hands-on experience on the field of environmental conservation with the Doris Duke Conservation Scholars Program. \n\nCongratulations, Sydney! 🎉 \nhttps://t.co/fp50f6FUDo","date":"Tue Apr 12 01:00:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@worldagainstjos @TastingHistory1 Thanks for the update! We will let the writing team know... and congratulations! 👏🎉","date":"Mon Apr 11 23:05:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@PoetryInAmerica is coming to Phoenix for the first ever live experience on April 13th. The event will host an all-star ASU faculty guest lineup including distinguished professor Elisa New, who is also the host of the TV show.\n\nGet event details below. ⤵️\nhttps://t.co/lEuhkph8HN","date":"Mon Apr 11 23:00:40 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Two @ASU researchers'  study examining wastewater facilities in 129 countries is the first to evaluate the feasibility of using this tool to measure progress on @UN sustainability goals. 💧\n\nhttps://t.co/KXE9wOdx9g","date":"Mon Apr 11 21:00:49 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Mark your calendars for Earth Week! 🌎 Earth Week begins next Monday, April 18th hosting discussions, the  ISTB7 building dedication and an #EarthDay cleanup. \n\nGet the full list of events here: https://t.co/DXzQh1dZDk","date":"Mon Apr 11 19:01:17 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asunursing is using the \"team model\" approach in an effort to better educate nursing students and make them more attractive job candidates after graduation.\n\nStudents, instructors and local health facilities say they're already seeing the benefits. 🩺\nhttps://t.co/iikEDTth9Q","date":"Mon Apr 11 17:01:52 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"An interdisciplinary research team at @ASU is developing \"SUEDE\" Shoes. SUEDE (or Smart User-Effective Data-Enabled), is a wearable smart shoe system to actively support the ankle without hindering natural motion.\n\nhttps://t.co/oufh4e8HsX","date":"Mon Apr 11 15:02:50 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU faculty member David Sailor of @ASU_SGSUP has been selected for @ACEducation's Fellows Program.\n\nCongratulations! \nhttps://t.co/bnOJh7qdq5 https://t.co/8h0Gofw9Si","date":"Sun Apr 10 23:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In a new study, researcher Qiyun Zhu and his colleagues at @asuSOLS are developing a new method for probing the microbiome in extraordinary detail. \n\nhttps://t.co/GZcJ8tocDi","date":"Sun Apr 10 21:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Assistant Professor Anita Botana has been selected for a chair of excellence position at Laboratoire d’Alliances Nanosciences-Energies du Futur (LANEF), where she will co-advice students for three years. \n\nCongratulations!\nhttps://t.co/aWz7aMs3iJ","date":"Sun Apr 10 19:00:35 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @ASU_LX team helps faculty integrate a growing suite of tools into their classrooms for increased communication, deepened collaboration and more. 💻\n\nhttps://t.co/wbeDgmoPKy","date":"Sun Apr 10 16:01:07 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A team of researchers, led by Aditya Khuller of @SESEASU and Laura Kerber of @NASAJPL, are examining the ridge networks found on Mars in search of records of ancient groundwater on the planet. \n\nhttps://t.co/C2i09SauKN","date":"Sun Apr 10 02:00:20 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuhealth's Center for Health Information and Research has named health economist and researcher Marisa Domino as their new director.\n\nhttps://t.co/3XilgkbNqF https://t.co/dFnki8u0Xx","date":"Sun Apr 10 00:00:24 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Eric Cylwik participated in the @ASU_Alumni Leadership Institute back in 2019 as a senior virtual construction engineer at Sundt Construction. \nNow, he's director of innovation and is working to create opportunities for his community to thrive. \n\nhttps://t.co/XYJvUsTm01 https://t.co/cZHmsXMbfC","date":"Sat Apr 09 22:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Kimberly Marshall, the Patricia and Leonard Goldman Endowed Professor of Organ in @ASU_MDT, has been awarded the Medal of the Royal College of Organists, the organizations highest honor. Congratulations! 🎶\n\nhttps://t.co/VkBDiiX2ak","date":"Sat Apr 09 19:00:44 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"We're one month away from ASU Spring 2022 Commencement ceremonies, and we can’t wait to celebrate our new graduates!  \n\nCheck out https://t.co/cOPMo8FfUs for any questions you might have about the ceremonies.\n\nCongrats #ASUgrad! 🎓","date":"Sat Apr 09 17:00:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The goal: to create #COVID19 tests that allow people to detect early infection so that when they gather, they can gather with confidence.\n\nhttps://t.co/O8rEsxEDWE","date":"Sat Apr 09 02:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Student athletes at @ASU keep up with sports and school which means they stay busy. The new Watts Center for Academic Excellence and Championship Life gives student athletes the resources and support they need to succeed. 🔱\n\nhttps://t.co/sGfqkXSu8N","date":"Sat Apr 09 00:00:47 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Father Patrick Desbois, an author and founder of Yahad-In Unum (Together In One), a non-profit organization dedicated to discovering genocidal practices, spoke Monday as part of @ASU_SHPRS' Genocide Awareness Week.\n\nhttps://t.co/pAyDP37h6Y","date":"Fri Apr 08 22:00:51 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"On April 13, John Tomasi, inaugural president of @HdxAcademy, will present a lecture titled \"Is the Goal of the University to Pursue Knowledge or Social Justice?\" \n\nYou can attend in person, or stream it live — more details: https://t.co/DdsVzpu1hN","date":"Fri Apr 08 20:01:13 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The 3-day Latin Sol Festival at @ASU brought together students, dance instructors and the community as a whole. Attendees were welcomed to workshops, panel discussions and social dances. 💃\n\nhttps://t.co/kxIxVKapWf","date":"Fri Apr 08 18:01:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU alumnus Max Miller went from working at Disney to being furloughed due to COVID-19 to having his own YouTube show, #tastinghistory, which boasts 600,000 subscribers! 📈\n\nCheck out how Max made this career pivot and his tips for success in any endeavor.\nhttps://t.co/yNbQSezq9H","date":"Fri Apr 08 16:03:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUPsych Dean's Medalist Cora Baron aims to understand conflict management in romantic relationships through four different research labs.\n\nhttps://t.co/O7ZD1JiNU3","date":"Fri Apr 08 01:03:42 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @NCSESgov has ranked @ASU no. 21 in the nation for the number of recipients of research doctorates, beating out University of Arizona, University of Pennsylvania and Duke University. 🔱\n\nhttps://t.co/gkciP5dekV https://t.co/h7O4lb8J7b","date":"Thu Apr 07 23:05:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @asugsvsummit, a collaboration between @ASU and @GSVteam, kicked off on Monday and covered topics like k-12 education, higher learning, technology, culture and so much more.\n\nCatch up on all the topics and get to know all the incredible speakers: https://t.co/NG5yCRmDyL","date":"Thu Apr 07 21:00:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@ASUGammage 😍😍😍","date":"Thu Apr 07 20:02:21 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In the 2021–22 academic session, nearly 120 student-athletes are part of the group placing ASU among Forbes’ top five American universities awarding the most science, technology, engineering and math undergraduate degrees to students in 2021. https://t.co/rAaRFqxE7d","date":"Thu Apr 07 19:09:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @NCAA recently announced @TheSunDevils’ all-time high 92% student-athlete Graduation Success Rate (GSR). \n\nThey’ve maintained or surpassed an all-time best GSR yearly since 2008 and are tied for third in the @pac12  Conference. https://t.co/J4ikRVORPA","date":"Thu Apr 07 19:09:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@SunDevilBeachVB #8, Kate Fitzgerald, is an Arizona native on the honor roll studying biomedical sciences at ASU. After graduating, she hopes to work as a nurse in a NICU unit. https://t.co/DpYVkA4zYc","date":"Thu Apr 07 19:09:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The data shows Sun Devils don’t choose between athletics and academics. They excel at both, breaking records with an all-time high Graduation Success Rate of 92%. Congrats @TheSunDevils and Go Devils! #ForksUp https://t.co/gB3P7KcE4O","date":"Thu Apr 07 19:09:56 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Thunderbird has opened its state-of-the-art global headquarters, with grand opening and 75 year anniversary celebrations occurring until April 10! #Tbird75\n\nFor more information ⤵️ \nhttps://t.co/bDDLmQ7z1z","date":"Thu Apr 07 17:02:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU student and Interfraternity Council President Nicolas Khonaysser is pursuing leadership opportunities to impact students and the community in a positive way.\n\nhttps://t.co/mKMCR8pTT4 https://t.co/lg1zPMtUab","date":"Thu Apr 07 15:02:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"May Busch, executive-in-residence in @ASUPresOffice, says to avoid the three C's in your career: comparison, competition and conflict. \n\nLearn when to avoid these three C's and when to use them to grow. ⬇️\nhttps://t.co/lTpPdQYerU","date":"Thu Apr 07 00:01:00 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Stay ahead of the pressure of midterms, finals and final projects by taking good care of yourself and spending the time you need to study, sleep, move and eat in a way that supports your success.\n\nFind supportive resources here: https://t.co/z1iHNfqTSF https://t.co/sDXWjRqLAm","date":"Wed Apr 06 22:00:53 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new center for research and education is being launched @ASU this month. The Global Center for Technology Transfer will be housed at @Thunderbird but will stretch across @ASUTheCollege, @asupublicsvc and @WPCareySchool.\n\nhttps://t.co/0nHhUGDJg3","date":"Wed Apr 06 20:01:10 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"At a live Q&amp;A session at @ASUinCA in partnership with @Cronkite_ASU, a panel of legal scholars, attorneys and Cronkite School Dean Battinto L. Batts Jr talked about free speech, answering \"Does The First Amendment Still Protect Free Speech?\"\n\nhttps://t.co/GV9wQnKqFw","date":"Wed Apr 06 18:01:34 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"At ASU, teams are focused on advancing high-impact scientific discoveries as we explore Earth, our solar system and the far reaches of the universe. (5/5) https://t.co/2UoXfRCgXK https://t.co/4LKDHwdDX3","date":"Wed Apr 06 17:23:55 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In @SESEASU, a wall of clocks counts down the remaining times for important space missions to launch. ASU scientists and students are engaged in dozens of active space missions. (4/5) https://t.co/2UoXfRCgXK https://t.co/vGDb3niFq5","date":"Wed Apr 06 17:23:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"These are the first successful test images captured by E-THEMIS on the ASU Tempe campus. This technology will help scientists discover warm ice on Europa that can reveal if it harbors conditions suitable for life. (3/5) https://t.co/bzkRPCU6Ij https://t.co/ooyYinWKW8","date":"Wed Apr 06 17:23:53 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Strong scientific evidence suggests a body of water existing on Europa is larger than all of Earth’s oceans combined. @SESEASU’s camera system will give scientists a panoramic view of what lies beneath the moon’s icy top layer. (2/5) https://t.co/bzkRPCU6Ij https://t.co/3d2OlXarW9","date":"Wed Apr 06 17:23:52 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"🧵 Thread: What will we find in an alien ocean? E-THEMIS, a camera led by @SESEASU, will launch aboard NASA’s @EuropaClipper to explore what scientists are almost certain is a vast ocean lying beneath the frozen surface of Jupiter’s moon Europa. #SpaceExploration (1/5)","date":"Wed Apr 06 16:00:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUHIDA students from both @ASUDesignSchool and @ASU_MDT came together to collaborate on the production of “the living’life of the daughter mira.” \n\nThis cross-disciplinary partnership allowed for students to make connections beyond their cohorts. 🎭https://t.co/5Aww637jOx","date":"Wed Apr 06 02:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#EarthMonth isn't the only time @ASUTheCollege is working on climate activism. Learn about the climate-focused projects, courses and initiatives that happen all year round. ♻️\n\nhttps://t.co/36bF3ZhkfL","date":"Tue Apr 05 23:00:42 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asu365CU is commissioning the month-long Banking While Black interactive exhibit, located on the Coca-Coca Sun Deck in Sun Devil Stadium now through Sunday, April 17.\n\nRegister and get more information on the exhibit here: https://t.co/BU4ixzZHZE https://t.co/M7FBWeygPh","date":"Tue Apr 05 21:01:11 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Wendy Boring-Bray was only 16 when she got kicked out of school and told \"you will never become anything.\" Now, Wendy has a Doctor of Behavioral Health from @asuhealth and runs her very own thriving practice. \n\nRead Wendy's story below. ⤵️\nhttps://t.co/HCZgrEkow8","date":"Tue Apr 05 19:01:32 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Whether you're interested in sustainability, global issues, geography or the solar system, here are nine upcoming classes for Fall 2022 from @ASUTheCollege that are all about Earth. 🌎\n\nhttps://t.co/PcSTOBuKSk","date":"Tue Apr 05 17:02:02 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"It's Indigenous Culture Week and the Labriola Center is hosting a series of events for students and the community. This year's theme is “Past, Present, Future… Indigenous Forever” and everyone is invited to join in the festivities. Grab the schedule here: https://t.co/mJOgVvkUoC https://t.co/fSSyRGG6zJ","date":"Tue Apr 05 15:02:29 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asuEnglish Regents Professor Ayanna Thompson recently assisted in casting for the musical \"Suffs\", creating a diverse cast to enhance the message behind the musical. \n\nhttps://t.co/Z850FAESxl","date":"Tue Apr 05 02:00:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Cronkite_ASU will be hosting a panel this Thursday, April 7 titled “On The Clock &amp; In the Media: Race, Hiring and the NFL.\" Panelists include @HermEdwards, @MarvinLewis, @TroyVincentSr and @WCRhoden. \n\nRSVP for this event at the link below!\nhttps://t.co/x8kMph3D5O","date":"Tue Apr 05 00:00:57 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"@alec_mccall13 @NSF @ShuklaLab @brownengin @jdweaverBME Congratulations, Alec! 🎉🔱","date":"Mon Apr 04 23:16:08 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Transfer student Kristina Loen says they are thriving with the online learning environment that allows them to work and pursue school at the same time. \n\nLearn more about Kristina's journey to @ASU. 📍\nhttps://t.co/TnVm0gHZUK","date":"Mon Apr 04 22:00:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"A new podcast presented by @PBS and co-hosted by @ASU's director of @ihr_asu Nicole Anderson, debuted on March 30th and will follow up with an interview with ASU President @michaelcrow on April 6th.\n\nCheck out \"The Futures of Democracy\" below. 🎧\nhttps://t.co/73cifNHj7S","date":"Mon Apr 04 20:01:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Tax-season got you feeling stuck? 😵‍💫😣 \n@ASU accountancy professors are sharing advice and answers for everything you need to know this year. \n\nLearn more here. ⤵️\nhttps://t.co/ZWZrXbPoYY","date":"Mon Apr 04 18:01:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Two @ASU first-year students have won the #RedBullBasement Global Final with their innovative idea for a revolutionary note-taking tool. \nThe duo beat out finalists from 44 other countries and brought the top prize home. Congratulations! 🎉\n\n📸: @RBContentPool","date":"Mon Apr 04 15:00:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUEngineering's Secure, Trusted and Assured Microelectronics Center is aiming to secure the microelectronics supply chain through innovative research.\n\nhttps://t.co/B8BxKQ5NqR","date":"Mon Apr 04 00:00:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"This year's #SunDevilGiving Day wouldn't have been possible without YOU. 💛 \n\nThank you for your generosity! This day received more than 4,300 gifts, beating out last year's 3,700 gifts, and raised more than $825,000 for university programs, student and faculty.","date":"Sun Apr 03 20:00:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Founding Principle of @ASUPrepAcademy at Pilgrim West, Heidi Alexander, details her plans for a new kind of curriculum. ⤵️\n\nhttps://t.co/R6fiSULoq9","date":"Sun Apr 03 18:30:06 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The students of McKenna Brodrick's outdoor survival class were given a close look at iron-age tools by founder of Bluebird's Survival and Ancient Skills School, John \"Bluebird\" Crossman\n\nhttps://t.co/LdV5HEiNfC","date":"Sun Apr 03 16:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"With National Robotics Week beginning today, here is a look into some of the innovating robotics projects @ASUEngineering student and faculty have been involved in! \n\nFor more information ⤵️\nhttps://t.co/PNs0f0BGMW","date":"Sun Apr 03 01:00:26 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The #SunDevil100 Class of 2022 will feature 136 outstanding @ASU_Alumni. This class has combined to create $15 billion in revenues last year, and provides jobs for more than 130,000 people. 🔱\n\nhttps://t.co/8HBBpj1CeJ","date":"Sat Apr 02 22:00:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"As American Indian and Indigenous student enrollment increased, @ASU sought to hire more Native faculty. @chronicle reported on this initiative and its success. \n\nSubscribers can read more about this at the link below. ⬇️\nhttps://t.co/sjW5jtcia5","date":"Sat Apr 02 19:00:41 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Four @barretthonors students have been announced as 2022 Goldwater Scholars by @LWFONSA. \n\nCongratulations on this achievement, Sun Devils! 👏\nhttps://t.co/MGbTliSy3R","date":"Sat Apr 02 16:01:09 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Beat producer and Latin percussionist Samuel Peña has been named the assistant director of the popular music program for @ASU_MDT — congratulations! 🎶 \n\nhttps://t.co/BXTKAIlfoZ","date":"Sat Apr 02 02:00:25 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"The @NASAHubble has detected a star that has existed since the first billion years of the universe.\n At a distance of 12.9 billion light years, it is the furthest individual star ever recorded! ✨\n\nFor more information. ⤵️\nhttps://t.co/vdA2jyIymX","date":"Sat Apr 02 00:00:51 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Famous actor #BruceWillis is retiring due to a speech disorder called aphasia. @asunews chatted with @asuhealth expert Corianne Rogalsky on the disorder that affects more than 2 million Americans.\n\nhttps://t.co/Vut4ElRA9S","date":"Fri Apr 01 22:00:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU alumnus and @Dbacks executive vice president Tom Harris recently spoke to the Economic Club of Phoenix, in an event sponsored by @WPCareySchool, about topics such as life in the front office and team success! ⚾️\n\nhttps://t.co/wpsYX8HSa5","date":"Fri Apr 01 20:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@SESEASU has been ranked number 12 in the nation for earth science graduate programs by @usnews — congratulations! 🎉 \n\nhttps://t.co/1WuimPmzAo https://t.co/RqqyqdF69I","date":"Fri Apr 01 18:01:31 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Happy #EarthMonth, Sun Devils! 🌎\n\nLooking for ways to get involved? Check out all the programs and events happening on and around campus this month. 💛\n https://t.co/zqkhqmNgtw https://t.co/hXFFl2qVaw","date":"Fri Apr 01 16:02:23 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUTheCollege's \"2022 Democracy and Climate Change Conference\" will be taking place April 19-20 with keynote speaker, former Vice President Al Gore.\n\nRSVP: https://t.co/Pt4CH00uuY https://t.co/2WfQ8iWgoW","date":"Fri Apr 01 01:00:49 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Researchers from @ASU_SMS have published a study that examines the use of DNA repair in disease and cancer treatments. 🧬\n\nhttps://t.co/i8rhSi1vfp","date":"Thu Mar 31 23:00:54 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Governor Doug Ducey has selected @ASU alumnus Gregg Brewster to serve on the board of @AZRegents.\n\nCongratulations! 👏\nhttps://t.co/wxWxvhd5RS","date":"Thu Mar 31 21:01:05 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@asupublicsvc has been recognized by @usnews with seven graduate programs in the top ten nationwide, including a first place designation for @CEMHSatASU! 🔱\n\nhttps://t.co/IdDQlkL5tD","date":"Thu Mar 31 19:01:37 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Congratulations to the @ASUTheCollege team, as they take home the win for the 2022 ASU Academic Bowl! 🎉\n\nAlong with bragging rights, the students on the team received a $26,000 scholarship prize! \n\nhttps://t.co/b8zaRMLq6J","date":"Thu Mar 31 17:02:13 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUChildWellBng's fourth annual Children of Incarcerated Parents National Conference's goal is to create more awareness and advocacy for the children impacted by parental incarceration.\n\nhttps://t.co/7o2WC8WnsN","date":"Thu Mar 31 15:02:45 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"During the 2022 Youth Summit at ASU, 50 bright Maryvale High School students teamed up with undergraduate and graduate students, with the goal of improving the life in Maryvale Village for nearly 230,000 Arizona residents. \n\nhttps://t.co/bI7lg08ptS","date":"Thu Mar 31 01:00:38 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASU_MDT has partnered with the @RecordingAcad and @BerkleeCollege in a study highlighting the experiences of women in the music industry. 🎶\n\nhttps://t.co/yU38fk8jI7","date":"Wed Mar 30 23:01:12 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Among public universities, @asueducation has been ranked No. 5 in @usnews' 2023 Best Graduate Schools of Education rankings, ahead of the University of California-Berkeley, the University of Texas-Austin and the University of Virginia. 🎓 \n\nhttps://t.co/CIVaPT9ubS","date":"Wed Mar 30 21:01:04 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"#CronkiteGlobal Week is happening at @Cronkite_ASU! \nThis is a week filled with globally-minded events and programming that tackle global challenges, taking place at the school — and with virtual watch options. \n\nView the full event lineup here: https://t.co/Y0fbabjyMe https://t.co/wYxjLPnUsJ","date":"Wed Mar 30 19:01:33 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@WPCareySchool climbed to the no. 13 spot in the @usnews executive MBA programs ranking and No. 18 among part-time MBA programs, making the W. P. Carey School the top-ranked MBA in Arizona. 📈\n\nhttps://t.co/hKvJq9bfmr","date":"Wed Mar 30 17:02:17 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Today is the last day to vote, Sun Devils! Cast your ballot to elect both undergraduate and graduate student government leaders on March 29-30. \n\nVisit https://t.co/WDp1YbIlwK to vote. 🔱 https://t.co/9GR9aPWQeo","date":"Wed Mar 30 15:02:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@usnews has ranked @asupublicsvc's master’s degree program in homeland security as No. 1 in the country, tied with the Naval Postgraduate School, and ranked higher than the programs at Harvard and Columbia universities. 🔱\n\nhttps://t.co/01oYHx1tGc","date":"Wed Mar 30 01:00:43 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU's 185 pianos are cared for meticulously by Rick Florence, who has been working @ASU for 30 years. Because of this amazing care, student performers in @ASU_MDT can count on their pianos to be consistent and predictable for their performances.\n\nhttps://t.co/poexOMQ6UD","date":"Tue Mar 29 23:00:58 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@ASUSILC celebrated the Lunar New Year with a virtual event last week in partnership with the Contemporary Chinese School of Arizona and Phoenix Sister Cities.\n\nRead more about the panel speakers and Phoenix's sister city, Chengdu.\n\nhttps://t.co/OlokHlo5Gm","date":"Tue Mar 29 21:01:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Study abroad experiences are very popular among the @ASU student community. @ASUSILC faculty are leading summer trips from France to Italy to Spain, just to name a few.\n\nWant to find your summer study abroad? Check out all the options below! \nhttps://t.co/AFxZuo3vZC","date":"Tue Mar 29 19:01:46 +0000 2022","user_id":"18783501"},{"handle":"asu","text":".@Future_of_War professor, Peter Singer says the information space is one of the most crucial parts of the battlefield and there have been three essential gains for Ukraine’s narrative winning out against Russia’s.\n\nFind out what those three are: https://t.co/e27jyoqGva","date":"Tue Mar 29 17:02:22 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"ASU is dedicated to giving back to the community. Whether it be through community service or innovative discoveries in our labs, ASU is helping change lives in Arizona and beyond.","date":"Tue Mar 29 15:00:03 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"Career development, wellness and embracing your best self — all things ASU is working toward for all of our students and alumni.","date":"Tue Mar 29 06:00:01 +0000 2022","user_id":"18783501"},{"handle":"asu","text":"In a new course called \"American Constitution I\" offered by @ASU_SCETL, students will be studying the American constitution with the goal of \"cultivating educated leaders, professionals and citizens who are well-versed in constitutional law,\" says professor Aaron Kushner.","date":"Tue Mar 29 01:00:01 +0000 2022","user_id":"18783501"}]