[{"handle":"harvard","text":"With gas prices soaring and inflation holding steady at 8%, the Federal Reserve raised its benchmark interest rate last week in an aggressive bid to bring inflation back down https://t.co/116QvCp8E0","date":"Wed Jun 22 17:16:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The Salata Institute for Climate and Sustainability will launch in the fall of 2022 with a mission to develop and promote durable, effective, and equitable solutions to climate-change https://t.co/WXiecnyXcK","date":"Wed Jun 22 15:00:32 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A fresh coat of paint https://t.co/rBywspCStb","date":"Wed Jun 22 12:26:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Fifty years after Watergate, a @Harvard_Law professor weighs in on the government reforms implemented after the scandal, their legacy, and what changes are still needed today https://t.co/SCm90Yjb84","date":"Wed Jun 22 02:11:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Employees with outgoing personalities may seem like they could charm their way to the top of any company, but there’s a down side to being the life of the party https://t.co/rFL29tVYlV","date":"Tue Jun 21 23:12:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A study by the National Institute on Alcohol Abuse and Alcoholism showed that alcohol consumption in November 2020 was 39% higher than in February 2020 https://t.co/XpkAM55zks","date":"Tue Jun 21 20:27:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"All over Harvard’s campus, we welcomed students back to in-person classes, on-campus activities, and the advancement of scholarly work https://t.co/ybJqlFCjJQ","date":"Tue Jun 21 18:38:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The Harvard Farmers' Market opens for the season today! Every Tuesday this summer, 11:30am-5:30pm (no market on 8/30): https://t.co/xTAlbwt8Ln https://t.co/YBvxS98qve","date":"Tue Jun 21 15:09:09 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Happy #InternationalYogaDay! https://t.co/uUaQW0HV20","date":"Tue Jun 21 13:34:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Conservator Allison Jackson gilded and aged a frame for a 19th century painting on display at @harvartmuseums. Read more: https://t.co/6cFPKWmmpg https://t.co/OM8tWzxdly","date":"Tue Jun 21 00:38:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Jarvis Givens, a historian and assistant professor at @hgse, describes the history and significance of Juneteenth—and speculates on whether its celebratory promise can be fulfilled https://t.co/G9EPPQG60v","date":"Mon Jun 20 19:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"I now view #Juneteenth as the true Independence Day, because that was the day when all Americans got their freedom.\" -Samantha O’Sullivan https://t.co/gicBBZGpyC","date":"Mon Jun 20 18:29:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"View works of art featured at the @harvartmuseums that are connected to the histories of enslavement, emancipation, and inequality in the U.S.https://t.co/yqxswgj0IW","date":"Mon Jun 20 15:49:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Evelynn Hammonds will be the inaugural Audre Lorde Visiting Professor of Queer Studies at Spelman College for the 2022-23 academic year https://t.co/Rxqy5d96Hw","date":"Sun Jun 19 23:47:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Graduate research fellows from the Racial Diversity, Equity, and Inclusion in Science Education project share what Juneteenth means to them and how they celebrate the day https://t.co/wtJ1tVHWeF","date":"Sun Jun 19 21:07:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Growing up, Annette Gordon-Reed celebrated Juneteenth by \"barbecuing [and] having traditional Southern fare...We visited family and friends, and they visited us.\" https://t.co/JqPRLDY0q9","date":"Sun Jun 19 18:17:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard experts share important resources to better understand the origins of Juneteenth and how it’s being celebrated today https://t.co/gicBBZGpyC","date":"Sun Jun 19 15:26:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Juneteenth is a day for remembering the hope that my ancestors and others had that the dream of equality would one day be realized.” -Annette Gordon-Reed https://t.co/zoFg3zqv1G","date":"Sun Jun 19 13:46:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"Holidays like #Juneteenth exist not only to celebrate how far we have come but to also demonstrate that we still have a long way to go.\" -Opeoluwa Falako https://t.co/gicBBZGpyC","date":"Sun Jun 19 00:30:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"Before @hgse, I was always looking for leaders to follow. Harvard Graduate School of Education taught me that we are the leaders, and we must make a statement.\" –Peter Swing https://t.co/VQIjvgVo52","date":"Sat Jun 18 20:19:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Enjoying the day at @Harvard_Law 🌳 https://t.co/BaKMFaSVFg","date":"Sat Jun 18 16:17:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"This year saw innovations in teaching and scholarship, medical breakthroughs and collaborations, the continued fight for equity and justice, and a refresh of several buildings across the University https://t.co/ybJqlFCjJQ","date":"Sat Jun 18 12:19:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Black Texans have been commemorating Juneteenth yearly since 1865. We know how to do it, and people can follow our example and add their own ideas,\" says Harvard's Annette Gordon-Reed https://t.co/JqPRLDGp1z","date":"Sat Jun 18 01:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Using a new technique known as lesion network mapping, researchers have mapped addiction remission to entire brain circuits rather than specific brain regions https://t.co/p9fQkADIRQ","date":"Fri Jun 17 23:14:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"From committee members and prosecutors, to reporters and resignation letter-writers, these Harvard folks were key players in the Watergate saga https://t.co/5JyXoSjUwN","date":"Fri Jun 17 20:15:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A panel at @harvardmed analyzed epidemics and pandemics of the 21st century, combing the recent past and present for insights into how to best address the challenges of coming years https://t.co/2ciTu45gVL","date":"Fri Jun 17 19:03:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"On the 50th anniversary of Watergate, Historian Garrett Graff argues that it wasn’t so much a single scandal, but a reflection of a corrupt, conspiratorial mindset https://t.co/T3L17uNYOH","date":"Fri Jun 17 16:13:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The way small businesses could benefit from better and more competitive payments infrastructure is almost entirely overlooked https://t.co/zUq38APYfg","date":"Fri Jun 17 13:24:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Because a limited number of countries produce helium, it only takes a handful of supply disruptions to trigger a crisis https://t.co/fEQR0hvsWU","date":"Fri Jun 17 00:54:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard experts talk about alarming drinking trends, safe weekly limits, and approaches for cutting back or quitting https://t.co/XpkAM55zks","date":"Thu Jun 16 21:22:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What will the long-term physiological repercussions be for those who’ve had COVID-19? https://t.co/eirxzJ7iqT","date":"Thu Jun 16 19:03:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"I felt welcomed, loved, and affirmed by being who I am at Harvard. One class, in particular, Queer Nation, at the Harvard Kennedy School has taught me to dream about a society where queerness can be liberated.\" - Tanat Chinbunchorn, @HarvardChanSPH #PrideMonth https://t.co/R4StFEK5M8","date":"Thu Jun 16 16:10:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Nearly 50 years ago, the Watergate break-in took place. @Harvard_Law Professor Jack Goldsmith discusses the many government reforms implemented after the scandal and their legacy. https://t.co/8N5FNC2uob","date":"Thu Jun 16 12:56:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These Harvard alumni were some of the key players in the Watergate saga https://t.co/5JyXoSBvVn","date":"Thu Jun 16 02:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What happens when a recently conserved painting is ready for display in the galleries but its frame is all wrong? https://t.co/iYG8VkUiMI","date":"Thu Jun 16 00:16:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"New research seeks to inform fair chance hiring policies for individuals with arrests or criminal records  and policies on equal employment https://t.co/KZjOcaSMrX","date":"Wed Jun 15 21:19:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Late spring at Widener Library ☀️ 📚 https://t.co/Z11SDiycF8","date":"Wed Jun 15 19:04:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"After police arrested five burglars inside DNC headquarters in Washington, D.C. on June 17, 1972, their ties to President Nixon’s re-election campaign emerged. Thus began the slow unraveling of Nixon’s presidency known as Watergate. https://t.co/T3L17uNYOH","date":"Wed Jun 15 16:42:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Learn how Harvard students and faculty members are working to create a more equitable future for the LGBTQ+ community https://t.co/L9mID29Six","date":"Wed Jun 15 13:37:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Children living in neighborhoods with higher population densities, greater proportions of lower-income households, and greater poverty had higher rates of asthma, according to a study led by @HarvardChanSPH  https://t.co/ljKwrf0g0X","date":"Wed Jun 15 00:15:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In contrast to other organs that can repair themselves to various degrees after injury, the heart has limited to no regenerative capacity https://t.co/mcn1oKuydy","date":"Tue Jun 14 21:10:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers suggest that structural factors including racism, education, the physical environment, and access to health care may be playing a role in the disparities https://t.co/ljKwrf0g0X","date":"Tue Jun 14 19:49:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A global helium shortage is affecting researchers everywhere  https://t.co/fEQR0hvsWU","date":"Tue Jun 14 16:11:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Happy #FlagDay! https://t.co/ecJvahOImO","date":"Tue Jun 14 15:00:32 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The @HarvardLibrary holds a collection of materials related to Tennessee Williams, considered one of the greatest American playwrights of the 20th century https://t.co/NW4YLpDI9o","date":"Tue Jun 14 00:20:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Robert Livingston of @Kennedy_School hopes his book \"The Conversation\" will start a discussion about racial bias https://t.co/9iBvC52fR2","date":"Mon Jun 13 22:58:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Just a few weeks after the assault on the U.S. Capitol, @Kennedy_School Professor Alex Keyssar turned the events into a class, “Understanding What Happened on January 6” https://t.co/r7k5KMDC7u","date":"Mon Jun 13 18:40:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"It's all fun and games at @HarvardGSD 🏐 https://t.co/bGzIOShrPP","date":"Mon Jun 13 16:09:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Chalk art for #PrideMonth 🏳️‍🌈 https://t.co/w41nx0OFIz","date":"Mon Jun 13 12:14:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Widely regarded as one of the nation’s pre-eminent higher education leaders, President Bacow conveyed his decision in a message to the Harvard community on Wednesday https://t.co/59RG2gVuO0","date":"Sun Jun 12 22:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The researchers discovered receptors in the neurons that are capable of detecting molecular signals coming from the immune system https://t.co/fOHIjlqd47","date":"Sun Jun 12 20:06:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Pride is about celebrating our vibrant LGBTQ+ community while also paying respect to the queer ancestors who fought for us to be able to be as loud and visible as we are today.” —Ashley Cavanagh, Co-President of @LGBTQ_at_GSAS https://t.co/gNTmOkdIPw","date":"Sun Jun 12 19:00:07 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A team at @wyssinstitute and @hseas has developed new heart engineering technologies that has allowed them to mimic the alignment of the heart’s contractile elements https://t.co/mcn1oKuydy","date":"Sun Jun 12 16:20:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Goat yoga at @harvardmed School! https://t.co/WsRmCMn93v","date":"Sun Jun 12 13:53:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Eve Blau will be the first woman to serve as director of the Davis Center for Russian and Eurasian Studies at Harvard https://t.co/fKAZPLK0nK","date":"Sun Jun 12 01:50:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Nearly 50 years after the Watergate break-in on June 17, 1972, Harvard Professor Jack Goldsmith discusses the many government reforms implemented after the scandal, their legacy, and what changes are still needed today https://t.co/8N5FNC2uob","date":"Sat Jun 11 23:48:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Seen in Harvard Square 🪴 https://t.co/5VaECnB2C4","date":"Sat Jun 11 21:53:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Vaccination provides children and teens with better protection against the omicron variant than natural infection, according to a study investigator https://t.co/A7y1LoniWA","date":"Sat Jun 11 19:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"There’s no right way to be LGBT or be queer. As long as it’s true to you, it’s what you should be doing, so don’t get bogged down in the details.” -Kailey Nicholson, #PrideMonth https://t.co/L9mID29Six","date":"Sat Jun 11 16:05:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"March for Our Lives organizers are coordinating a summer of action to demand stricter federal gun-control laws in the wake of recent deadly mass shootings across the country https://t.co/BP5RADXbpm","date":"Sat Jun 11 13:26:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers from Boston-area universities analyzed COVID samples from their asymptomatic screening programs, finding that omicron accounted for over 90% of infections as early as nine days after it arrived in a community https://t.co/k7Z3KcB51J","date":"Sat Jun 11 01:22:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"President Larry Bacow announced on Wednesday that he will step down next June https://t.co/59RG2gVuO0","date":"Fri Jun 10 22:09:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Thousands of alumni from around the world came together to participate in the first-ever Harvard Alumni Day https://t.co/khVbdJhTr3","date":"Fri Jun 10 20:23:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The heirs of Ehud Yonay, whose California magazine article inspired the Top Gun films, are suing Paramount Pictures, claiming that the movie rights returned to their family in 2020 https://t.co/TMLUKO5XfN","date":"Fri Jun 10 17:23:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Prithwiraj Choudhury of @HarvardHBS outlines three ways governments and employers can support the shift to work-from-anywhere https://t.co/7Ntbt4v60O","date":"Fri Jun 10 15:47:08 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The new campaign to demand stricter federal gun-control laws will kick off with marches in Washington, D.C., and an expected 450 cities and towns across the nation and in Europe on Saturday https://t.co/BP5RADXbpm","date":"Fri Jun 10 12:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As organizations and individuals around the world settle into a blend of in-person and virtual work, we’re learning more about the opportunities and risks hybrid brings https://t.co/zJ2I0yoiqJ","date":"Fri Jun 10 02:20:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers describe finding a small group of neurons near the base of the brain that can induce symptoms of sickness, including fever and appetite loss https://t.co/fOHIjlqd47","date":"Fri Jun 10 00:03:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Higher levels of optimism were associated with longer lifespans in women across racial and ethnic groups, according to a study led by researchers at @HarvardChanSPH https://t.co/PjaRwEOgqm","date":"Thu Jun 09 20:00:32 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Lawrence Bacow, the 29th president of Harvard, has announced that he will step down next June https://t.co/59RG2hd5Fy","date":"Thu Jun 09 18:08:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard Alumni Day marked the inauguration of a re-envisioned annual celebration—a day dedicated entirely to alumni, enabling a greater focus on Harvard’s ever-growing global alumni community https://t.co/khVbdJhTr3","date":"Thu Jun 09 15:22:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"This #PrideMonth, meet students and faculty members, explore lessons from the past, and discover what is happening today in the LGBTQ+ community https://t.co/L9mID29Six","date":"Thu Jun 09 12:34:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Changing the perspective is what makes the production feel so fresh, noted Liz Mikel, who plays John Hancock https://t.co/TyyVbQTjRN","date":"Thu Jun 09 00:50:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The @HarvardGSAS Student Center at Lehman Hall is showing some #Pride! https://t.co/yk671EjVC4","date":"Wed Jun 08 22:24:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Read more about President Bacow's time at Harvard https://t.co/59RG2gVuO0","date":"Wed Jun 08 19:07:11 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"Serving in these capacities has been the privilege of a lifetime,\" President Bacow said in a message to the community announcing he will step down next June https://t.co/hACkih0mbp","date":"Wed Jun 08 19:07:11 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These insights could help researchers improve COVID-19 vaccines, with the ultimate goal of either defending people from multiple strains or protecting against variants that have yet to emerge\nhttps://t.co/G1rLlmneLl","date":"Wed Jun 08 15:52:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Our responses to the pandemic and continuous uncertainty, fueled by doomscrolling and newsfeeds, range from hyperactivation (fight or flight) to numbness (freeze) https://t.co/fLM4BkoImK","date":"Wed Jun 08 12:57:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The model presents the most detailed analysis of the crisis to date by capturing how the connections between the stages of prescription and illicit opioid use have evolved over time https://t.co/yTQXHddWCz","date":"Wed Jun 08 01:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"With remote work, the employment and living landscape is poised for a drastic and historic change, says @HarvardHBS Professor Prithwiraj Choudhury https://t.co/7Ntbt4v60O","date":"Tue Jun 07 23:45:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Two-term U.S. poet laureate and Pulitzer Prize–winner Tracy K. Smith delivered the Harvard Alumni Day keynote address https://t.co/khVbdJhTr3","date":"Tue Jun 07 22:19:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"While heartbreak may have pushed Nicole Hyala to become a radio DJ, it was a leadership opportunity that led her to @online_HBS \nhttps://t.co/3jeonb9ViK","date":"Tue Jun 07 20:00:07 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Fewer than 10% of children who contracted COVID-19 in 2020 or early 2021 developed antibodies that can fight off the omicron variant https://t.co/A7y1LoniWA","date":"Tue Jun 07 18:18:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Explore how Harvard is celebrating #PrideMonth https://t.co/L9mID2aq85","date":"Tue Jun 07 12:20:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"On #HarvardAlumniDay we welcomed more than 10,000 alumni back to campus! https://t.co/eZRrgulK6b","date":"Tue Jun 07 00:10:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The tool, which uses more than six million SARS-CoV-2 genomes, can estimate how genetic mutations will impact the fitness of a particular coronavirus variant https://t.co/gTyXPOvPr3","date":"Mon Jun 06 21:47:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"HiHome, a start-up from @hseas alumni, uses scoring and recommendation algorithms to simplify the home buying process\nhttps://t.co/JnUSGAvOUT","date":"Mon Jun 06 19:34:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Scientists at @MassGeneralNews have developed a data-driven simulation model designed to help policymakers better understand and address the nation’s rampant opioid crisis https://t.co/yTQXHddWCz","date":"Mon Jun 06 17:17:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Patients who had only public insurance had a 53% five-year survival rate compared to 63% for those with private insurance https://t.co/OijLpZeM0D","date":"Mon Jun 06 12:19:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Each year at Commencement, the high Sheriff of Middlesex County formally opens and closes the ceremony 🎩 https://t.co/xiUsZualM6","date":"Sun Jun 05 23:44:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Jenga in the BioLabs courtyard! https://t.co/O9aaXJBMYo","date":"Sun Jun 05 16:26:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The female, nonbinary, and trans cast brings fresh perspectives to \"1776,\" which depicts the Second Continental Congress struggling to draft the Declaration of Independence during a hot summer in Philadelphia https://t.co/TyyVbQTjRN","date":"Sun Jun 05 13:46:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Families, friends, music, and confetti! Take a look at the celebrations for the Classes of 2020, 2021, and 2022 🎉  https://t.co/KMqvMMIa3b","date":"Sat Jun 04 23:00:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Heart healthy habits that start in childhood affect lifespan, according to a study that began tracking children in the 1970s https://t.co/5i7jz1kQMo","date":"Sat Jun 04 20:15:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"If the Supreme Court does decide to overturn Roe v. Wade, it will be taking a position that a significant majority of Americans oppose https://t.co/iPc6MKdCPG","date":"Sat Jun 04 18:32:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“As more studies come out, it will be harder for the gun lobby in the same way it was harder for the cigarette companies to make false claims about cigarettes.” -David Hemenway https://t.co/D16O5Zh17g","date":"Sat Jun 04 14:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“1776” is at the Loeb Drama Center through July 24 https://t.co/TyyVbQTjRN","date":"Sat Jun 04 00:11:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Even with uniform initial treatment, children from historically marginalized populations had poorer five-year survival rates after a diagnosis of high-risk neuroblastoma https://t.co/OijLpZeM0D","date":"Fri Jun 03 21:39:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In 2021, more than 100 bills were introduced in 33 U.S. state legislatures to restrict the rights of transgender and gender-diverse individuals https://t.co/UHGqu44y8H","date":"Fri Jun 03 18:31:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"Pride means honoring the life, legacy, and joy of queer leaders whose courage and tenacity paved the way in the pursuit of liberation and celebration of our identities.\" - Austin Nguyen, @HarvardGSAS #PrideMonth https://t.co/nOrqNvSQUf","date":"Fri Jun 03 16:15:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The vaccine could be used “off-the-shelf,” without the need for a lengthy and expensive personalization process https://t.co/6ZtC5w8FoM","date":"Fri Jun 03 14:42:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Children with high-risk neuroblastoma experienced worse outcomes if they were from certain racial and ethnic groups, despite being treated in clinical trials with standardized protocols https://t.co/VX78mXhWd2","date":"Thu Jun 02 23:48:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"David Hemenway, a professor of health policy at @HarvardChanSPH, believes that a growing body of research will eventually lead to a shift in efforts to control gun violence in the U.S. https://t.co/D16O5Zh17g","date":"Thu Jun 02 20:18:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"So many creative caps at Commencement! 🎓 https://t.co/tSoKsZSjaZ","date":"Thu Jun 02 18:10:08 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard chemist George Whitesides is one of 11 recipients of the 2022 Kavli Prize in recognition of his contributions to the field of nanoscience https://t.co/QeZoKuWmYZ","date":"Thu Jun 02 16:12:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Three classes of Harvard graduates gathered in Harvard Yard last week to celebrate Commencement https://t.co/KMqvMMIa3b","date":"Thu Jun 02 12:33:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"How does the immune system remember and recognize infection it has encountered in the past? https://t.co/G1rLlmneLl","date":"Wed Jun 01 23:47:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The caps of Commencement 🎓 https://t.co/3Xcg3EZ2xo","date":"Wed Jun 01 21:15:09 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers at the Wyss Institute are developing CircaVent, a drug discovery platform for mental health conditions https://t.co/QTRH4Rkwt9","date":"Wed Jun 01 19:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Members of the Classes of 2020 and 2021 came together in Harvard Yard on Sunday to celebrate their long-awaited in-person Commencement https://t.co/6TEIG0ucpZ","date":"Wed Jun 01 17:57:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Professor Daniel Lieberman says exercise is something humans never evolved to do, but is healthy nonetheless. #GlobalRunningDay https://t.co/BMYaU3kjJB","date":"Wed Jun 01 15:35:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new study by @harvardmed researchers at @BrighamWomens examines the impact of the 16-hour work limit on the safety outcomes of patients directly under the care of resident-physicians https://t.co/70q9Lw3kvd","date":"Wed Jun 01 13:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"While new information will continue to come in, here are answers to several common questions about monkeypox https://t.co/phYsZlAOua","date":"Wed Jun 01 00:07:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Relive the excitement of Commencement! 🎓🎉 https://t.co/KMqvMMIa3b","date":"Tue May 31 21:55:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Sherrilyn Ifill, president and director-counsel emeritus of the NAACP Legal Defense and Educational Fund, received the 2022 Radcliffe Medal on Friday https://t.co/4W06wUBjxo","date":"Tue May 31 18:07:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Health policy scholar Alex McDowell explores the devastating impact of legislation that restrict the rights of transgender and gender-diverse individuals https://t.co/UHGqu44y8H","date":"Tue May 31 15:10:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Don’t let your generation be defined by the pandemic. Let it be defined by public service,” said Attorney General Merrick Garland at the Sunday ceremony for the Classes of 2020 and 2021 https://t.co/xO5Ml0c7tJ","date":"Tue May 31 13:15:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Memorial Hall commemorates Harvard classmates who fought on behalf of the United States Army and Navy in the American Civil War https://t.co/w6ZUopPcx2","date":"Mon May 30 16:05:05 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard's @MemChurch, originally dedicated in memory of those who died in World War I, has added memorials to remember those who died in subsequent wars. https://t.co/joi24XbjX9","date":"Mon May 30 13:45:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The Radcliffe Medal is awarded to an individual who “embodies our commitment to excellence, inclusion, and social impact,” said Tomiko Brown-Nagin, dean of Harvard's @RadInstitute https://t.co/4W06wUBjxo","date":"Mon May 30 00:07:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"An estimated 8,800 graduates from the Classes of 2020 and 2021 registered for today's Commencement in Harvard Yard https://t.co/6TEIG0tEAr","date":"Sun May 29 22:30:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Attorney General Merrick Garland urged #Harvard20 and #Harvard21 graduates to embrace public service at a time when the nation’s democratic institutions face historic threat https://t.co/xO5Ml0c7tJ","date":"Sun May 29 21:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard20 and #Harvard21 graduates returned to Tercentenary Theatre this morning to celebrate Commencement in person 🎓 https://t.co/trMPjvnHfF","date":"Sun May 29 17:25:08 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Watch the Commencement ceremony for the Classes of 2020 and 2021 live today, beginning at 8am ET https://t.co/lNzz9nToxE","date":"Sun May 29 11:15:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Meet some of our amazing #Harvard22 graduates https://t.co/xHi7OyY4EQ","date":"Sat May 28 23:05:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“I find living in between Indian and American culture to be an incredibly fulfilling experience, and my Indian heritage continues to ground me in my values as I train to be a physician.\" -Kaushik Venkatesh, @HarvardMed #AAPIHeritageMonth https://t.co/XVEAGJTGk4","date":"Sat May 28 20:28:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"There’s something magical about being around other people who are motivated to learn, share, and progress through academia. The environment at @HarvardExt provided this experience.\" -Dorottya Barna, #Harvard22 https://t.co/Bm0VeiSomn","date":"Sat May 28 18:31:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In her address, New Zealand Prime Minister Jacinda Ardern laid part of the blame for misinformation on social media platforms, the companies that run them, and the algorithms that create internet echo chambers #Harvard22 https://t.co/YikzrwTKdk","date":"Sat May 28 16:24:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"During her sophomore year, #Harvard22 graduate Aubree Muse was playing for the Harvard softball team when doctors found a tumor in one of her lumbar vertebrae https://t.co/eLxL3UQEoy","date":"Sat May 28 13:30:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“I didn’t really plan to do this in the middle of my senior year, but I love politics, and I saw that I could be a valuable voice in Medford.” -Justin Tseng, #Harvard22 https://t.co/wFQDBMa3CF","date":"Sat May 28 01:33:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"The work of the HDS community requires deep emotional engagement. It looks to a rapidly changing world experiencing immense pain and suffering and injustice and asks how to best be an agent for peace.\" -Maggie Rogers https://t.co/0HLofo9Z9c","date":"Fri May 27 20:41:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Jonathan Ji, a #Harvard22 graduate, is reflecting on the unique opportunity to participate in research with faculty members he looked up to prior to attending @HarvardDivinity https://t.co/fR9he0VZLK","date":"Fri May 27 20:33:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In her Commencement address, New Zealand Prime Minister Jacinda Ardern offered a reminder to #Harvard22 graduates that democracy is fragile https://t.co/YikzrwTKdk","date":"Fri May 27 18:24:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Damarcus Bell came to @Kennedy_School to help communities of color thrive on a more systemic level, “to reshape institutions and policies, and even theories, the way we think about problems on a large scale.” #Harvard22 https://t.co/sX7Eoq40Kc","date":"Fri May 27 16:31:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Celebrating the #Harvard22 graduates ❤️ https://t.co/71ukUnPlrW","date":"Fri May 27 13:15:09 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“The issues we navigate as a society will only intensify. The disinformation will only increase. The pull into the comfort of our tribes will be magnified. But we have it within us to ensure that this doesn’t mean we fracture.” https://t.co/YikzrwTKdk","date":"Thu May 26 23:56:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Take a look at some special moments from the #Harvard22 commencement https://t.co/ecvJgcfirN","date":"Thu May 26 22:10:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Speakers addressed the graduates and crowds at today's #Harvard22 Commencement https://t.co/5SwPZQxoDt","date":"Thu May 26 21:08:09 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard welcomed its seven honorands to Tercentenary Theatre for the first time since 2019. #Harvard22 https://t.co/0EN8oXoDHS","date":"Thu May 26 20:09:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Scenes from #Harvard22 Commencement 🎓 https://t.co/JTq3lnBtGu","date":"Thu May 26 19:30:12 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In a special rendition of the song that made her a viral sensation, #Harvard22 graduate Julia Riew and classmates encouraged this year’s graduates to plunge headfirst into the next part of their lives. https://t.co/PanYSKO22N","date":"Thu May 26 18:01:24 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At today's Commencement, we awarded 8,870 degrees https://t.co/X4yAqbMk54","date":"Thu May 26 17:12:22 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Watch the Commencement ceremony live today, beginning at 9am ET https://t.co/lNzz9nToxE","date":"Thu May 26 12:40:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Today’s the day 🎓 #Harvard22 https://t.co/136j8mx87B","date":"Thu May 26 11:49:34 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These three students will deliver addresses at today's #Harvard22 Commencement ceremony. \n\nRead more: https://t.co/Z3pbvzLmjs https://t.co/X1XQuqVncw","date":"Thu May 26 11:35:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At today's Class Day for Harvard College seniors, Dean Khurana, Boston Mayor Michelle Wu, and student speakers addressed the graduates. #Harvard22 https://t.co/iHXNayIeIc","date":"Thu May 26 00:25:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These students will be speaking at the Harvard Commencement ceremonies this week https://t.co/Z3pbvzLmjs","date":"Wed May 25 19:15:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At yesterday’s Phi Beta Kappa ceremony, Theda Skocpol urged the Class of 2022 to confront “the troubles of our time” and fight to defend the public good https://t.co/xxbP4JVYXP","date":"Wed May 25 15:33:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"After a two-year hiatus, the Baccalaureate ceremony for Harvard College seniors was held in Tercentenary Theatre yesterday https://t.co/TLAMKsHyGa","date":"Wed May 25 14:05:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The celebrations are beginning! 🎉 🎓 https://t.co/D8wXWAzIhG","date":"Tue May 24 20:10:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Getting ready for #Harvard22 Commencement! https://t.co/YrfvxcHsze","date":"Tue May 24 18:07:07 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"We're counting down the days until our first in-person Commencement since 2019! 🎓 https://t.co/DHLi9Q8wiH","date":"Tue May 24 16:36:19 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“In the speech, I wrote about the fact that when we first arrived on campus and went into Annenberg, it was kind of scary and daunting,” said Benjamin Porteous. “And then we met John. He represents...what Harvard College is trying to do creating a welcoming home for students.” https://t.co/42TXOiH9pR","date":"Tue May 24 15:24:55 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"About her address, @HarvardDivinity graduate Lindsay Sanwald says, “I just want to preserve the mood on this day of joy and celebration and what a miracle it is that we get to be together after being forced to be apart for so long.” https://t.co/3lZhdrsiGC","date":"Tue May 24 15:24:53 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Noah Harris's address focuses on paying it forward: “My main message to all is that we have to uplift those in our communities who don’t have the same opportunities that we have had...Lend a hand to someone else.” https://t.co/Ar3t8epB0i","date":"Tue May 24 15:24:51 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Meet the students who will be speaking at the #Harvard22 and Classes of 2020/2021 Commencement ceremonies: https://t.co/Z3pbvzLmjs","date":"Tue May 24 15:24:50 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Caroline Engelmayer's address focuses on an epic poem: “‘The Odyssey’ stood out to me because it seemed that the Class of 2020...has been on a journey in a very literal sense. We left campus for part of our time in college, and now we’re coming back for Commencement.” https://t.co/TdysNgvk2r","date":"Tue May 24 15:24:50 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 graduate Ryan Sameen Meshkin’s next career move will keep him close to the community where he lives and serves as part of a grassroots community-building program https://t.co/VRFfA6b4fT","date":"Tue May 24 14:30:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard epidemiologist William Hanage discusses the role of protective measures in our transition to a new pandemic phase https://t.co/BK2wNkpsNT","date":"Tue May 24 11:44:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As the second-oldest of seven, #Harvard22 graduate Lucy Wickings is determined to show her brothers and sisters the types of opportunities available outside of their hometown https://t.co/7DgN02OAxb","date":"Tue May 24 01:29:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The first 1,000 days of life are a crucial timeframe in a child’s growth and development. But what about the next 1,000 days?  https://t.co/vOtbnwWDJP","date":"Mon May 23 23:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What language does a bilingual or multilingual person most likely to dream in? https://t.co/9lwiNpXKZQ","date":"Mon May 23 20:23:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For the past year as a Harvard Scholar at Risk, Binalakshmi Nepram has worked with Harvard librarians to assess and strengthen their collections related to her culture https://t.co/16yTbU8ump","date":"Mon May 23 17:56:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“What makes @dental_harvard so special is the people. I have met so many great individuals who have taught me so much, not just about dentistry, but life in general.” -Jack Harris, #Harvard22 \n\nRead more: https://t.co/RJlzEA6UOo https://t.co/Kh4GLtmO9E","date":"Mon May 23 15:55:05 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Ahead of the Latinx Graduation, Human Evolutionary Biology concentrator Araceli Meza Meza said, “Most importantly, college taught me to appreciate everything my parents have done for me.”\n\nLearn more about Affinity Graduations: https://t.co/WC8KKPEmNu https://t.co/w1FwAiUI5K","date":"Mon May 23 14:10:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard epidemiologist William Hanage explains how to stay on guard against COVID-19 subvariants https://t.co/BK2wNkpsNT","date":"Mon May 23 13:40:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Explore how each Harvard school will be celebrating Commencement this year #Harvard22 https://t.co/xHi7OyY4EQ","date":"Mon May 23 12:24:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"We'll be back in Harvard Yard this year to celebrate the graduates! #Harvard22 https://t.co/mFWAYcRLJo","date":"Sun May 22 23:44:19 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The projects will seek to reduce the risks of climate change, hasten the transition to renewable energy, and understand and prepare for the effects of climate change https://t.co/6GdGGSDewV","date":"Sun May 22 21:06:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Everything you need to know about #Harvard22 Commencement https://t.co/xHi7OyY4EQ","date":"Sun May 22 19:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Will the current political consensus on helping Ukraine make a measurable difference in this fall’s midterm elections? https://t.co/GOBURHhboH","date":"Sun May 22 16:21:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Jackson Beard, a #Harvard22 graduate, recalls the exact moment that set her on her path to @Harvard_Law and her future career https://t.co/4q4UWQ8xkg","date":"Sun May 22 13:50:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Kelsey Chen, who is participating in the AAPI/APIDA Graduation, said her time at Harvard has been one of “constant transformation and self-growth,” which she attributes to her professors, peers, and education.\n\nLearn more about Affinity Graduations: https://t.co/WC8KKPEmNu https://t.co/t14Je0aewk","date":"Sun May 22 12:30:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The researchers hope that their findings may eventually lead to strategies for earlier detection of Alzheimer’s disease https://t.co/5nANt6Kgq1","date":"Sun May 22 01:09:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"While at Harvard, London Vallery joined Alpha Kappa Alpha (AKA), the first ever Black sorority in the U.S. “The majority of the women in my family are in AKA and it has such a strong emphasis on scholarship.\"\n\nLearn more about Affinity Graduations: https://t.co/WC8KKPEmNu https://t.co/wrIVZRY6W4","date":"Sat May 21 22:53:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Binalakshmi Nepram has spent the past 15 years fighting against oppression of the nearly 50 million Indigenous people in Manipur and other northeast regions of India https://t.co/16yTbU8ump","date":"Sat May 21 19:54:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new paper reveals that education, not gender, was the main distinction between people who stayed in their jobs and those who did not amid the economic shockwaves of the pandemic https://t.co/MxGu10z6NS","date":"Sat May 21 16:33:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For #Harvard22 graduate Nico Maffey, a passion for service has taken the form of social entrepreneurship https://t.co/SUfT1lP3Lu","date":"Sat May 21 13:43:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Her daughter’s congenital heart defect led #HarvardChan22 graduate Oana Geambasu to unintentionally become an adviser to Romania’s health minister, and also led her to @HarvardChanSPH https://t.co/tIMoqJQUMJ","date":"Sat May 21 12:45:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Gordon Freeman, Kornelia Polyak, and Leonard Zon have been elected to the National Academy of Sciences in recognition of their achievements in research https://t.co/fjbrpuGlNs","date":"Sat May 21 11:05:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"Oakland is home for me. It’s where my heart and community are, and I am committed to doing what I can to ensure I am part of the long-term success of our district.” -Dexter Moore Jr., #Harvard22 https://t.co/fEVZuaa8S1","date":"Sat May 21 01:02:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The supply chain for baby formula had been tenuous for some time, but when Abbott Pharmaceuticals recalled many of their formula products, it caused a formula crisis https://t.co/avl5NUOelI","date":"Sat May 21 00:03:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Meet the #Harvard22 graduates 🎓\n\nSee more: https://t.co/xHi7OyY4EQ https://t.co/sDmiMYx8fK","date":"Fri May 20 23:47:11 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"After two years of virtual celebrations, we'll be back in Harvard Yard this year to honor the graduates! #Harvard22 https://t.co/sh4ez8UDdm","date":"Fri May 20 21:55:25 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At the event, “Roe in limbo: A town hall on the leaked Dobbs opinion,” panelists spoke about the meaning and potential impact of the leaked draft decision https://t.co/Vt7zXlyxDJ","date":"Fri May 20 18:51:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"I’d never heard of Harvard Extension and once I started researching the school, I knew this was my second chance.\" -Larisa Svechin, #Harvard22 https://t.co/eLp5kzeakX","date":"Fri May 20 16:05:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“It’s so difficult to encapsulate what a Harvard experience is in a lot of ways. What really sticks out are the people you meet and have gotten close to.” -Uriel Martinez, #Harvard22, Next Gen Graduation\n\nLearn more about Affinity Graduations: https://t.co/WC8KKPEmNu https://t.co/UYHKpYIX0g","date":"Fri May 20 14:21:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"This week, Congress is expected to approve a bipartisan $40 billion aid package for the war-torn country https://t.co/GOBURHhboH","date":"Fri May 20 13:20:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“You find your own people and your own community, and regardless of what that looks like, there’s no right way to be LGBT or be queer.” -Kailey Nicholson, #Harvard22, Lavender Graduation\n\nLearn more about Affinity Graduations: https://t.co/WC8KKPEmNu https://t.co/cPKAw1p99y","date":"Fri May 20 01:37:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Haim Sompolinsky is one of four recipients of the 2022 Gruber Neuroscience Prize, an international award given for contributions to the fields of computational and theoretical neuroscience https://t.co/VwUTEkMA1i","date":"Thu May 19 23:53:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Patience Saaka, a #Harvard22 grad, describes the new digital venture she hopes to focus on after she graduates—a system to help rural providers in Ghana access blood products https://t.co/FPHO4we0K2","date":"Thu May 19 20:17:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"During the “Combatting Hate by Teaching the Holocaust and Other Hard Histories” discussion, @hgse Dean Bridget Long noted how desperately needed those lessons currently are https://t.co/odrBJ9KEGJ","date":"Thu May 19 18:35:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new study by economist Claudia Goldin finds that despite “stresses, anxieties, and frustrations” of the pandemic, women with college degrees largely kept working https://t.co/MxGu10hvpi","date":"Thu May 19 17:31:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"An accessible world is a better world for everyone. #GAAD #GlobalAccessibilityAwarenessDay\nhttps://t.co/YGzyjmsD3Q","date":"Thu May 19 16:11:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Experts believe it may take a while before baby formula production is fully restored https://t.co/avl5NV5Pdg","date":"Thu May 19 15:02:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“The best part of working in city government is, at the end of the day, you’re the closest branch of government to the people you’re serving.” -Juliahna Green, #Harvard22 https://t.co/nmY2Ph1sEo","date":"Thu May 19 12:55:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Ahead of the HUNAP Indigenous Graduation, Chickasaw Nation citizen Joel Chastain said he will take what he’s learned at @Kennedy_School about corporate development and diversification back to his tribe in Oklahoma.\n\nLearn more about Affinity Graduations: https://t.co/WC8KKPEmNu https://t.co/7uhgFo4ate","date":"Thu May 19 02:05:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Two @HarvardChanSPH students created an easy-to-use app that helps those with diabetes manage their disease https://t.co/cxtHpH7h8X","date":"Thu May 19 00:14:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The panelists spoke about the meaning and potential impact of the draft decision – including what a post-Roe legal landscape could look like across America https://t.co/Vt7zXlyxDJ","date":"Wed May 18 22:07:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"It’s unclear whether Russia’s previous violations of arms control conventions and now its actions in Ukraine will interfere with the U.S.’s willingness to engage with it on nuclear issues in the future https://t.co/unV6kCf6ng","date":"Wed May 18 20:12:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Research from #Harvard22 graduate Alexandra Schultz challenges the understanding of the Great Library of Alexandria, which, according to legend, was founded by King Ptolemy II of Egypt in the third century BC https://t.co/VIqCmRmgq6","date":"Wed May 18 17:54:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Love them or hate them, team-building rituals can fortify bonds among coworkers and create the shared sense that work is more meaningful, say @HarvardHBS experts https://t.co/TFRCcyraJI","date":"Wed May 18 15:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 grad Brandon Alexander Anthony wants to help health systems design better services for patients of color, LGBTQ patients, and other marginalized groups. #HarvardChan22 https://t.co/CCEtPWGYTB","date":"Wed May 18 14:07:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Students enrolled in the course curated and created items for a new exhibit, “Black Church Arson: Testimony and Witness,” on display now at the @HarvardDivinity Library https://t.co/3zFpMOglGb","date":"Wed May 18 11:55:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In this new era, scientists could prove—or disprove—Einstein’s long-held theories of gravity and relativity, find Earth 2.0, or discover a wormhole to another universe https://t.co/3WTYG3JPYC","date":"Wed May 18 01:38:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Rema Hanna, a development economist, sees the thousands of new social programs created during the pandemic as a once-in-a-lifetime opportunity to study which kinds of social protection schemes work better than others https://t.co/IZLBlUMKtN","date":"Tue May 17 22:47:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The release of the Harvard &amp; the Legacy of Slavery report brings with it a series of critical questions about how slavery’s impact continues to ripple through education today https://t.co/Pe2ZTljN86","date":"Tue May 17 19:50:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“I am seeing more of the beauty and strength that comes with being connected to multiple cultures, and not thinking of myself as only half, but both.” -Sarah Keiko Beland, @HGSE #AAPIHeritageMonth https://t.co/4HxC3rJz6C","date":"Tue May 17 17:03:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Spring day in Harvard Yard. #HarvardInSpring https://t.co/K5NLGZiChh","date":"Tue May 17 15:50:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Russia’s threats to use nuclear weapons in Ukraine, along with China’s missile system expansion and North Korea’s recent accelerated pace of missile testing, have revived concerns about global arms security https://t.co/unV6kCf6ng","date":"Tue May 17 13:15:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 graduate Eduardo Maury is deciphering somatic mutations to better understand neurological disease https://t.co/2hUeZEbCUs","date":"Tue May 17 11:34:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"It is “close to unprecedented or unprecedented” for the Supreme Court to “undo[…] rights that were viewed as constitutionally central for half a century,” said Mary Ziegler at a @Harvard_Law virtual town hall https://t.co/Vt7zXlyxDJ","date":"Tue May 17 01:21:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"When #Harvard22 graduate Vincent Bain receives his degree from @harvardmed this May, he will be headed to a new assignment at Walter Reed National Military Medical Center https://t.co/bI72ZWde1K","date":"Tue May 17 00:08:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Spring at @Harvard_Law's Langdell Hall #HarvardInSpring https://t.co/xoxfWB6nZK","date":"Mon May 16 21:58:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Hours after unveiling the first image of the black hole at the center of the Milky Way, scientists from the Harvard-led team discussed its significance https://t.co/3WTYG3JPYC","date":"Mon May 16 19:06:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Clark Yuan, a #Harvard22 graduate of @Kennedy_School, believes that unique perspectives should always have a seat at the table when critical decisions are being made https://t.co/Tz6JozpRel","date":"Mon May 16 17:46:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new study by @harvardmed researchers at @BrighamWomens examines the impact of a 16-hour work limit on the safety outcomes of patients directly under the care of resident-physicians https://t.co/70q9Lw3kvd","date":"Mon May 16 15:26:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 graduate William Greenlaw is thinking of becoming a trial attorney, with the aim of eventually working for the Department of Justice https://t.co/vteKBCjyMe","date":"Mon May 16 12:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Springtime with friends https://t.co/toxBVPVnhj","date":"Sun May 15 20:47:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The newly published analysis found baffling variations in the kind of treatment patients receive and in how well patients fare https://t.co/AEQQw8jQ2P","date":"Sun May 15 18:55:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Students share that a primary goal of the group is to build bridges between the diverse worlds of the sciences and humanities https://t.co/ZX1Jj675AA","date":"Sun May 15 16:08:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Spring Sunday 💕\n\nPhoto: Rose Lincoln/Harvard Staff Photographer https://t.co/Bp2pMIOlpk","date":"Sun May 15 15:03:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"With recent stock market instability and prospects for a serious economic downturn, how likely is a recession? https://t.co/N77PKv4R7M","date":"Sun May 15 13:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"It’s extremely humbling to be in the same department along with many of my advisers and mentors — folks I continue to look up to and who have shaped me deeply as a scientist.\" - Physics Professor Norman Yao https://t.co/wHnofjBSjH","date":"Sat May 14 23:49:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"How has the COVID-19 pandemic affected our mental health?#MentalHealthAwarenessMonth https://t.co/5I4NjIHrxI","date":"Sat May 14 20:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“I was seen as American in China, but seen as Chinese in America. Like the hyphen in Chinese-American, I have the privilege of belonging to both worlds, and sit at the boundary of an identity in constant evolution.” -JunJun Feng, @hgse #AAPIHeritageMonth https://t.co/M1WPlqigbB","date":"Sat May 14 17:02:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Out and about on a warm spring day https://t.co/OpbbCC1Lyr","date":"Sat May 14 15:46:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Scientists at the @broadinstitute have created models of skin cancer that can reveal the effects of mutations https://t.co/bhUvqkp91I","date":"Sat May 14 01:50:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The group is dedicated to informal discussions about issues ranging from ethics in designing artificial intelligence to the value of public-facing science communication https://t.co/ZX1Jj675AA","date":"Fri May 13 23:32:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The investigation revealed that all six countries in the study excelled in some measures, while also showing that no country was excellent in all categories https://t.co/AEQQw8jQ2P","date":"Fri May 13 21:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Scientists discuss the status of the pandemic, including rising cases and the current landscape of therapies for COVID-19 https://t.co/PIQP3SCqLR","date":"Fri May 13 19:56:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In colonial America, decisions about managing fertility were made on a household and community level, not mediated by doctors or medicines, says historian Jane Kamensky https://t.co/NC3bwCCATi","date":"Fri May 13 17:26:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The new picture provides the first direct visual evidence that the giant lurking 27,000 light-years away at the center of Earth’s galaxy is a supermassive black hole https://t.co/gRCySgXe7b","date":"Fri May 13 15:23:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Are we headed toward recession? https://t.co/N77PKv4R7M","date":"Fri May 13 12:57:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The findings point to gaps in applying universally accepted standards of cardiac care https://t.co/AEQQw8jQ2P","date":"Fri May 13 02:09:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A surgically implanted device that moves the tongue forward during sleep was found to safely and effectively reduce sleep apnea in adolescents with Down syndrome https://t.co/GteBMWkOJq","date":"Thu May 12 22:18:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A grandmother’s exercise during pregnancy may make her grandchildren healthier metabolically, with less body fat, better insulin control and, in some, healthier bones https://t.co/r0gTVq1k1P","date":"Thu May 12 19:55:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The study adds to growing research that tectonic movement occurred relatively early in Earth’s 4.5 billion-year history https://t.co/EDSYQtHF2L","date":"Thu May 12 17:34:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard experts explore the ways that mental health impacts our lives #MentalHealthAwarenessMonth https://t.co/5I4NjIHrxI","date":"Thu May 12 15:54:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Astronomers have released an image of Sagittarius A* (or Sgr A* for short), the supermassive black hole at the center of our galaxy. https://t.co/KpyfpE3MSx","date":"Thu May 12 14:15:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"An international team of astronomers have released the first image of the supermassive black hole at the center of the Milky Way https://t.co/gRCySgXe7b","date":"Thu May 12 13:09:25 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As the recipient of a heart transplant, #Harvard22 graduate Jon Hochstein has allowed that experience to inspire his medical career.\n\nRead more about his journey: https://t.co/yE74pWbshd https://t.co/OJlvK5s3O2","date":"Thu May 12 11:36:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Working for yourself might bring freedom and autonomy, but it increasingly comes with a major risk: low pay https://t.co/USRKwdxcJ6","date":"Thu May 12 02:57:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The lab wants to determine if one species of piranha is more aggressive than the other and if they can analyze behavioral differences by looking at blood, hormone levels, and gene expression https://t.co/lK9yInokUI","date":"Wed May 11 23:54:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Developed by an international group of experts, a new series addresses concerns that progress in child health has been too slow and that global goals are off track https://t.co/KXm7OeDKui","date":"Wed May 11 21:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Growing up Korean-American, it often felt like I was grasping onto half-unfamiliar rituals and cultural memories. It has taken a long time for me to realize that I can be a whole person with all that complexity.” -Camille Choe, @Kennedy_School #AAPIHeritageMonth https://t.co/IHTyrDDa2F","date":"Wed May 11 18:06:05 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The study evaluated mental health and substance use among unhoused and housed high school students https://t.co/BzQzE2mge4","date":"Wed May 11 16:55:05 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Norman Yao, who attended Harvard for both his undergraduate and graduate studies, has returned to Harvard as a physics professor, studying time crystals and other quantum phenomena https://t.co/wHnofjBSjH","date":"Wed May 11 14:23:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Parkinson's disease is marked by the death of dopamine-producing neurons in the brain, but why do these cells, and only some of them, die? https://t.co/5oiK9RVKd0","date":"Wed May 11 11:08:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In the early U.S., abortion \"existed among communities of enslaved women as well as free women and was very rarely a subject at law\" says historian Jane Kamensky https://t.co/NC3bwCCATi","date":"Wed May 11 00:55:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The Asian Affinity Business Association, in collaboration with students and organizations across the @HarvardHBS campus, are showcasing the history, richness, and diversity of the AAPI experience https://t.co/HacV656b6E","date":"Tue May 10 23:53:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A team of Harvard-led researchers has analyzed some very rare, ancient, and nearly indestructible crystals called zircons for chemical clues about the onset of plate tectonics https://t.co/EDSYQtHF2L","date":"Tue May 10 22:03:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Mental health impacts each person differently. Harvard experts share ways to care for ourselves and for others. #MentalHealthAwarenessMonth https://t.co/5I4NjIHrxI","date":"Tue May 10 19:26:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Study break with baby animals at the @Kennedy_School 💛 https://t.co/OmolsKp2ir","date":"Tue May 10 16:06:12 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers will study the temperaments of two species of piranhas native to the Amazon—caribe and red-bellied piranha, which the lab plans to add later this year https://t.co/lK9yInokUI","date":"Tue May 10 15:12:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What should college be — today and going forward? https://t.co/5993cnj7dA","date":"Tue May 10 12:12:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 graduate Jennifer Cloutier says her early traumatic injury was pivotal in defining her research goal—to understand how tissues regenerate after they are damaged https://t.co/z3TQlza48q","date":"Tue May 10 00:26:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"LATE generally damages many of the same areas affected by Alzheimer’s disease https://t.co/4QHFkMwFUE","date":"Mon May 09 22:28:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“From a reproductive justice standpoint, I want to support persons who have uteri in making decisions about when they wish to have a family, how they want that to look, whether they want to have a family at all.” -Louise King https://t.co/vnMXMWD9Xu","date":"Mon May 09 19:15:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Springtime 🌼 https://t.co/z0Dysd7ctP","date":"Mon May 09 17:27:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“I love our Asian American community, and I love that our world contains its multitude of shades and cultures.\" -Alice Hu, @Harvard_Law #AAPIHeritageMonth https://t.co/2x4HkT2aj9","date":"Mon May 09 15:54:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Reimagining vision correction, creating a more equitable money transfer solution, and designing new systems to protect against coastal flooding were three of the ventures recognized at the Harvard President’s Innovation Challenge Awards ceremony https://t.co/fij2iunypY","date":"Mon May 09 12:54:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers learned that starting screening at ages 45 to 49 resulted in a significant reduction in the population’s actual cases of colorectal cancer diagnosed through age 60 https://t.co/5J88v2yGUe","date":"Mon May 09 00:07:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Experts predict that pandemic learning loss foreshadows a widening of the nation’s racial and economic achievement gap https://t.co/wmgCnTBAPd","date":"Sun May 08 20:38:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Spring Sunday 💕\n\n#HarvardInSpring https://t.co/GcrtAo1fq4","date":"Sun May 08 15:21:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Grocery bills may be extra high these days, but supply chain problems, energy costs, and inflation aren’t the only factors to blame. New research suggests that companies are raising prices simply because they can. https://t.co/8ljThDSc7W","date":"Sun May 08 12:18:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"It’s called LATE, and it's often confused with Alzheimer’s. But what is it and why haven’t we heard of it before? https://t.co/4QHFkMwFUE","date":"Sat May 07 23:46:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"It’s not just inflation—companies hike prices because we keep paying https://t.co/8ljThDB95W","date":"Sat May 07 21:35:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The meteor that Amir Siraj and Avi Loeb discovered had entered Earth’s atmosphere with the energy equivalent to about 110 metric tons of TNT https://t.co/3cPNUfTluA","date":"Sat May 07 20:29:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The war in Ukraine has tested the entire European Union, but it has raised particular challenges for Ireland, which has remained officially neutral in military conflicts since the 1930s https://t.co/PQW5FAaWoM","date":"Sat May 07 15:44:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Sometimes called the “poet of salsa,” Rubén Blades is known for his songs about working people, political turmoil, poverty, and urban violence in Latin America https://t.co/B0npiKueOs","date":"Sat May 07 13:53:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new report on pandemic learning loss found that high-poverty schools both spent more weeks in remote instruction during 2020-21 and suffered large losses in achievement https://t.co/wmgCnTjZXF","date":"Sat May 07 03:04:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These findings support recommendations from the American Cancer Society and the U.S. Preventive Services Task Force to commence screening at age 45 https://t.co/5J88v2QiiO","date":"Sat May 07 00:37:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Hearing the stories of my friends and colleagues really makes me feel hopeful that our collective voices can empower other AAPI members who feel alone or marginalized.” -Kenny Nguyen, @HarvardChanSPH #AAPIHeritageMonth https://t.co/d6uq7WKlBT","date":"Fri May 06 21:23:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In a recent study, patients who experienced repeat urinary tract infections showed decreased diversity of gut microbial species https://t.co/NWEvr2MVfn","date":"Fri May 06 19:51:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Following the leak of a draft decision by the Supreme Court that would overturn Roe v. Wade, @harvardmed's Louise King discusses how the potential ruling might affect providers https://t.co/vnMXMWD9Xu","date":"Fri May 06 18:07:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard's Laurence Tribe talks about the leak, how it might have happened, and what it could mean for the court’s reputation and the outcome of the case https://t.co/gYso4PUxHr","date":"Fri May 06 16:02:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Prior to the award ceremony, Rubén Blades spent four days at Harvard rehearsing with the Harvard Jazz Band, meeting with students, and participating in a panel with Latinx student groups https://t.co/B0npiKtGYU","date":"Fri May 06 14:07:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At the NCAA Championships in March, Felicia Pasadyn’s 4.0 GPA earned her the prestigious NCAA Elite 90 Award, an honor presented to the competitor with the highest cumulative average. #Harvard22 https://t.co/l3smvwAkUc","date":"Fri May 06 12:18:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Simon Coveney, Ireland’s minister for foreign affairs and minister of defense, predicted that the Russian invasion will likely bring about a shift in attitude in the island nation https://t.co/PQW5FAaWoM","date":"Fri May 06 02:20:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Three Harvard College physics concentrators have been inspired, guided by, and mentored by women faculty members https://t.co/zG129lACvk","date":"Fri May 06 00:05:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Chief Justice John Roberts has called the leak a “singular and egregious breach” and has directed the marshal of the court to investigate its source https://t.co/gYso4PUxHr","date":"Thu May 05 21:28:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 graduate Felix Owusu hopes his research can help eliminate disparities in the criminal legal system https://t.co/MqhRBdmViX","date":"Thu May 05 19:37:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The meteor measured only 1.5 feet wide and was hurtling toward Earth at well over 100,000 mph, which is a clue that it’s not from this solar system https://t.co/3cPNUgaWTa","date":"Thu May 05 15:05:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Exams for undergraduates begin today - good luck everyone! https://t.co/WKeFrqF1tO","date":"Thu May 05 12:37:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Immune cells responding to brain infection and injury come from bone marrow in the skull, and they pass through hundreds of tiny, previously unknown channels https://t.co/FKgYJBbseW","date":"Thu May 05 02:38:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"If the Supreme Court does decide to overturn Roe v. Wade and the legalization of abortion, it will be taking a position that a significant majority of Americans oppose, says @Kennedy_School Professor Maya Sen https://t.co/iPc6MKdCPG","date":"Thu May 05 00:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The research team developed a new approach for processing quantum information https://t.co/wtrICk8ftj","date":"Wed May 04 23:32:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 grad Felicia Pasadyn has been described by her coach as one of the very best to ever swim at Harvard—and she only competed for two seasons https://t.co/l3smvwAkUc","date":"Wed May 04 21:15:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Scholars at @Harvard_Law discuss the unprecedented leak and the implications of the draft opinion moving forward https://t.co/tsWCOZ5rQ3","date":"Wed May 04 18:33:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Speakers at the event, including Ibram X. Kendi and Ruth Simmons, said the Harvard report on ties to slavery is a step toward wider reckoning with a \"massive moral ill\" https://t.co/b4JK04kuWD","date":"Wed May 04 17:54:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The four day Arts First Festival included a multitude of performances and public art demonstrations https://t.co/aIuDJdmt52","date":"Wed May 04 16:04:18 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The leak of a draft majority opinion reversing Roe v. Wade was an unprecedented breach in a process typically shrouded in secrecy and a blow to the nation’s highest court https://t.co/gYso4PUxHr","date":"Wed May 04 14:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Immune cells produced in the spongy tissue of the skull’s bone marrow can screen the cerebrospinal fluid for signs of infection and other threats to the brain https://t.co/FKgYJBbseW","date":"Tue May 03 23:49:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Sixteen Harvard faculty are among the 261 newly elected members of the American Academy of Arts and Sciences https://t.co/Vvoh1mYYhc","date":"Tue May 03 19:05:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“She was my first idea of what a physicist is. It really instilled in me an idea of ‘Oh, this can be me as well.’” #ThankATeacher #TeacherAppreciationDay\n\nRead more: https://t.co/zG129lACvk https://t.co/a57OpP98Uc","date":"Tue May 03 15:47:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As mask ordinances lift in schools, parents may be wondering if their kids will make the decision that’s right for them, or if they’ll be swayed one way because “everyone else is doing it?”  https://t.co/4Knh8TxZta","date":"Tue May 03 12:51:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As the omicron variant continues to splinter into subvariants, questions emerge about how to advance vaccine strategies over the long term https://t.co/QNEGbPOI3d","date":"Tue May 03 02:48:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At last week's @RadInstitute event, keynote speaker Ibram X. Kendi discussed how higher education was complicit in manufacturing and spreading lies that enabled slavery and its ramifications https://t.co/b4JK04kuWD","date":"Mon May 02 22:26:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The findings of a recent study may prompt publishers to consider changing their pay structure in ways that reward writers for originality https://t.co/WhBZybAwhs","date":"Mon May 02 20:40:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Having those people to not only look up to but when they also agreed to mentor you and guide you through the process of doing research makes it so much easier.\" -Maya Burhanpurkar https://t.co/zG129lACvk","date":"Mon May 02 18:55:52 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Neurodegenerative diseases have long been of intense interest for researchers, yet progress in developing effective therapies for such diseases has been slow https://t.co/QTrKVT5oBa","date":"Mon May 02 15:30:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Rather than avoiding hospitals, Jon Hochstein’s experiences receiving a heart transplant made him determined to be part of the health care system that had been so vital to him https://t.co/yE74pWbshd","date":"Mon May 02 13:05:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 graduate Julia Riew was on pre-med track before deciding to change course. She realized she was more drawn to the stage and musical theater than medicine. \"I procrastinated doing my life sciences homework by writing musicals,” she said: https://t.co/TAFxYX3yWK https://t.co/UegJPcH7xj","date":"Mon May 02 00:10:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Healthy sleep is a basic physiologic need, but consistently achieving deep, restorative sleep is difficult for many. https://t.co/R8KvbRgboa","date":"Sun May 01 20:54:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The findings pave the way for better understanding the causes of bipolar disorder and developing more effective therapies that can improve quality of life https://t.co/3fiF07uE8S","date":"Sun May 01 18:56:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Sunshine and studying ☀️ https://t.co/FD2EeyhSHv","date":"Sun May 01 16:43:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The “Monuments\" course aims to prompt critical conversations about public works of remembrance https://t.co/ybzGwDNDVF","date":"Sun May 01 14:55:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Somatic mutations accumulated in the brain cells of patients with Alzheimer’s disease at a faster rate, potentially revealing new pathways to target for treatment https://t.co/3gdbfcgk4E","date":"Sat Apr 30 21:16:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard professors share that the war in Ukraine could be a watershed moment for the evolving notion of meaningful international justice https://t.co/KJ8kcvtyV4","date":"Sat Apr 30 21:06:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“Writing a thesis is unlike any other academic experience I have had. It becomes an all-consuming process and you truly feel like an expert on a niche field.” - Abhishek Malani, #Harvard22 https://t.co/sOco70iYYo","date":"Sat Apr 30 18:20:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Employers looking to fill critical job vacancies may want to turn to a largely untapped pool of willing workers: people with criminal records https://t.co/9gdbNB4zdj","date":"Sat Apr 30 13:31:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Though the pandemic outlook remains favorable in the U.S., there are still some areas of concern https://t.co/XDePJ4MDBw","date":"Sat Apr 30 02:59:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The show gives current students a chance to express their culture and personal interests while giving admitted students a preview into the backgrounds and talents of current @dental_harvard and @harvardmed students https://t.co/xFnzxfiZn2","date":"Fri Apr 29 23:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The Harvard College Class of 2022 chose Boston Mayor Michelle Wu as their Class Day speaker. #Harvard22 https://t.co/DNTmpDvTWi","date":"Fri Apr 29 20:10:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The challenge annually awards nearly $1 million in seed funding to Harvard researchers to support exploratory, high-impact projects in the life, physical, and social sciences https://t.co/5EA8GiwLcK","date":"Fri Apr 29 17:32:16 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Today's \"Telling the Truth about All This: Reckoning with Slavery and Its Legacies at Harvard and Beyond\" conference will be both in person and online https://t.co/r2L4l4IqSS","date":"Fri Apr 29 11:40:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard Law School has announced several initiatives to honor and commemorate the enslaved people whose labor generated wealth that contributed to the school’s founding https://t.co/AqAi7Zelsy","date":"Fri Apr 29 01:22:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Sarah Lewis and Jonathan Corpus Ong are part of a group of 28 awardees who received a stipend from the Carnegie Corporation to devote up to two years to research and writing on high-caliber scholarship and research in the social sciences and humanities https://t.co/QYsILQVN7C","date":"Thu Apr 28 22:03:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Arts First, Harvard’s annual arts festival featuring theater, dance, music, and spoken-word performances, returns to campus for the first time in three years https://t.co/LAvp1AIgvr","date":"Thu Apr 28 18:20:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Jacob Lemieux of @HarvardMed said the Omicron subvariants BA.4 and BA.5 appear to be causing an exponential rise in positivity rates — the percentage of all tests that are positive — and already make up more than 50% of cases https://t.co/XDePJ4MDBw","date":"Thu Apr 28 16:15:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As imaging technology has advanced, so has scientists’ ability to gather extremely high-resolution data about tissues in the human body https://t.co/tsTgJBitK3","date":"Thu Apr 28 13:12:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Boston Mayor Michelle Wu will address the graduating Harvard College seniors at Class Day on May 25. #Harvard22 https://t.co/DNTmpDvTWi","date":"Wed Apr 27 19:04:21 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Studies show that the pandemic had a more severe impact on children and young people already struggling with pre-existing issues https://t.co/ovIOgw2GTc","date":"Wed Apr 27 16:42:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The report describes a history that began with a Colonial-era embrace of slavery that saw more than 70 people enslaved by Harvard presidents and other leaders, faculty, and staff https://t.co/QWKznWEoZn","date":"Wed Apr 27 14:15:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"President Larry Bacow and Dean Tomiko Brown-Nagin wrote this Washington Post opinion piece on the Presidential Initiative on Harvard and the Legacy of Slavery https://t.co/RUXisgdxtt","date":"Tue Apr 26 22:10:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Dean Tomiko Brown-Nagin reflects on the history captured in the Harvard &amp; the Legacy of Slavery report, as well as the recommendations meant to guide the work moving forward https://t.co/GnIYSVZnwt","date":"Tue Apr 26 19:02:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The report on Harvard &amp; the Legacy of Slavery documents Harvard’s ties to slavery—direct, financial, and intellectual—and offers seven recommendations that will guide the work of reckoning and repair https://t.co/OBh50LG54h","date":"Tue Apr 26 15:10:50 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The political, economic, national security, and humanitarian reverberations from the eight weeks of war between Russia and Ukraine are already beginning to reshape the global order https://t.co/1stJRP0N1g","date":"Tue Apr 26 02:05:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“As a First-Gen student, this thesis has truly been a journey for me,\" said Celina Hollmichel, who dove into long-term integration challenges for North Korean and East German refugees for her thesis. \"I loved being able to work on a topic that I am still so passionate about.” https://t.co/yxNdIqz97R","date":"Tue Apr 26 00:05:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new public art installation in Harvard Yard created by students was inspired by the protests against police brutality and the toppling of Confederate statues around the U.S. https://t.co/eOWkAspJqF","date":"Mon Apr 25 21:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The @HarvardGSD has announced that Jeanne Gang and Danielle Allen will address graduates and their families at this year's Commencement ceremonies #Harvard22 https://t.co/wp6h9NmXrR","date":"Mon Apr 25 19:22:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 grad Cecilia Vu says she got hooked on public health when she realized how powerful data could be in shining a light on peoples’ experiences  https://t.co/5ThdkQJcFX","date":"Mon Apr 25 16:11:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A series of national surveys conducted in 1999, 2004, and 2017 provided a baseline for looking at children’s mental health, revealing some troubling underlying trends https://t.co/ovIOgw2GTc","date":"Mon Apr 25 14:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers have identified a vulnerability in ovarian and uterine cancers, as well as a way to exploit it that could inspire new drugs for these cancers https://t.co/GBpyfOiqxD","date":"Mon Apr 25 12:20:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"#Harvard22 grad Marissa Sumathipala concentrated in neuroscience and studied synapses in the human brain, and also competed with the Harvard Figure Skating Club. \n\nRead more: https://t.co/Ro5KrpT6o7 https://t.co/Bhp138eEOF","date":"Sun Apr 24 23:53:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"First awarded in 1981, the Harvard Medal is given to those who have demonstrated extraordinary service to the University https://t.co/A1znwkDgUQ","date":"Sun Apr 24 20:18:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A cause of burnout amongst female physicians is the culture of medicine, which is still male-dominated and has yet to adapt to support the needs of women https://t.co/iVjQWXqirK","date":"Sun Apr 24 17:12:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At Harvard Art Museums at Night, the last Thursday of every month, visitors can mingle in the courtyard, have a drink at the cafe, browse the shop, and of course, wander the galleries to view the world-class collections of art. Learn more: https://t.co/ikasj8M0P7 https://t.co/55bs80QStu","date":"Sun Apr 24 15:16:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Infertility affects about 1 in 5 U.S. women and includes a spectrum of conception difficulties, but its link with heart failure has not been well-studied until recently https://t.co/YLS2TUDziQ","date":"Sun Apr 24 13:41:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A recent report suggests that with every degree of warming, global agricultural production will be reduced by 10 to 25%, threatening the food supply https://t.co/Eaf8Iwip3o","date":"Sun Apr 24 00:31:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The 3D objects found in Harvard’s libraries range from five years old to nearly 500 years old https://t.co/egzW66gRFk","date":"Sat Apr 23 21:09:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The art installation in Harvard Yard features ceramic bricks, designed by students in response to the prompt: “If these bricks could speak, what would they say?” \n\nRead more: https://t.co/eOWkAspJqF https://t.co/RHBiWpJm2E","date":"Sat Apr 23 16:10:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A key objective of the program is to teach students the skills to manage a charged discussion with openness and confidence https://t.co/OjM6mZce01","date":"Sat Apr 23 15:07:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Sahar Mohammadzadeh focused on Neil Gorsuch’s Supreme Court confirmation for her thesis. “I was always fascinated by the role of technology in government, especially through media and journalism.” #Harvard22 https://t.co/X8ePAn7hnh","date":"Sat Apr 23 14:02:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new process eliminates the need for support structures because the resin it creates is self-supporting https://t.co/JSoPBP4ZWb","date":"Sat Apr 23 12:57:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As researchers focus on vulnerable communities in Latin America, students explore potential systems and interventions that can prepare countries to receive an increasingly unpredictable flow of refugees https://t.co/gswkd6Gd3u","date":"Sat Apr 23 03:40:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At a Harvard panel, experts debated the challenges that could undermine today’s efforts to fight climate change https://t.co/a3BdSpn26p","date":"Sat Apr 23 00:51:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“I wanted to understand how I could quantify the relationship between the history of racial injustice and public health, to show that the policies and histories of particular communities have resulted in poor health outcomes.” -Cecilia Vu\n\nRead more: https://t.co/5ThdkQJcFX https://t.co/HENFZXwFQC","date":"Fri Apr 22 23:41:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Throughout the year, @Harvard_Law students, scholars, clinics, and programs work to address some our most pressing environmental issues. #EarthDay  https://t.co/Iai2Kf1Kg5","date":"Fri Apr 22 21:40:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For #EarthDay, members of the Harvard community came together to clean up the banks of the Charles River https://t.co/z2P0yaiO9G","date":"Fri Apr 22 19:06:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"After Harvard, Nolan Altvater plans to return to Maine to continue their work with Indigenous youth https://t.co/8U1ig8jNaj","date":"Fri Apr 22 18:05:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"How much do you know about Earth? #EarthDay https://t.co/kpMOIO1ETH","date":"Fri Apr 22 16:42:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Experts have developed a map showing where the world’s major food crops could be relocated to maximize production and minimize environmental impact https://t.co/Eaf8Iwip3o","date":"Fri Apr 22 14:28:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"From artificial reefs to zero-waste architecture, see some of the ways members of the Harvard community are working to address climate change and its effects. #EarthDay2022 https://t.co/QNzZLRv2j1","date":"Fri Apr 22 12:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The study team developed a genetic risk score for Type 2 diabetes, breast cancer, colorectal cancer, prostate cancer, atrial fibrillation, and coronary artery disease https://t.co/WXgPkV9iDk","date":"Fri Apr 22 03:12:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Although nearly 70% of states have legalized the medical use of cannabis products, some health care professionals are taking a closer look at its effect on the brain. https://t.co/bOskkDFdo6","date":"Fri Apr 22 00:15:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"This yearlong fellowship teaches undergraduate students how to facilitate conversations on contentious issues and build connections across political divisions https://t.co/OjM6mZce01","date":"Thu Apr 21 23:11:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new study finds that women who had experienced infertility had a 16% increased risk of heart failure compared with women who did not have an infertility history https://t.co/YLS2TUlYri","date":"Thu Apr 21 21:01:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Experts at Harvard have presented a method to help 3D printers live up to their names and deliver a “true” 3D form of printing https://t.co/JSoPBP4ZWb","date":"Thu Apr 21 17:32:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Busola Banjoh recently completed her thesis discussing the legacy of excluding colorism from trauma frameworks. \"To be able to dedicate my thesis on the experiences of dark-skin Black women was important and truly wonderful.\" https://t.co/Gt48vreiQT","date":"Thu Apr 21 15:20:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A genetic study involving thousands of people with bipolar disorder has revealed new insight into the condition’s molecular underpinnings https://t.co/3fiF07uE8S","date":"Thu Apr 21 13:02:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Game theory is a tool used to analyze rational and strategic social interactions and decision-making https://t.co/0qiXTsEeiE","date":"Thu Apr 21 02:40:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Two Harvard students were selected as 2022 Truman Scholars, joining a cohort of 58 new scholars that were selected from more than 700 candidates https://t.co/OP6vXrqx4L","date":"Thu Apr 21 01:20:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"While Harvard’s libraries hold millions of books, manuscripts, and photographs, they also hold objects made of wood, metal, glass, and cloth https://t.co/egzW66gRFk","date":"Wed Apr 20 22:41:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As the fastest growing racial or ethnic group in the U.S., AAPI voter participation rates have also been on the rise https://t.co/P4cwhXkR3b","date":"Wed Apr 20 20:04:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The paper explores the mathematics of combing and explains why the brushing technique is the most effective method to detangle a bundle of fibers https://t.co/SD7QvnwjO0","date":"Wed Apr 20 17:18:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Before coming to Harvard, Nolan Altvater was involved in creating curriculum pertaining to a Maine law that mandates all public schools teach the history of Native Americans in the state https://t.co/8U1ig8jNaj","date":"Wed Apr 20 14:20:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Experts at @harvardmed discuss how medicine can help prevent and heal the psychological and sociological wounds that drive violent conflict https://t.co/ZlTDkqkcsr","date":"Wed Apr 20 11:58:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"People who ate at least two weekly servings of avocado had a 16% lower risk of cardiovascular disease and a 21% lower risk of coronary heart disease https://t.co/6J8sMWS9Nr","date":"Wed Apr 20 02:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The research sheds new light on how forgetting takes place in the brain on a systems level https://t.co/FiuyJDdQqx","date":"Tue Apr 19 23:05:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A team of researchers developed a genetic risk score for six common diseases, which could assist doctors and patients when making medical decisions https://t.co/WXgPkV9iDk","date":"Tue Apr 19 21:45:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Women see gains, but Black men see losses in U.S. medical schools\nhttps://t.co/TE4l2Tntuz","date":"Tue Apr 19 19:07:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Two new case studies from @HarvardHBS explore Dick's Sporting Goods' decision to remove certain firearms from stores and restrict gun sales https://t.co/5y5eJ8ctnA","date":"Tue Apr 19 17:53:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Join the mythical creatures scavenger hunt with the @HarvardMuseums! While visiting, be on the lookout for genies, merfolk, centaurs and more. The quest ends May 30. https://t.co/3xpHv7L93c","date":"Tue Apr 19 16:10:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Enjoying the spring weather ☀️ #HarvardInSpring https://t.co/fQmsLjASrY","date":"Tue Apr 19 14:47:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"When we think about progressive brain disorders that cause dementia, we often think of memory problems. But sometimes language problems — also known as aphasia — are the first symptom. https://t.co/qHXKJ0bqdb","date":"Tue Apr 19 12:30:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The Nahuatl language study group meets at Swartz Hall under the guidance of a historian who specializes in Mesoamerican ethnohistory https://t.co/Qg2g5eXUUN","date":"Tue Apr 19 03:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers at @HarvardChanSPH developed a biodegradable material that in a study extended shelf life of strawberries while reducing pollution https://t.co/vdtJXnipuM","date":"Tue Apr 19 00:05:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Congrats to the @Harvard_Law team, who won The Jessup, the world's largest moot court competition! This is the first time HLS has won the international competition, which includes participants from 700 law schools in 100 countries and jurisdictions. https://t.co/YXAriJIWUJ","date":"Mon Apr 18 22:03:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The study shows that forgetting generates a novel brain state that’s different from either the one before the learning happened or the one that exists while the learned behavior is still remembered https://t.co/FiuyJDdQqx","date":"Mon Apr 18 19:34:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"With the U.S. Supreme Court poised to hear the case this fall, lead trial counsel William Lee talks about Harvard’s race-conscious admissions https://t.co/6uI3fKMgs1","date":"Mon Apr 18 17:34:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Alberto Cavallo, a professor at @HarvardHBS, explains how labor shortages, supply chain problems, and other issues related to the pandemic are driving inflation https://t.co/0MJakPas0Z","date":"Mon Apr 18 15:41:30 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The @Kennedy_School is celebrating the 150th birthday of civil rights icon William Monroe Trotter and the advocacy work of the collaborative he inspired https://t.co/5kqa1kk4xS","date":"Mon Apr 18 14:10:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In his these, Michael Baick reframes the history of the small town in Massachusetts by centering the Black and Indigenous people who are missing from the narrative of New England’s past #Harvard22 https://t.co/KCf9sd5DPL","date":"Mon Apr 18 12:22:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Surprisingly, the study found that antibodies that people develop when they contract COVID-19 sometimes lead to more inflammation, while antibodies generated by mRNA COVID-19 vaccines seem not to  https://t.co/5CePPyJTny","date":"Mon Apr 18 00:40:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Spring has arrived on campus 🌸 https://t.co/ElUSrjzcGk","date":"Sun Apr 17 19:21:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What is aphasia? https://t.co/qHXKJ0bqdb","date":"Sun Apr 17 00:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As female representation rose dramatically in U.S. medical schools, the number of Black men in academic medicine stagnated or decreased, according to a new report https://t.co/TE4l2Tntuz","date":"Sat Apr 16 23:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A study led by researchers at @harvardmed and @BostonChildrens explains why COVID-19 causes severe inflammation in some people, leading to acute respiratory distress and multi-organ damage https://t.co/5CePPyJTny","date":"Sat Apr 16 22:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Springtime at @HarvardHBS https://t.co/OagsLFhveH","date":"Sat Apr 16 19:01:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard faculty and students are exploring the benefits of practicing, listening to, and making music https://t.co/PpZEUM38Mu","date":"Sat Apr 16 12:40:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"After suffering a concussion, #Harvard22 grad Marissa Sumathipala was drawn to finding out more about the brain. At Harvard she concentrated in neuroscience and studied synapses in the human brain. https://t.co/Ro5KrpT6o7","date":"Sat Apr 16 02:15:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Game theory helps explain irrational human behavior, which operates well below the surface of our daily awareness, guiding our actions https://t.co/0qiXTsEeiE","date":"Fri Apr 15 23:59:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Research shows that transparency on dating sites—as simple as allowing users to see the identity and photos of those who “swiped right”—improves engagement for both men and women https://t.co/kONibm2qDO","date":"Fri Apr 15 20:43:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Justice Breyer was known for his quirky “hypotheticals,” in which he would ask whimsical questions that represented a genuine effort to try to get to the right answer https://t.co/EXdnfzRSpN","date":"Fri Apr 15 17:49:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“If I thought there was affirmative discrimination against Asian Americans, I would not have been the lead trial lawyer,” said William Lee https://t.co/6uI3fKMgs1","date":"Fri Apr 15 17:01:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"According to Nina Sayles, there are potentially insurmountable hurdles to growing and distributing enough locally produced agriculture to feed the entire nation https://t.co/dbIMfRCBMA","date":"Fri Apr 15 15:33:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Professors at @Kennedy_School discuss what policymakers can do to help keep the doors open for America's most at-risk hospitals https://t.co/qC00z1TLBU","date":"Fri Apr 15 14:45:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A study explains for the first time why COVID-19 causes severe inflammation in some people, leading to acute respiratory distress and multi-organ damage https://t.co/5CePPz1uf6","date":"Fri Apr 15 13:06:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A Harvard expert explains why inflation is at a four-decade high https://t.co/KnbkwqGVLP","date":"Fri Apr 15 02:35:34 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At a virtual Harvard Science Book Talk, metacognition — self-awareness or thinking about thinking — was the topic https://t.co/kRcf7J3KLc","date":"Fri Apr 15 00:13:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Robert L. Ryan, retired senior vice president and chief financial officer of Medtronic, Inc., will serve as the Class Day speaker at @HarvardHBS on Wednesday, May 25 https://t.co/LtPDxvmUcZ","date":"Thu Apr 14 21:31:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In a study of how small groups arrive at their conclusions, researchers found that the same tendencies that influence individuals persist even in company https://t.co/GoEDsTWjHL","date":"Thu Apr 14 19:17:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Music’s ability to create connections across communities, cultures, and even cosmos is well-documented at Harvard https://t.co/PpZEUM38Mu","date":"Thu Apr 14 17:31:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For their production, student directors looked to change up the staging, casting, and structure of the show, encouraging Black and Latinx participation at every level https://t.co/O0f7EdC2K7","date":"Thu Apr 14 15:41:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“What pushed me to ultimately write the thesis was the fact that I genuinely believed it was very important to understand why corporations are getting more involved in the public sphere.” - Jaron Zhou, #Harvard22 https://t.co/kBEMSojs2r","date":"Thu Apr 14 12:35:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"While the modern industrial food system has worked wonders feeding the world, its flaws have also become apparent https://t.co/dbIMfRCBMA","date":"Thu Apr 14 02:28:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Delirium is a serious change in brain function that affects up to 64% of older medical patients and up to 50% of older surgical patients https://t.co/YESIJiCY0j","date":"Wed Apr 13 22:38:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Just doing some math problem sets on an inflatable couch in Harvard Yard. #HarvardInSpring https://t.co/RB1ZXg8JMt","date":"Wed Apr 13 20:40:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Examples of white actors playing characters of color are common, but the course takes a broader and deeper look at representation https://t.co/WYpU0WX882","date":"Wed Apr 13 20:25:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The findings open new avenues of research to understand how brain development evolved in different animals and may even hold clues for regenerative medicine https://t.co/DtuAmrjYai","date":"Wed Apr 13 17:42:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"It's starting to look like spring 🌸 https://t.co/8pcSRwNFOL","date":"Wed Apr 13 15:20:05 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The speakers shared anecdotes and memories that underscored their admiration and fondness for Justice Breyer https://t.co/EXdnfzRSpN","date":"Wed Apr 13 14:05:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard's Schlesinger Library holds a collection of Julia Child’s papers, photographs, audio and video recordings, and private cookbook library  https://t.co/i2nNRtQjYk","date":"Wed Apr 13 13:59:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What role has music played in the pursuit of equity and our understanding of social justice? https://t.co/PpZEUM38Mu","date":"Wed Apr 13 02:28:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For her thesis, Lucy Wickings focused on single motherhood. “I was raised in a single mother household...It was important to me that I chose a thesis topic I was passionate about and had personal experience with.” #Harvard22 https://t.co/ZlW9ICWZwn","date":"Wed Apr 13 00:08:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Research shows that while academic dishonestly looms large on college campuses, students almost never report it https://t.co/voK1FmBK1N","date":"Tue Apr 12 21:58:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Congrats to Harvard College Mock Trial, this year's AMTA’s National Champion! \n\n\"I can say that winning Nationals has been something I’ve dreamed about for years, and it’s surreal to think that it has actually happened!\" -Travis Harper, team co-captain https://t.co/lvAVXhxoPl","date":"Tue Apr 12 21:05:36 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A genetic study involving thousands of people with bipolar disorder has revealed new insight into the condition’s molecular composition https://t.co/92L9jYlSej","date":"Tue Apr 12 18:54:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The dollar amount of corporate donations matters less than other factors, a @HarvardHBS study found https://t.co/mjIGqC4z4V","date":"Tue Apr 12 16:55:05 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Would Russia have invaded Ukraine if the decision were made by a committee instead of President Vladimir Putin alone? https://t.co/GoEDsTWjHL","date":"Tue Apr 12 15:15:04 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“There is so much to love about ‘Into the Woods,’ and we were excited by the idea of taking a really traditional piece of theater and adding our own creative flair and cultural influences.” -Brianna Turner https://t.co/O0f7EdC2K7","date":"Tue Apr 12 13:37:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Justin Morrow said he encountered “structural racism every day” throughout his soccer career, which inspired him to co-found Black Players for Change in 2020 https://t.co/JHxwbW3tdf","date":"Tue Apr 12 00:32:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For her senior project, @hseas student Ursula Volz built a solar-powered autonomous mobile chicken coop https://t.co/HKtT9bzvxh","date":"Mon Apr 11 21:15:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Nearly 60% of Americans say that it is “stressful and frustrating” to have conversations with those who have opposing political viewpoints https://t.co/u992z8hf1G","date":"Mon Apr 11 19:04:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The galaxy, called HD1, was discovered after more than 1,200 hours of observing time with four different telescopes https://t.co/bDN97L8KaA","date":"Mon Apr 11 16:35:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Happy #NationalPetDay from Scout, a resident of Lowell House 🐶 https://t.co/j4dWbWd4wH","date":"Mon Apr 11 13:30:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Panelists agree that rebuilding trust between the CDC and the public should be a top priority https://t.co/JzRgI4WaoT","date":"Mon Apr 11 11:39:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Will the message sent by Amazon workers turn into a movement?\nhttps://t.co/OlqtLDQgty","date":"Mon Apr 11 01:30:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What is an endemic disease? https://t.co/NWYBvUUeri","date":"Mon Apr 11 00:10:15 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"After Ryan Christopher Jones receives his degree from @HarvardExt this May, he will begin a doctoral degree in anthropology at @HarvardGSAS in the fall https://t.co/FpkS9R8vJM","date":"Sun Apr 10 20:45:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Celebrating these Harvard students and siblings on #NationalSiblingsDay! https://t.co/uPW1O7Pydf","date":"Sun Apr 10 16:54:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The exact connection between time and cancer is an area of active investigation, but the fact that the cancers involved are hormone-sensitive points to hormone dysregulation caused by misaligned schedules https://t.co/U62l6omVKF","date":"Sun Apr 10 14:40:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Arthur Brooks shares that for most healthy individuals, additional time spent socially distant from family and friends may worsen a growing national mental health problem https://t.co/ftnCVfSM6W","date":"Sun Apr 10 12:52:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The effects of the COVID-19 pandemic and global automation are making it extremely difficult for millions of the world’s 1.3 billion young people to find work https://t.co/rcEBo8fEvI","date":"Sun Apr 10 01:25:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What is quantum physics and why is it important? https://t.co/KhTwv2NrVi","date":"Sat Apr 09 22:29:10 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The @HarvardEELP's Regulatory Tracker is a learning tool that gives first-year law students hands-on experience with energy and environmental regulation https://t.co/BVHAcoa2Bo","date":"Sat Apr 09 20:50:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A group of pioneering prints from the Brandywine Workshop and Archives now hang on the walls of the @harvartmuseums. \n\nRead more: https://t.co/2WwIU3DrDj https://t.co/964JFBIiue","date":"Sat Apr 09 19:20:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Research has shown that social isolation can have negative effects on health, significantly increasing the risk of depression, anxiety, heart disease, and other conditions https://t.co/ftnCVfSM6W","date":"Sat Apr 09 17:02:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"With a new series and a recent documentary about her life, as well as a cooking competition named in her honor, Julia Child is proving that she is a fascinating and enduring figure https://t.co/i2nNRtQjYk","date":"Sat Apr 09 14:15:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Researchers also found that replacing animal products with an equivalent amount of avocado was associated with a lower risk of cardiovascular disease events https://t.co/6J8sMWS9Nr","date":"Sat Apr 09 12:21:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Ryan Christopher Jones spent years covering stories of labor, migration, and the environment in Mexico before he found a course at the Extension School that changed his life https://t.co/FpkS9R8vJM","date":"Sat Apr 09 02:04:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“We want and deserve to see people like us represented truthfully and fairly; we want and deserve to see people like us succeed in the arts and in other realms.” -Derek Miller https://t.co/WYpU0WX882","date":"Fri Apr 08 23:03:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The cancer-time connection surfaced more than a decade ago, when studies showed that night workers had higher rates of the disease https://t.co/U62l6omVKF","date":"Fri Apr 08 21:36:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Earlier this week, the CDC announced that the agency will undergo a monthlong review to evaluate potential reforms https://t.co/JzRgI4WaoT","date":"Fri Apr 08 18:34:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A touch of spring on campus 🌺 https://t.co/Bgk4PEmrJ5","date":"Fri Apr 08 17:28:06 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Two Ukrainian American @harvardmed professors discuss their recent efforts providing support and resources to the people of Ukraine https://t.co/VMUkrsYvwj","date":"Fri Apr 08 15:35:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Students at @Harvard_Law gathered yesterday to watch the historic vote to confirm Ketanji Brown Jackson, who is an HLS alum, to the U.S. Supreme Court. The event was hosted by @WLAHarvard, @HarvardBLSA, and HLS Student Government. https://t.co/mrbYeFFxgT","date":"Fri Apr 08 14:41:55 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The galaxy may be forming stars at an astounding rate and is possibly home to the universe’s very first stars—which, until now, have never been observed https://t.co/bDN97L8KaA","date":"Fri Apr 08 12:20:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Growing up, @hgse alum Matthew Grimes had a baseball field close to his apartment, and a love for the game. After graduation last May, he ended up with a job overseeing diversity, equity, and inclusion for a Major League team. https://t.co/WMfV1vOU0D","date":"Fri Apr 08 02:10:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The recent Amazon union vote is a significant victory, says Harvard labor economist Lawrence Katz, but serious challenges remain for labor activists https://t.co/OlqtLDQgty","date":"Fri Apr 08 00:06:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new study shows that the repercussions of surviving firearm injuries extend far beyond the immediate aftermath of the injury https://t.co/JL9N6Y8QD7","date":"Thu Apr 07 21:51:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Florida’s Parental Rights in Education bill will likely face First Amendment and Equal Protection Clause challenges, says @HarvardLGBTQ Director Alexander Chen https://t.co/LSM22Y7QEI","date":"Thu Apr 07 19:37:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Making great hires is about recognizing great matches—and often they’re not what you’d expect https://t.co/YCt7JL1Fuh","date":"Thu Apr 07 18:46:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"When Adele Houghton started working on her own projects, she realized something important was often left out of planning process: the health and wellbeing of the future occupants https://t.co/F48XBiwJWd","date":"Thu Apr 07 15:54:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Findings show that people who ate at least two weekly servings of avocado had a 16% lower risk of cardiovascular disease and a 21% lower risk of coronary heart disease https://t.co/6J8sMWS9Nr","date":"Thu Apr 07 12:42:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Communities with a high percentage of residents who are vaccinated or who have had COVID-19 are likely to have lower death rates https://t.co/kh4LrOdJSY","date":"Thu Apr 07 05:05:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What's ahead for Ukraine in the coming weeks? @HarvardChanSPH's Claude Bruderlein shares his views. https://t.co/9BhdVXP0Em","date":"Thu Apr 07 01:44:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"Taeku will bring to Harvard both an exciting and innovative research and teaching agenda on issues and populations too long underrepresented in our scholarly agendas and curriculum.\" https://t.co/LMUzH3Yhta","date":"Wed Apr 06 23:50:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Nearly 60 years after Julia Child first appeared on television as “The French Chef,” she is still inspiring home cooks and fascinating TV producers and filmmakers. Why? https://t.co/i2nNRtQjYk","date":"Wed Apr 06 21:10:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Carrie Moore has been named the new @HarvardWBB head coach. Welcome to Harvard! \n\nRead more: https://t.co/kzeboaAteZ https://t.co/2BXVj7uQi7","date":"Wed Apr 06 19:05:09 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"“We did the trial to see if we could learn something new about the biology of cancer cells and in the process found this unexpected, very encouraging result.\" -David Ting https://t.co/TXWKzhiMJs","date":"Wed Apr 06 17:50:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In her new book, Nicole Yunger Halpern dissects a new branch of science by fusing steampunk fiction with nonfiction and Victorian-era thermodynamics with quantum physics https://t.co/maaHGZIbL4","date":"Wed Apr 06 16:26:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"According to Eddie Glaude, the nation is currently in the throes of a white reprisal to the racial reckoning sparked by the police murder of George Floyd https://t.co/bkv940nN63","date":"Wed Apr 06 14:16:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Justin Morrow is spending the year analyzing historic and contemporary social movements and athlete activism, and interviewing athletes pushing for change https://t.co/JHxwbW3tdf","date":"Wed Apr 06 11:45:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"One of the biggest changes since Joseph Stiglitz released his book in 2012 is the role politics plays in both shaping the discourse about inequality and creating it https://t.co/qTrVyHg9gC","date":"Wed Apr 06 02:07:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Is it possible to avoid trade-offs between returning to pre-pandemic lifestyles and an uptick in COVID-19-related deaths? https://t.co/kh4LrOdJSY","date":"Tue Apr 05 23:46:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These are some of the beautiful libraries at Harvard 📚  #NationalLibraryWeek https://t.co/oYBtlg3U7H","date":"Tue Apr 05 22:00:17 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In June, Allyson Hobbs will lead the alumni parade as part of Harvard Alumni Day and host a special luncheon in Widener Library https://t.co/WxeMdDrGXq","date":"Tue Apr 05 20:29:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"DNA analyses of ancient individuals buried in what is now Belize have introduced a plot twist to the story of how hunting and gathering transitioned to farming in Mesoamerica https://t.co/I8nSdfhvk4","date":"Tue Apr 05 18:12:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"If the Beatles suddenly appeared for the first time on TikTok, would their exceptional talent be as apparent and embraced as it was in the early 1960s? https://t.co/25HcwX4PYl","date":"Tue Apr 05 15:50:03 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Based on participant-centered learning, the instructional approach of the case method facilitates discussions about real-life problems encountered in business https://t.co/Yf5HeqyPQf","date":"Tue Apr 05 12:09:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Author Eddie Glaude told a @Kennedy_School audience that while there have been historic racial achievements over the past two years, the counter-reaction has been fierce https://t.co/bkv940nN63","date":"Tue Apr 05 02:41:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"\"There are enormous practical considerations displaced people must navigate, from things as immediate as finding water, food, and shelter to obtaining information.\" -Daniel Farber Huang https://t.co/dL1YyjRz9G","date":"Tue Apr 05 00:30:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Since the release of Joseph Stiglitz’s book, data and analysis have brought the harms and expansive growth of economic inequality into sharper focus https://t.co/qTrVyHg9gC","date":"Mon Apr 04 20:54:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"A new study shows that participants who were on the green Mediterranean diet had a greater reduction in brain atrophy https://t.co/hnBtydgWEf","date":"Mon Apr 04 17:32:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Hundreds of studies find that human beings routinely make social comparisons, intentionally or unintentionally https://t.co/1TKygYPMMj","date":"Mon Apr 04 16:07:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"What do quantum computers have to do with smog-filled London streets, Sherlock Holmesian mysteries, and brass goggles? https://t.co/maaHGZIbL4","date":"Mon Apr 04 13:24:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The admitted Class of 2026 hails from all 50 states, the District of Columbia, Puerto Rico, and 98 countries https://t.co/Z79IhOmXuv","date":"Mon Apr 04 02:40:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Research indicates that one way to avoid envy involves appreciating the collective good https://t.co/1TKygYPMMj","date":"Mon Apr 04 00:15:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"People from all over the world visit Harvard Yard and make sure to stop (and take a photo) at the John Harvard statue. Daniel Chester French, famous for his later sculpture of Abraham Lincoln in D.C., created our John Harvard statue in 1884. https://t.co/NWTZ9oZwBf","date":"Sun Apr 03 20:34:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Why do some bands catch fire while others don’t? Is it a matter of talent or are there other factors? https://t.co/25HcwX4PYl","date":"Sun Apr 03 18:41:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"President Biden’s cancer “moonshot” has been described as a reboot of the original, but specialists say the effort is a reassessment with new goals and a welcome focus on prevention https://t.co/xPFzYReie2","date":"Sun Apr 03 17:51:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Recent peace talks between Russia and Ukraine have drawn skepticism from U.S. officials https://t.co/pPnJGxM9L5","date":"Sun Apr 03 13:09:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"These are some of the artists showing their work in the Harvard Staff art show. \n\nSee more: https://t.co/jY0inf0IhN https://t.co/LvKgECRpgz","date":"Sun Apr 03 01:55:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard Law student Suleyman Wellings-Longmore wanted to create a platform for other Black creatives across Harvard’s campus. He is organizing an upcoming exhibition, “All That We Are,” at the Smith Campus Center. https://t.co/BBXYN5y4Om","date":"Sun Apr 03 00:15:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"For years, @HarvardExt alum Daniel Farber Huang has traveled the world capturing the plight of refugees. He and his wife, Theresa Menders, both documentary photographers, recently traveled to the Ukraine-Poland border to chronicle the situation there. https://t.co/w3MatEg0uB","date":"Sat Apr 02 22:27:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Beginning with the Class of 2026, families with annual incomes of $75,000 or less will not pay anything toward the cost of a Harvard College education. Nearly 1 in 4 undergraduates comes from a family whose annual income qualifies. https://t.co/Z79IhOmXuv","date":"Sat Apr 02 20:23:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Optimism for halving the cancer death rate stems from advances over the past two decades in understanding cancer biology, which has translated into more effective treatments https://t.co/xPFzYReie2","date":"Sat Apr 02 18:30:02 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"The sun is shining at @dental_harvard ☀️ https://t.co/2VbElIsCAI","date":"Sat Apr 02 17:00:27 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Zoë Hitzig, @HarvardGSAS student, argues that the values embedded in an algorithm reflect those of the people who design and implement it https://t.co/TPcadcw2dm","date":"Sat Apr 02 14:10:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Harvard psychologist Anna Precht says the \"debacle\" at the Oscars is a result of the messages men and boys are given about masculinity https://t.co/d64zA0oUCw","date":"Sat Apr 02 01:35:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Since the 1920s, @HarvardHBS has been an innovator in the development and refinement of teaching with the case method https://t.co/Yf5HeqyPQf","date":"Fri Apr 01 23:06:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Russian forces pounded areas around Kyiv and another Ukrainian cities just hours after Moscow pledged to scale back military operations in those places https://t.co/pPnJGxM9L5","date":"Fri Apr 01 20:11:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"At last weekend's Junior Family Weekend, families visited their students and got a feel for campus life https://t.co/aK8v2QkAqz","date":"Fri Apr 01 17:03:09 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"As fans of March Madness cheer upsets, no-look passes, and clutch shots, Harvard biologist Hopi Hoekstra has been documenting whether team mascots are really what they say they are https://t.co/gfsZXydcTy","date":"Fri Apr 01 15:57:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Nearly 3.9 million Ukrainians have fled the country as of March 27 to escape the escalating bloodshed of the Russian invasion https://t.co/dL1YyjRz9G","date":"Fri Apr 01 14:37:01 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"Beginning with the Class of #Harvard2026, the cost to attend Harvard College—including tuition, room, board, and all fees—will be free for families with annual incomes below $75,000 https://t.co/Z79IhOmXuv","date":"Fri Apr 01 13:19:00 +0000 2022","user_id":"39585367"},{"handle":"harvard","text":"In a conversation with students, Lady Gaga discussed nurturing her passions, building a global community centered in liberation and justice, and her advocacy for the LGBTQ+ community https://t.co/GdVV4aOSFj","date":"Fri Apr 01 11:55:01 +0000 2022","user_id":"39585367"}]