[{"handle":"iupedu","text":"IUP aims to support every student who sets foot on campus. Offering a range of services for the LGBTQIA+ community is a key part of that. Hear about one student's experiences and about the support IUP provides. #Pride2022 #IUPProud https://t.co/GOJjsN47TS","date":"Wed Jun 22 13:36:26 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Welcome to summer in Indiana! ☀️ https://t.co/Yltjv9Svr0","date":"Tue Jun 21 19:23:11 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Meet Abra Dadum, a chemistry major from Pittsburgh. She learned a lot joining U-SOAR this summer as she worked on her research project, but one of the best parts for her was working with her faculty mentor. https://t.co/cYwLTm3Gtr https://t.co/lGM59CNCGY","date":"Mon Jun 20 17:06:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Celebrating hope, freedom, and progress. #Juneteenth https://t.co/ZP88FHpbhP","date":"Sun Jun 19 14:55:05 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"IUP has designated more than 70 all-gender restrooms across campus. Follow the link to see them on the interactive map or by downloading a poster with specific locations. https://t.co/egBfoYvvpw #IUPProud #Pride2022 https://t.co/Kbzmr1MvWE","date":"Fri Jun 17 20:41:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Have questions? We have answers. Register for Total Transfer Day Wednesday, June 22 so you can have one-on-one guidance that takes you through the transfer application process in one day! https://t.co/ZgcyVR80Mi https://t.co/nhu8f1umE8","date":"Fri Jun 17 17:06:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Meet Abigail Hancox, a political science major with a pre-law concentration and minor in homeland security in the Cook Honors College. She has just been confirmed to serve as a member of the Pennsylvania State System Board of Governors. Way to go Abigail! https://t.co/GA1lLiPEZs","date":"Thu Jun 16 23:41:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Meet Steven Lomax, majoring in political science, with an emphasis on homeland security. Through IUP, he found that he wanted to help people going through emergency situations. This and other stories can be found in our 2021 President’s Report. https://t.co/cYwLTm3Gtr https://t.co/oX25UwnQol","date":"Thu Jun 16 20:13:07 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Orientation officially started Monday and we're so excited to welcome some new faces to campus! https://t.co/DzCaP9S4y6 https://t.co/CdPKMHFKLw","date":"Wed Jun 15 19:20:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"IUP has been recognized as second in the state for affordability, third in the state as a “best public college,” and in the top 20 in the state as a “Pennsylvania’s Best Overall” university by https://t.co/YIIC84CXrh. We are #IUPProud. 🎉 https://t.co/MWpFJb7J0i https://t.co/a5EXSeBzr8","date":"Wed Jun 15 16:49:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are so hungry now! Kala Vargo, a 2019 culinary arts grad and current admissions counselor, has been helping our chefs teach our culinary students how to photograph their work. 🥘 Want to have lunch at the Academy of Culinary Arts? Call 814-938-8400 to be added to the waitlist. https://t.co/bJ3iCLYIlE","date":"Wed Jun 15 14:47:26 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Attending college this year was challenging in all-new ways, but you did it. What summer session classes are you taking, Hawks? Let us know! 📚 https://t.co/Ce0CskSxlq","date":"Mon Jun 13 19:32:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Squirrels are running free on an empty campus and missing their Hawks. Tap ❤️ if you miss them, too. https://t.co/KqnaT9Vsqp","date":"Fri Jun 10 20:38:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"At IUP, students come first. From new facilities and support services to enhanced research and scholarship opportunities, we're committed to fostering a culture of exceptional student centeredness. Find out more in our 2021 President’s Report. https://t.co/4KpptLkSOL","date":"Thu Jun 09 18:07:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"It's not too late to sign up your little ones for Footlight Players. A youth theater company that provides young kids opportunities to discover their creativity in a safe, nurturing environment led by professional teaching artists. https://t.co/tnM7Y4trco https://t.co/VwjHJ7zmfB","date":"Wed Jun 08 19:40:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Over Memorial Day weekend, IUP Men’s Rugby team traveled to New Orleans for the 2022 May Madness Rugby 7s National Championship matches. The team went 6-0 and paved their way to the program’s first-ever national championship. Way to go! We are #IUPProud https://t.co/BcIHaQTBtr https://t.co/WrZtSMbBnW","date":"Tue Jun 07 21:14:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Meet Liv/Ollie Martin, a Spanish education major who identifies as genderfluid. \"Having specific safe space on campus for LGBTQIA+ students, progressive pride flags flying in the Oak Grove makes me not only know I'm accepted by also welcomed at IUP.\" https://t.co/aLGD7L2HLu","date":"Fri Jun 03 20:22:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"@HerbivoreBand Yes, you're looking at Grant Street Park, which used to be Grant Street.","date":"Thu Jun 02 20:44:06 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Campus is quiet without you, Hawks! What are your summer plans? Internship? Studying abroad? Let us know below or use the hashtags #IUPInternships or #IUPHawksAbroad ☀️ https://t.co/Aa9igmEDo6","date":"Thu Jun 02 20:13:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Happy Pride Month, Hawks! We've updated our logo to include our Progress Pride flag that brings focus on inclusion and progress within the community. #PrideMonth #IUPProud https://t.co/QtyOuLcaRQ","date":"Wed Jun 01 13:29:11 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"#IUPProud","date":"Tue May 31 13:07:58 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Today, we remember those who served and honor their sacrifice. #MemorialDay #IUPProud https://t.co/H86z5J0iEx","date":"Mon May 30 15:49:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Got off track this past year? No worries - you still have time to catch up and register for Summer Sessions. You can find more information here https://t.co/fDfvVe0AOL https://t.co/GVLSmu8Vjv","date":"Thu May 26 16:48:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Effective this fall semester, IUP will lower tuition by almost 20% for most of our students. Click here to learn more. https://t.co/j0ok3Hiq7F https://t.co/p0PqK9KeYg","date":"Mon May 23 19:40:17 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Today is #BiketoWorkDay! Where are you headed? 🚴 https://t.co/OciwVRt3mD","date":"Fri May 20 15:23:22 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"New to IUP in the fall? Make sure you're signed up for orientation so you'll know what to do from day 1. Find the available dates here https://t.co/al399SNoqL https://t.co/l0seaIpPYQ","date":"Thu May 19 20:35:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Alumni, students, and friends of IUP are invited to cheer on the Pittsburgh Pirates together at PNC Park this Friday, May 20 against the St. Louis Cardinals! Click here to purchase your tickets https://t.co/oiJquf7st0 ⚾ https://t.co/bTiBSflrU8","date":"Mon May 16 18:28:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are still celebrating the Class of 2022! 🎓 Wishing all our graduates success in their futures. #IUPproud #IUPCongrats https://t.co/VKSIN270zT","date":"Thu May 12 19:07:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Working an internship this summer? Studying abroad or having an awesome out-of-class experience?  Comment below what you are up to and use the hashtag #IUPInternships or #IUPHawksAbroad so we can shout you out! ✈️ https://t.co/MuLVvL7vCF","date":"Wed May 11 20:01:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Fallen trees from the Oak Grove are sawed into boards and used in student art projects in the Wood Center. Students experience the complete process, from logs to finished art, thanks to IUP’s innovative woodworking program. #IUPInnovators https://t.co/Nak9hgzXnA","date":"Wed May 11 13:07:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Stay on track this summer with Summer Sessions, whether you're living in Indiana or you're back home. Visit here https://t.co/Qnux0e2mSB to get more info. ☀️ https://t.co/Twz9Z2Cqtb","date":"Tue May 10 19:36:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Yesterday was graduation day! Congratulations to the Class of 2022. Don't forget to share your celebration using #IUPcongrats! https://t.co/Sd3NNAkT0D","date":"Sun May 08 12:52:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Following Research Appreciation Week in April, IUP's Office of Graduate Admissions team organized a project to recognize and appreciate the nursing staff at IRMC. They created over 360 gift bags for members of the nursing staff! #IUPproud https://t.co/YG19RYrBVp","date":"Fri May 06 20:59:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Congratulations to the IUP master’s and doctoral Class of 2022! Share your celebration using #IUPcongrats! Watch the livestream of the commencement ceremony: https://t.co/mtbau3uVB9 Undergraduate ceremonies will be held tomorrow at 9AM and 2PM and will also be livestreamed. https://t.co/8KrzOkMC0k","date":"Fri May 06 19:29:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Don't forget to tag us in your graduation pictures like Hannah did to be featured this weekend!🎓 https://t.co/C27807ZkV3","date":"Thu May 05 17:01:10 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"You are almost there! Only a few more days and you'll finish another semester.🎉Looking for a new study space? Hungry? Need a break?  Check out our list of finals resources. https://t.co/Y1xfUjEGzx https://t.co/y3JAloOOx5","date":"Wed May 04 20:17:09 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"#TalonsUp","date":"Tue May 03 15:02:37 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll talks about the Hawks Helping Hawks campaign, the newest hawk on campus, next steps outlined in his “The Future of IUP” speech, and good news about IUP’s membership in the American Passport Project program. https://t.co/whRba5V0fc","date":"Tue May 03 13:30:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Happy Finals Week, Hawks! Let's finish the semester strong. Come destress tonight over pancakes. 🥞 #IUPproud  https://t.co/Y1xfUjEGzx https://t.co/tgEqmXvqJb","date":"Mon May 02 20:34:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Luke Faust makes sure students have the support they need to succeed. He knows how to help, because he was once there, struggling in college. Imani Jefferson attests to the life-changing experience she had at IUP with Faust’s support. https://t.co/NKC1GfFgwo","date":"Mon May 02 12:43:44 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Today is #NationalCollegeDecisionDay! Show us you’re proud to join the IUP Class of 2026 by tagging us and using #IUPBound. Haven’t made your decision yet? What are you waiting for? There's so much to love about IUP! https://t.co/S9qJ2OcNlw","date":"Sun May 01 13:04:23 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Finals Week is around the corner. Take a break and stop by the STATIC Cookout today from noon to 4 p.m. to fuel up. https://t.co/Y1xfUjEGzx https://t.co/rFLNkTh4ZE","date":"Sat Apr 30 13:56:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Today is Chalk the Walk and it’s a beautiful day in Indiana! We hope you’re outside enjoying the weather. ☀️ Tell us how you are spending your weekend below. https://t.co/mqWFnz0BN4","date":"Fri Apr 29 16:45:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"See you tomorrow! https://t.co/PpGuhWuvZH","date":"Thu Apr 28 15:28:20 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are so close to finals which means we are that much closer to summer. What are your summer plans? ☀️ Let us know. #IUPproud https://t.co/mlZAc1qjHF","date":"Wed Apr 27 21:37:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Professor Ivan Fortushniak’s painting students have been working on a mural for the College of Arts and Humanities that celebrates the college’s merging of two branches of learning. The mural will be installed in Leonard Hall next fall. https://t.co/tKaVnHsfZG","date":"Mon Apr 25 17:35:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Due to predicted cold weather, this year's Chalk the Walk event has been moved from Wednesday to Friday, April 29. We provide the chalk, t-shirts, and prizes—you create any social, political, or other comment you want. https://t.co/6xtEyvaAgv https://t.co/Hm4ko3XO3f","date":"Mon Apr 25 15:07:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Headed to Indiana today to Experience IUP? Be sure to tag us using #IUPbound and tell us all about your day! https://t.co/f2TscLwwiN","date":"Mon Apr 25 13:15:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We highly recommend early morning walks on campus when the spring flowers are out. Can't make it to campus? Not a morning person? We've got you covered. https://t.co/AyDpsoDloo","date":"Sun Apr 24 13:07:19 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Effective this fall, IUP will lower tuition by almost 20% for most of our students. Click here to learn more. https://t.co/j0ok3Hiq7F https://t.co/nzRMAdMXVQ","date":"Fri Apr 22 20:41:16 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"If you’re an IUP first-year student or senior, check MyIUP to take the National Survey of Student Engagement and help us improve the college experience. This is the last day to enter our Amazon gift card drawing! https://t.co/hhRpkQPgEO https://t.co/HGLC3Wam7H","date":"Thu Apr 21 18:55:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Join us Thursday, April 21 at 8pm in Fisher Auditorium and see the award-winning PUSH Physical Theatre. It's like watching a live-action movie with talented group of performers with physical illusions and gravity-defying, dance-infused, acrobatic high-jinx.https://t.co/ahUuafjv7H https://t.co/6gPMVxvi5p","date":"Wed Apr 20 18:20:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We welcome IUP alumni and students to the 42nd Annual Business Day. #IUPProud https://t.co/YlpnYIroG9","date":"Wed Apr 20 14:49:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Haven't registered for open house yet? What are you waiting for? Join us this Saturday (4/23) for full-day, in-person extravaganza, where you’ll get to experience a little bit of everything here at IUP. https://t.co/5h9egep33h https://t.co/sZKH1jAUQq","date":"Tue Apr 19 19:54:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Michael Driscoll talks about the success of recent events, a major gift to advance the IUP Academy of Culinary Arts building project, and the Unity Ball, a reinvented initiative focused on diversity, equity, and inclusion.\nhttps://t.co/dsbvr1SaNa","date":"Tue Apr 19 14:10:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Four students talk about the friends, mentors, and opportunities they’ve gained through the Crimson Scholars Circle, a scholarship program designed to reduce the retention and persistence gap for Black and Brown students. https://t.co/nMIWltBexU https://t.co/KzfI0UMWb9","date":"Mon Apr 18 14:50:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Reminder for all students: join Pres. Driscoll, IUP leadership, professors, and student leaders today for an open discussion on the topics that matter most to you. See you in Folger at 11:30 a.m.! https://t.co/c28fyisjRB","date":"Mon Apr 18 12:53:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Who’s joining #IUP26 this fall? ✋ https://t.co/6O7F1DjPVS","date":"Thu Apr 14 21:52:13 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"April is National Sexual Assault Awareness Month. The Haven Project and the IUP and Indiana communities took part in Take Back the Night, a march through IUP campus to show support for victims and survivors of sexual violence. https://t.co/nZ6cL1TWni https://t.co/vDsav4ydsG","date":"Thu Apr 14 18:58:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Students, we need to hear from you! Join us for a town hall and open discussion on the topics that matter most to you in the Folger Student Center on Monday at 11:30 a.m. https://t.co/CrNIfSUBNr","date":"Thu Apr 14 17:07:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Once a year we celebrate the volunteers, alumni and friends that make us #IUPproud. https://t.co/15H8ypQsI2 https://t.co/luypIW6ZyQ","date":"Wed Apr 13 20:20:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Next week's 6:00 Series is a talk about free speech on university campuses, presented by the president and CEO of the National Constitution Center. Join us in the HUB Ohio Room at 6:00!","date":"Wed Apr 13 15:00:05 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Are you attending Experience IUP today? Don't forget to tag us using #IUPbound and tell us all about your day! If you've been admitted and haven't been to Experience IUP yet, April 25 is the last one. Don't miss out, sign up today at https://t.co/hg0ZKgzxj3 https://t.co/k9IhYUM6dh","date":"Mon Apr 11 19:55:18 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Hear the impact of IUP’s record-breaking Imagine Unlimited campaign from four students: scholarship recipients in chemistry and football, a grad assistant promoting fairness in policing, and a food pantry worker who has connected hundreds with meals. https://t.co/1zWezw2z8e","date":"Mon Apr 11 15:22:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Tonight we congratulate seven alumni as they are awarded the Distinguished Alumni Award. 🎉 #IUPproud https://t.co/pnQgHnoETZ https://t.co/4Zm8IauipQ","date":"Sat Apr 09 22:00:07 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are thankful for our alumni and our donors. Your investments in IUP have and will continue to make a real impact on our students. #IUPproud https://t.co/XTl8OxlJZ1 Learn more here: https://t.co/pnQgHnoETZ","date":"Fri Apr 08 21:00:16 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Research week is wrapping up! Ready to get involved in your own research? U-SOAR is the best way to do that. Funding is available, too! Applications are due next Friday. Get all the details here https://t.co/wJZ0PGZfvv https://t.co/wBAJUzU46a","date":"Fri Apr 08 14:19:24 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Check out what's going on today for Research Week or click here https://t.co/MYCylTcULK https://t.co/XjNNDEVVAf","date":"Fri Apr 08 12:47:22 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Just got admitted into IUP and not sure what to do next? Come Experience IUP next Monday, April 11 or Monday, April 25 and learn more about what it is like to be a student at IUP. #IUPbound https://t.co/hg0ZKgzxj3 https://t.co/bMUZSasmaa","date":"Thu Apr 07 21:33:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Today's Research Week event: IRMC day! The morning over 150 professionals and IUP students attended the inaugural IRMC Day, a half-day conference featuring partnership discussion on rural health care, research projects, and health care initiatives. #ThisIsIUPResearch https://t.co/mpvptcYqsp","date":"Thu Apr 07 18:55:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Got an opinion? Chalk it down! The annual Chalk the Walk sidewalk in the Oak Grove is less than a month away on April 27 and we can't wait to see you there. https://t.co/Ya7qkcB5Gl","date":"Wed Apr 06 22:37:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"It's Open House season! Join us Saturday for a full day of IUP adventures including everyone's favorite, a campus tour with our Crimson Guides! Register here: https://t.co/5h9ege7rEH https://t.co/rjfai6woW9","date":"Wed Apr 06 20:20:08 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We can't believe commencement is a month away. Come take care of all your graduation needs at the Spring 2022 Graduation Fair this Thursday, April 7 from 9AM-5PM, in the HUB Ohio Room. https://t.co/Nladl3xlVy","date":"Wed Apr 06 18:21:17 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Check out the Scholars Forum until 2pm at KCAC. https://t.co/lpi4WnAZO7","date":"Wed Apr 06 16:20:30 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Biology professor Shundong Bi not only identified a new species of dinosaur, but he also named the discovery after John Kopchick, the IUP alumnus and donor for whom—along with his wife, Char—the science college and its future home are named. https://t.co/EWuCTD566h https://t.co/07s3BxuO5L","date":"Wed Apr 06 15:53:23 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Check out what's going on today for Research Week or click here https://t.co/MYCylTcULK https://t.co/fPg5iYVz47","date":"Wed Apr 06 12:26:47 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The Scholars Forum is a chance for IUP grad and undergrad students to present original research, scholarly activities, and creative endeavors. Basically, some really awesome stuff. Stop by and check it out tomorrow in the KCAC from 9am-2pm https://t.co/g0kWcMfFJK https://t.co/WJeLJ7Vg4P","date":"Tue Apr 05 19:52:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Time is running out! Share your thoughts to make a difference. If you’re an eligible first-year student or senior, check your IUP email and MyIUP for details. https://t.co/hhRpkQPgEO https://t.co/3TxKXLMlz4","date":"Tue Apr 05 17:07:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Check out what's going on today for Research Week or click here https://t.co/MYCylTcULK https://t.co/BhPK1joOwZ","date":"Tue Apr 05 13:34:46 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Do you even research? Our students do! This week is Research Appreciation week when we get to celebrate the amazing research of our students and faculty. Check out the schedule for the week to see how you can take part. https://t.co/MYCylTcULK https://t.co/lEjcEN779q","date":"Mon Apr 04 16:05:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Check out what's going on today for Research Week or click here https://t.co/MYCylTcULK https://t.co/tP3q1aXnPI","date":"Mon Apr 04 15:21:21 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Another group of students signed the Class of '26 Hawk earlier this week at Experience IUP Day! Share your pics and tells us about your day using #IUPbound https://t.co/DWFpmiy7sh","date":"Fri Apr 01 16:13:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"@EricaMarasco We've removed you from the IUP Magazine mailing list. Are there any other mailings arriving at your parents' house?","date":"Wed Mar 30 18:29:32 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Jeff Larkin, @IUPBiology professor, uses his expertise in working landscapes as part of a team targeting coffee production’s environmental impact and exploring the use of solar power, carbon credits, and new farming methods to save forests. https://t.co/1yG83ejbZ2","date":"Tue Mar 29 19:35:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Michael Driscoll talks about the successes of IUP student-athletes and Day of Giving and offers reminders about important upcoming university events, including Research Appreciation Week. https://t.co/H6pKzYiBMQ","date":"Tue Mar 29 12:46:32 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Jim Self is a Distinguished Alumnus and Hollywood session tuba player. He was the “Voice of the Mothership” in Close Encounters of the Third Kind: https://t.co/OO69i4jZTY Check out Jim Self in concert this week. https://t.co/op3xaB9wep https://t.co/g6x11ZlDrR","date":"Mon Mar 28 21:03:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"It's been quite the ride for our Crimson Hawks! They ended their playoff run with a sparkling 33-3 record. Let's show them how proud we are and welcome them back from Evansville today at 7:00 p.m. at the Memorial Field House. #IUPproud https://t.co/MZdsyxgDYP","date":"Fri Mar 25 21:03:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Considering pursuing a graduate degree at IUP? 🎓 You won't want to miss the Graduate Admissions Virtual Open House next Wednesday at 6PM. https://t.co/t2KvZntXHc Get your questions answered and hear more about the application process. https://t.co/qDrZR2KDwM","date":"Fri Mar 25 19:24:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Our IUP alumni and friends have done it again! You broke our #IUPGivingDay goal in record time. 🎉 Can we double that goal in the last six hours? Are you up to the challenge? Impact an IUP student. Donate today. #GoHawks 🏀 https://t.co/GSSpXo6Y8r https://t.co/Bqqo3EQWi6","date":"Thu Mar 24 22:00:07 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"10 students have already won Amazon gift cards, and there’s still time. If you’re an eligible first-year student or senior at IUP, we want to hear from you. Take the NSSE Survey by April 21 for a chance to win! Check your IUP email and MyIUP for details. https://t.co/hhRpkQPgEO https://t.co/DInK7cCu1g","date":"Thu Mar 24 19:00:19 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"It's semifinals day 👀🏀 @IUP_MBB will take on Augusta tonight at 6:30 EST. Be a part of the action and join a watch party: https://t.co/FHlQrt5tqU https://t.co/UD1aSvPBVl","date":"Thu Mar 24 17:09:17 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Show off your Crimson Hawk spirit. Post a picture below to show you're #IUPproud and unlock an additional $5,000 in scholarship funds. #IUPGivingDay https://t.co/GSSpXo6Y8r https://t.co/yVeAj8A3hP","date":"Thu Mar 24 17:00:30 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"IUP students excel both in the classroom and on the court. On #IUPGivingDay, you hold the key to unlock $50,000 in scholarship support. Your gift enables students to live their dreams. Challenge: share this post and you could unlock more money. https://t.co/GSSpXo6Y8r https://t.co/bQX0mqg3CW","date":"Thu Mar 24 12:00:20 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"📸: In case you missed the action last night. Our IUP Men's Basketball team beat Hillsdale 67-55. And just like that, we're headed to the semifinals 🙌 #IUPproud #EliteEight @IUPCrimsonHawk @IUP_MBB https://t.co/wUrpHxT1yz","date":"Wed Mar 23 20:20:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Are you ready? Tomorrow is the day to show your #IUPproud on #IUPGivingDay. https://t.co/GSSpXo6Y8r https://t.co/d5CMCOii54","date":"Wed Mar 23 19:11:20 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"#FinalFour looks good on you @IUP_MBB 🎉 #EliteEight #TalonsUp https://t.co/YiUKbPafvk","date":"Wed Mar 23 04:05:25 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The journey continues tonight as our Crimson Hawks take on the Hillsdale Chargers at the Ford Center in Evansville. Stream the game https://t.co/6Rd62b6Vt0 or head to the Folger Student Center for the watch party. 🏀 See you at 7 p.m. #g2g #EliteEight @IUP_MBB @IUPCrimsonHawk https://t.co/Ii6YPUcpS5","date":"Tue Mar 22 18:39:33 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"It's game day for @IUP_MBB!🏀Cheer on your Crimson Hawks at the watch party👀 tonight at the Folger Student Center. Event starts at 6:30 p.m. Tip-off at 7 p.m. #GoHawks https://t.co/PBBEx3nFIR","date":"Tue Mar 22 14:57:45 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Spring looks good on campus! 🌼 What are you doing on this sunny day? https://t.co/4XJbCEmr5z","date":"Mon Mar 21 19:38:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"No. 2 seed @IUP_MBB hits the road to Evansville today! We're coming for you Elite 8. 🙌 https://t.co/btgeYNi4wp","date":"Sun Mar 20 19:55:39 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Are you ready? In seven days, the IUP family will celebrate #IUPGivingDay. Mark your calendar and bookmark https://t.co/8nlw1aGD0d. #IUPproud https://t.co/c5clxt8mur","date":"Thu Mar 17 19:19:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"What a game! @IUP_MBB punched their ticket to the Elite 8 tournament Tuesday. Here are the highlights if you missed it. 🏀🎉👀 https://t.co/EkFDKeqcEB","date":"Thu Mar 17 13:44:07 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"You’re looking at the NCAA DII Atlantic Region Champs! Say what?! 👂🎉 IUP Men's Basketball is ready to hit the road to Evansville, IN next week. #Elite8 #talonsup https://t.co/MmIpEEXh96","date":"Wed Mar 16 03:16:25 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"These Hawks found their nest! #IUPbound 🥳 https://t.co/D62a9EHNrR","date":"Tue Mar 15 15:08:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"@IUP_MBB is headed to the regional final with a 58-55 victory over Mercyhurst 🏀 It goes down Tuesday at the KCAC 🙌 https://t.co/nH6gYylgnv","date":"Mon Mar 14 13:18:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Headed into semifinals like…😎 IUP Men's Basketball team beat Fayetteville State, 65-49. 🎉👏 You won’t want to miss tomorrow’s game. Students, grab your iCard to get in for free and cheer on your #CrimsonHawks https://t.co/NBUGzUcNNL","date":"Sun Mar 13 01:13:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"2022 NCAA Division II Men's Basketball Atlantic Region Championship hosts 😎🏀🙌 #IUPproud #GoHawks https://t.co/sk7kgHengE","date":"Sat Mar 12 17:41:21 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"It's go time at the KCAC!👀 @IUP_mbb plays at 5:00 p.m.","date":"Sat Mar 12 15:27:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The Crimson Hawks run came to an end today after another awesome season. Our women’s basketball team lost to CalU, 52-51. 👏 Proud of you @iup_wbb_ \n#IUPproud https://t.co/uvSxTnryv3","date":"Fri Mar 11 22:26:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Stepping into spring break. 🌞 What are your plans? Let us know below. Have a great break, Hawks! #IUPProud https://t.co/j9WDCfInuu","date":"Fri Mar 11 21:38:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Get your creative juices flowing at the IUP Writing Center. Tutors are here to help you with your upcoming papers or assignments! 📚 Click here for the full Spring 2022 schedule. https://t.co/EHPxCZ1DGv https://t.co/qz4kPKmNCm","date":"Thu Mar 10 20:31:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Cheering on @IUPSwimDive  at the NCAA Championships today through Saturday in Greensboro, NC. Watch live coverage at https://t.co/DCccuPsHwm. #gohawks #talonsup #IUPproud https://t.co/sA9aQbXikc","date":"Wed Mar 09 21:43:58 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We want to hear from you. IUP will participate in the National Survey of Student Engagement (NSSE), open to eligible first-year students and seniors. Enter by April 21 for a chance to win weekly or end-of-survey Amazon gift cards! https://t.co/hhRpkQPgEO https://t.co/s3aDf8ETOK","date":"Tue Mar 08 20:59:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Michael Driscoll talks about good news for the university, including the success of the women’s and men’s basketball teams, and he announces the new cochairs of the Commission on Diversity and Inclusion. https://t.co/eqbAcwPj39","date":"Tue Mar 08 17:38:41 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Did someone say puppies? Come de-stress with IUP's famous therapy dogs tonight at Folger from 6PM-7:30PM. https://t.co/kf9huH4IwT https://t.co/nrV0LdLJX5","date":"Mon Mar 07 18:20:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Tired of changing his son’s diaper on the men’s room floor, Donte Palmer ’09 made an Instagram post that led to a national campaign pushing for changing tables in all public restrooms. #IUPproud #alumni https://t.co/2tgCm7WsSp","date":"Mon Mar 07 17:33:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The road to the Elite Eight goes through the KCAC! Our men’s basketball team is the top seed and will host the 8-team NCAA D2 Atlantic Region tournament at the Kovalchick Complex. We open against #8 Fayetteville State on Saturday. #TalonsUp @IUPMBB @IUPCrimsonHawk https://t.co/HFIN7CzQBl","date":"Mon Mar 07 13:57:16 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The Crimson Hawks are tournament bound! Our women’s basketball team was picked for the NCAA D2 tournament on Selection Sunday. Up first, we’ll take on a familiar foe, CalU, in the first round on Friday in Glenville, West Virginia. #TalonsUp @IUPWBB @IUPCrimsonHawk https://t.co/qjOnVw3pMo","date":"Mon Mar 07 13:56:19 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Stop if you’ve heard this before: IUP is the champs of the PSAC! Our men’s team overwhelmed Millersville today to claim the crown. Up next, the NCAA Tournament. Sites and pairings will be announced tonight at 10:00. Watch it here: https://t.co/URTkkSDK2s #TalonsUp https://t.co/gPU4Dxqk6T","date":"Mon Mar 07 00:21:18 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Be ONE of the first to see the new sensational movie, The Batman! Tonight at 6:35PM at MovieScoop Indiana Mall. 📽️ https://t.co/G5eyxqRimK","date":"Fri Mar 04 17:55:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Today is the last day for students, faculty, and staff to participate in an anonymous survey to help improve Diversity, Equity, and Inclusion on campus. Don’t forget to check your IUP email for the link to the survey. #IUPproud https://t.co/JlDxsN0MqK","date":"Fri Mar 04 15:46:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Did you know the HUB Fitness center is a sprawling 21,000-square-foot state of the art complex? The HUB Fitness Center is home to group fitness &amp; spinning classes, and a wide array of cardio and strength-training equipment. What's your favorite activity to do at The HUB? https://t.co/LhdC0oikef","date":"Thu Mar 03 21:15:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Just got admitted to IUP? Come learn more about what it is like to be a student at IUP during Experience IUP Day this coming Monday, March 7. Click here to sign up https://t.co/aX2Jc2KJ5g https://t.co/xODCcjoDzb","date":"Thu Mar 03 16:14:07 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Effective this fall, IUP will lower tuition by almost 20% for most of our students. Get the details at https://t.co/j0ok3Hiq7F https://t.co/Ue0XPR9RFV","date":"Wed Mar 02 22:28:11 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"@Jagerlied The pandemic-related drop in the number of customers at on-campus locations was the driving factor behind this decision. We examine the IUP dining program every year, and we’ll make further adjustments as the size of our customer base changes. Thanks for asking!","date":"Wed Mar 02 19:14:09 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Following updated guidance from @CDCgov, IUP will no longer require masks in most indoor spaces. Masks are still required in certain facilities, and individual preferences must be followed in offices and living areas. Get all the details: https://t.co/OFY5oiLuJi https://t.co/DM9RjaPZWn","date":"Wed Mar 02 18:44:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Thanks. Gracias. Danke. Merci. How will you say thanks to our donors? Let us know below! https://t.co/EuoPT9baAZ https://t.co/PSUSBW8UI7","date":"Wed Mar 02 15:14:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Calling all Hawks! It’s time to thank IUP donors for their generosity and support. Click here for more information https://t.co/tBWwncet2b https://t.co/06AJjy1aHu","date":"Mon Feb 28 23:45:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"You’re #IUPbound, but have you experienced IUP yet? There are 4 more Experience IUP days left this semester. Register here https://t.co/hg0ZKgzxj3 https://t.co/X8jvYr4X0n","date":"Mon Feb 28 21:03:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"\"We stand with all Crimson Hawks affected by the violence in Ukraine. Pray, hope, and advocate for peace. #ukraine\" - President Michael Driscoll https://t.co/qu7pTMCQkk","date":"Fri Feb 25 21:21:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The IUP Applied Archaeology MA program ranked as number three in the world for producing students who became registered professional archaeologists in 2021. We are #IUPProud! Are you an archaeologist? Let us know below! https://t.co/bvHDaRAeNs https://t.co/MJiBb9ErYi","date":"Fri Feb 25 18:27:14 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"In honor of IUP's recognition as a Doctoral University with High Research Activity, we're celebrating IUP research from now until April. Look for stories tagged #ThisIsIUPResearch &amp; tag your own IUP research stories, too. Learn more about this honor here: https://t.co/CpBQIVcd1l","date":"Thu Feb 24 19:17:50 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We’re always striving to improve our campus environment. That’s why the current campus climate survey is so important to take the pulse of our Diversity, Equity, and Inclusion efforts. If you’re a student or employee at IUP, check your email to participate. #Together4PASSHE https://t.co/Fkxc5IDazt","date":"Wed Feb 23 20:00:41 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Every Hawk is impacted by philanthropy! During Thank A Donor Week, all Hawks are encouraged to celebrate the generosity and impact of IUP’s donors. Check out how you can send a message of appreciation. https://t.co/aCTypfkKYG https://t.co/YYlLB5EU39","date":"Wed Feb 23 00:29:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Michael Driscoll shares the news and explains the significance of IUP’s classification as an R2 Doctoral University—High Research Activity by the national Center for Postsecondary Research in its 2021 Carnegie Classification. https://t.co/MomRxDxM13","date":"Tue Feb 22 13:24:34 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Join us tonight at 6PM in the HUB Ohio Room as Chef Arnold Ivey shares his stories of how education, his experience at IUP, and his opportunity on the Food Network prepared him for the challenges of being a Black Chef in the culinary field in the 1990s. https://t.co/ECWrGvpxuL https://t.co/q7MSR8Im4P","date":"Mon Feb 21 21:45:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Are you #IUPbound? Join us next Monday, February 28 for Experience IUP Day. A full day of learning more about life here at IUP. Be sure to sign up here https://t.co/hg0ZKgzxj3 Can’t make it this time? Check out other dates in 2022. https://t.co/8V43JERSLB","date":"Mon Feb 21 21:01:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Freedom is vital to the core mission of the university. But is all speech on a college campus protected? Political science associate professor Gwen Torges talks about the kinds of speech not protected by the first amendment. https://t.co/rAWCHF7rYH","date":"Fri Feb 18 21:43:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Join us tonight at 6:30PM as Miles Henderson (alumnus of IUP and co-founder of True Culture University) analyzes the legacy and impact of Marcus Garvey on racial and economic justice in our world. https://t.co/mhtfHAoOiA https://t.co/n20B4s5WDv","date":"Thu Feb 17 20:23:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are #IUPproud to be ranked in U.S. News &amp; World Report for our online master’s degrees in Criminology, Math Education, and Nursing. Did you receive your master’s degree at IUP? Let us know what you’re up to below. 🎓 https://t.co/5fYv48zZKc https://t.co/w1F8eXpRvw","date":"Tue Feb 15 19:54:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We're celebrating #ValentinesDay by sharing the stories of some of our Crimson Couples like Daquelente &amp; Fello. Click here https://t.co/tKDa1fhUfM to hear how these IUP Alumni members met ❤️ https://t.co/X9gXBZMEet","date":"Mon Feb 14 18:17:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Theory, research, production work &amp; teaching experience—a winning combination Jeremy McCool found in IUP's @CMITPhD communications media doctoral program. Now a professor, McCool is teaching digital story telling—a class he created at IUP. @IUPGradStudies https://t.co/kspC6sdb5v","date":"Mon Feb 14 13:42:54 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Students and employees can make their voices heard in a new campus climate survey. Check your email to share your anonymous thoughts, and help us improve our Diversity, Equity, and Inclusion on campus. #Together4PASSHE https://t.co/Td9QU35IJb https://t.co/BCBKbvJcg1","date":"Thu Feb 10 22:16:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Words hurt, but is it illegal to say that?Four IUP students raise issues about free speech on campus. In the 2018-19 school year, students and faculty at IUP spent a year exploring the right to free speech and this video was created as part of that project.https://t.co/4ILvXjhFzS","date":"Wed Feb 09 19:50:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"IUP's online master's in criminology has been ranked #2 in the nation and #1 in Pennsylvania by https://t.co/7KBdZOdR6j in its 2022 Best Online Programs in Criminology. We are #IUPproud. Did you receive your master's in criminology online at IUP? 💻 https://t.co/lR0UBZwieW https://t.co/iHfQ92YSGP","date":"Wed Feb 09 15:14:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"IUP is celebrating Black Excellence and the importance of local service work. Join us this Wednesday at 6:30PM in the Susquehanna room at the HUB. https://t.co/Fp959GP3bh","date":"Tue Feb 08 16:22:38 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Michael Driscoll stresses the importance of following COVID-19 safety protocols and discusses Black History Month programming and an upcoming survey for students and employees on diversity, equity, and inclusion issues. https://t.co/QcZiUhvHkR","date":"Tue Feb 08 13:17:50 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Interested in cooking? @wqed Pittsburgh recently featured the IUP Academy of Culinary Arts. See how you can join a profession that's growing at a high rate. 👨‍🍳 https://t.co/uvfT0EzT0p","date":"Mon Feb 07 21:18:00 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Experience Treasures from the Wardrobe at The University Museum at IUP opening this Saturday, 2/5. Professor Janet Blood and Julie Gomboc-Hellam, share their favorite pieces in the collection that have been built over decades through the generosity community donors. https://t.co/3tfJKCKOto","date":"Fri Feb 04 19:18:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Our IUP Students were proud to help celebrate Punxsutawney Phil emerge from his burrow to perform his #GroundhogDay duties this morning. https://t.co/XqReSNRNAI","date":"Wed Feb 02 22:23:03 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are always looking for ways to improve our campus environment. Students and employees: check your IUP email to participate in an anonymous survey! #Together4PASSHE https://t.co/Td9QU35IJb https://t.co/WIDzaUkLFN","date":"Mon Jan 31 21:01:39 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Two @IUPAnthropology master’s program graduates who have excavated the Mercer County site of Pandenarium, a Pre-Civil War settlement for free African Americans, are helping unearth the settlers’ stories. Read about this important part of Black history. https://t.co/4pvLkJv3ga https://t.co/B2Ue8sj6SV","date":"Mon Jan 31 13:38:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"We are #IUPproud! Both Men and Women's basketball defeated Edinboro Wednesday night. 350th career win for Men's coach Lombardi and Women's 800th victory win for the program. Let's go Hawks! 🏀 https://t.co/wJgbbKzIRI","date":"Fri Jan 28 16:08:05 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"With February approaching we can feel the #IUPLove. Are you an IUP Crimson Couple? ❤️ Share your love story with us in comments below or submit your story here https://t.co/VqwETE5rXG Check out Crimson Couple stories like Postage, Brogan or Dongiovanni https://t.co/tKDa1fhUfM https://t.co/5OS1Viz1NE","date":"Thu Jan 27 20:56:05 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"WWND? (What Would Norm Do) Cheer on the Hawks tonight at 5:30 PM (Women's) and 7:30 PM (Men's) as we go up against Edinboro. Let's go Hawks! 🏀 https://t.co/PBWCJ9TJfc","date":"Wed Jan 26 18:14:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Winter time at IUP is the best! ☃️ https://t.co/oohjMVSZoR","date":"Mon Jan 24 20:21:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Hey high school students, we want to meet you and show you campus! Weekday visits have started back up so be sure to register for one of our two-hour time slots, grab a family member, and hit the road to IUP. #IUPProud https://t.co/rU39jl9i5n","date":"Mon Jan 24 16:38:51 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"First week of the semester. ✔️ We're rooting for you! #IUProots https://t.co/Sju0KlmkpX","date":"Fri Jan 21 15:12:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Welcome back, Hawks! Spring 2022, here we come! #IUProots 📚 https://t.co/KVOkXhzCPX","date":"Tue Jan 18 22:30:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"From protests demanding integration of the community pool to memorial marches on Philadelphia Street-the fight for civil rights in Indiana took many forms. IUP retiree Edith Cord shares her memories \"to give everyone a better chance at the American dream.\" https://t.co/EcmsJZoXtK","date":"Mon Jan 17 16:48:06 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Want to move in before the snow starts on Sunday evening? Here's how to sign up for Saturday move in. https://t.co/F0zXq7W5j0 https://t.co/ZRPbWgYput","date":"Fri Jan 14 21:05:48 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"President Michael Driscoll discusses COVID-19 safety plans, a new It’s on Us PA grant, and an upcoming survey on diversity, equity, and inclusion issues. He also congratulates two new deans and gives a Martin Luther King Jr. Day panel preview. https://t.co/wpuZrlHCGv","date":"Fri Jan 14 14:18:44 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"🥳👏 Welcome to the IUP family future Hawks! #IUPBound https://t.co/RS3wBdEY5t","date":"Tue Jan 11 19:45:04 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Classes at IUP will start as planned, with in-person classes beginning on Tuesday, January 18. Read President Driscoll’s announcement to understand the factors behind this decision and find out how we’ll be keeping students safe this spring. https://t.co/SwKy1Z9vdK","date":"Thu Jan 06 19:13:50 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Who's joining #IUP26 this fall? 🙌 https://t.co/dqgsUrW28d","date":"Tue Jan 04 19:47:01 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"Here's to a great 2022, Hawks! #HappyNewYear https://t.co/5teNcLfBic","date":"Sat Jan 01 15:14:02 +0000 2022","user_id":"16422886"},{"handle":"iupedu","text":"The New Year is upon us, and we are excited about the many possibilities our students have to succeed in 2022. We hope you’ll consider making a gift https://t.co/T1njUKCFm3 to support deserving students thrive in the new year and beyond. https://t.co/E2n2seZDEA","date":"Fri Dec 31 15:08:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Choosing to support IUP students means choosing to support the next generation in a new year. https://t.co/T1njUKCFm3 https://t.co/fqVMKZHNln","date":"Mon Dec 27 16:22:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@stephliebel We appreciate your patience! With the situation changing day by day, any decisions about a potential change in delivery will come in January.","date":"Tue Dec 21 14:23:29 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Let's continue the celebration! 🎊 Check out our virtual commencement ceremony that is happening today for those who couldn't join in person: https://t.co/bN31BFrzL7. Wishing all our graduates success in their future. #IUPcongrats https://t.co/7O8VIZnES2","date":"Sat Dec 18 13:05:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"First week of break ✔️. Happy Friday, Crimson Hawks. We hope your break is off to a great start! https://t.co/8apaHHYp7S","date":"Fri Dec 17 19:41:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP is standing strong with our fellow alumni &amp; friends in Kentucky and other areas affected by the recent tornadoes. We encourage everyone to contribute as they are able to the Team Western Kentucky Tornado Relief Fund. Find out how to donate here: https://t.co/jEsuUPY1MM","date":"Thu Dec 16 21:54:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Winter Classes? You got this. You’re determined and fearless and we believe in you. You’re a Crimson Hawk! https://t.co/BwwbY0fqmz","date":"Thu Dec 16 15:19:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Wishing all of our 2021 graduates success in their futures! You did it. #IUPproud #IUPCongrats https://t.co/QO9LpoW48e","date":"Mon Dec 13 20:48:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Young writers explore coding, storytelling, and decision making as they create stories w/ multiple pathways in the Digital Story Game Project. @IUPLitCrit Prof @Mike_Sell is helping students at @FRSDPanthers learn key 21st-century skills. #IUPinnovators https://t.co/fJMpkQtdla","date":"Mon Dec 13 15:50:28 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It’s commencement day! 🎓 Congratulations to the Class of 2021. Don't forget to share your celebration using #IUPcongrats! Graduate and Undergraduate ceremonies livestream can be found here https://t.co/U8UkkmVd7u https://t.co/OUqWVCjpzA","date":"Sat Dec 11 13:05:14 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Graduating tomorrow? Make sure you register for the celebration toast with the Alumni Association tomorrow from 10:30 a.m. - 3:30 p.m. https://t.co/lB95rilefe https://t.co/tphG1VRdUs","date":"Fri Dec 10 19:43:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The Library and Folger are closed today but check out these other study spaces that are available. https://t.co/KMUrdr7Zdg","date":"Fri Dec 10 16:10:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Don’t forget Crimson Café closes at 10pm and will remain closed the rest of the week. https://t.co/bpVrSPMuLe","date":"Wed Dec 08 17:45:16 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP will hold commencement ceremonies on December 11 for 642 graduates, including honoring 12 undergraduates who completed their studies with perfect 4.0 grade point averages. 🎓 https://t.co/DyggLZNJYF","date":"Wed Dec 08 15:40:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Welcome to finals week Crimson Hawks. We know you’re doing your best to finish those last-minute assignments and studying, so that’s why we’ve put together your finals week guide. You can find tutoring hours, dining schedule, and hours for your favorite study space. Good luck!📚 https://t.co/cTrZalllSK","date":"Tue Dec 07 21:32:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Looking for someone to quiz you before the big exam? Click here for a list of virtual tutoring sessions with the Tutoring Center. https://t.co/JKABIx70Ac","date":"Tue Dec 07 20:27:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@Ian_J_Zimmerman We are doing our best to support students throughout this busy time, using data from library usage in past years during finals week to make decisions about facility hours. Our collective hours are meant to support students across campus and utilize multiple resources.","date":"Tue Dec 07 14:25:12 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Don't forget to take a study break and grab some pancakes served by non other than IUP's celebrity servers, tonight from 10:30pm to midnight at North Dining. All students are welcome free of charge, whether you have a meal plan or not. 🥞 https://t.co/zekSACb67l","date":"Tue Dec 07 00:40:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Happy last day of classes, Hawks! 📚 Are you graduating this year? 🎓 https://t.co/GyY35cQQdy","date":"Mon Dec 06 17:45:42 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"You made it! Finals start this week. Tell us, where is your favorite place to study on campus? https://t.co/a7tWGHGz93","date":"Sun Dec 05 21:20:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#TalonsUp! Both IUP Women's (6-0) and Men's (5-0) basketball are undefeated. Have you gone to a game to cheer on the Crimson Hawks? 🏀 Women's schedule: https://t.co/rRxrd83Ca8 Men's schedule: https://t.co/A57qyctEf6 https://t.co/x0lSWMarVD","date":"Sat Dec 04 00:49:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll joined Chabad of Altoona for an outdoor Menorah lighting for Chanukah last night outside of The HUB. https://t.co/rD9mEVz7Lg","date":"Fri Dec 03 19:30:07 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Once again we are #IUPProud! Because of you we raised over $29,000 for #GivingTuesday. Thank you for making a difference in the lives of IUP students! https://t.co/tx7B2ANq2L","date":"Fri Dec 03 16:48:54 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll encourages students to take advantage of programs to help them de-stress during finals. He also thanks IUP community members for their generosity on Giving Tuesday and offers his good wishes for a restful and enjoyable winter break. https://t.co/ILgalzrRns","date":"Fri Dec 03 13:38:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Are you #IUPbound? Join us this Monday, December 6 for Experience IUP Day. A full day of learning more about life here at IUP. Be sure to sign up here https://t.co/1UwaZP2Afr Can’t make it this Monday? Check out other dates in 2022. https://t.co/7KA00Zmhk8","date":"Thu Dec 02 21:20:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join STATIC tonight at 7pm or 9pm to unplug and relax with DIY spa kits and relaxation tips and tricks pre-finals! The event will take place virtually via Facebook and Instagram. https://t.co/5a7nHVgYOe https://t.co/h5AronZHmw","date":"Thu Dec 02 17:39:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us 12/2 for an enchanting journey to the land of candy canes, chocolate, and the Sugarplum Fairy in a performance from the holiday classic, The Nutcracker. Purchase your tickets here https://t.co/O4t5DgT23B https://t.co/y2K7E6NbFp","date":"Wed Dec 01 21:05:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Want to keep up with your coursework to graduate on time, or lighten your Spring Semester? Register for a winter session class--3 weeks for 3 credits and totally online. https://t.co/GWyvIdQB1C https://t.co/McIP5Prt3f","date":"Wed Dec 01 14:53:21 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It's your last chance to donate to help IUP Students like Mikayla Dokos in making a difference in their lives and education. Donate here https://t.co/Y0Ou3RVvmS https://t.co/7CBoSc95MT","date":"Wed Dec 01 00:11:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are #IUPProud! We are so close to meeting our goal for #GivingTuesday. Help us go above and beyond. Donate here https://t.co/Y0Ou3RVvmS https://t.co/Db7PKwtr4b","date":"Tue Nov 30 18:25:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today is #GivingTuesday and your gift can make a difference in the lives and education of IUP students. Make a gift today in your area of choice! https://t.co/Y0Ou3RVvmS https://t.co/DCtFjQfYFC","date":"Tue Nov 30 14:24:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"University officials joined diverse groups of students in fall 2020 to walk the campus and see it through their eyes—including with an eye for change. A year later, key participants are taking a look at how well IUP listened. https://t.co/egBfoYdUxY https://t.co/Z7Q2RN9JhA","date":"Mon Nov 29 20:53:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Last full week of classes, Hawks! Let's finish the semester strong. #IUPproud https://t.co/hfXDXhwk7t","date":"Mon Nov 29 16:48:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us today and Sunday for at the KCAC for the Thanksgiving Classic as IUP goes up against Virginia State and Salem. #TalonsUp Crimson Hawks. 🏀 https://t.co/JSaqzbMtuJ","date":"Sat Nov 27 17:37:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Have a safe and Happy Thanksgiving, Hawks. https://t.co/Lv6pQwlnlV","date":"Thu Nov 25 15:15:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We polled IUP Alumni and Friends about their favorite Thanksgiving pie and the results are in. Pumpkin Pie is the winner! Let us know about your favorite Thanksgiving pie below. https://t.co/3BtWdDZqZM","date":"Wed Nov 24 17:47:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"On #GivingTuesday, we’re asking you to help us reach our goal. Students like Lavinia Davis have already been donating – it's your turn to help! Make a gift in a variety of travel expenses, program enhancements, and more for students on Nov. 30. https://t.co/Y0Ou3RVvmS https://t.co/2BFPQEoSSy","date":"Tue Nov 23 20:07:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Hey High School Seniors, are you ready to be #IUPbound? Join us next Monday, November 29 for IUP Decision Day! Tour campus and get an acceptance letter the same day. Spots are limited, so register today! https://t.co/P6IYKRBBYX https://t.co/M4VKZBaGxO","date":"Mon Nov 22 18:39:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Have a great break, IUP Family! Take time to rest and recoup. #IUProots https://t.co/f4P82qFCzk","date":"Mon Nov 22 16:42:13 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It's light up night in Indiana, PA tonight! Lights go on at 6pm, followed by the It’s a Wonderful Life Parade at 7pm. If you're still in town stop by and get some hot chocolate! https://t.co/35rg9x5A1R","date":"Fri Nov 19 17:13:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Let's join as one to create opportunities for IUP students. When we come together, there is no limit. Join us on November 30 for #GivingTuesday. https://t.co/Y0Ou3RVvmS https://t.co/sZJ4ZL2lPp","date":"Fri Nov 19 14:49:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@Therealriverr @Gamecocks Hope we see you on campus soon!","date":"Thu Nov 18 21:56:36 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"They say a picture is worth a thousand words —but seeing and feeling it in person is so much better! Come tour IUP and see for yourself why so many people call it home. Schedule your visit here https://t.co/XoYmHlVvFk https://t.co/YOVG2HpzdZ","date":"Thu Nov 18 21:54:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP is proud to make an impact in our community today!","date":"Thu Nov 18 16:02:43 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The Black Experience Alumni Committee hosts networking events in Philly and Pgh next week. Students can connect w/ local Black alumni &amp; potential mentors in fields like education, law enforcement, accounting, nutrition, finance, hospitality, nursing &amp; more!https://t.co/VQrsgbkzgp https://t.co/qr0jISDMtD","date":"Wed Nov 17 23:25:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"These future Hawks are #IUPbound. Welcome to the IUP family! 👋 https://t.co/olBm2FBP3O","date":"Wed Nov 17 19:36:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":".@IUPAnthropology professor Abbie Adams explains how to “Decolonize Your Thanksgiving Meal” in her talk Wednesday. The focus: Thanksgiving dinner and family, Native American history, and the contributions indigenous people made in developing today’s foods. https://t.co/C5Sjl0EiXo","date":"Wed Nov 17 16:39:12 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP students are tough. But sometimes, like everyone, they need a little help. This #GivingTuesday, your gift can make a difference in the lives and in the education of IUP students. Make a gift on your area of choice on Nov. 30. https://t.co/Y0Ou3RVvmS https://t.co/QVyYP18tVp","date":"Tue Nov 16 23:07:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Common Goods—a pop-up store featuring laser-cut packages of items we need but can't buy—opens tonight at 5:30 at the Indiana Mall. Students in Sharon Massey and Sean Derry’s 3D Design classes designed the packages. All proceeds benefit the Indiana Free Library. https://t.co/TQsNWzkcp0","date":"Tue Nov 16 18:46:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll provides an update on extended COVID-19 testing hours. He also addresses Thanksgiving Recess and Winter Athletic mask reminders. https://t.co/97DnHkHkLD","date":"Tue Nov 16 14:56:38 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The IUP Health Service has extended their hours for free COVID-19 testing for students. They'll be open until 8pm today, Tuesday, and Wednesday. Protect your loved ones and get tested before you travel! https://t.co/hyAJhcc6b2","date":"Mon Nov 15 18:33:36 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In honor of Veterans Day, join us for a 6:00 Series program recognizing those who have served and are currently serving our nation. 6pm, HUB Ohio Room. https://t.co/9rirfKsYBy https://t.co/18ey1nK5N1","date":"Mon Nov 15 18:19:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Hey Philly friends, we’re bringing IUP decision day to you on this Thursday, November 18. Check the link for details. https://t.co/P6IYKRBBYX https://t.co/puUkIBYsS0","date":"Mon Nov 15 16:26:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Happy #WorldKindnessDay! Hunter Prosper ’19, nurse at UPMC Presbyterian, spreads kindness every day through his patients and by telling their stories. He asks local strangers to offer advice or share an uplifting story about themselves. https://t.co/7AGCtA88C9","date":"Sat Nov 13 21:18:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today is the day! We are so excited to see you for Open House. Don't forget to grab a picture in the Oak Grove and tag us using #GetInTheGrove. https://t.co/vxpAaIXWZ6","date":"Sat Nov 13 15:35:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"🏀 BASKETBALL 🏀 IS 🏀 BACK 🏀\n\nTonight the @IUPCrimsonHawk men's @IUP_MBB and women's @IUP_WBB teams play West Virginia Wesleyan in their first home games since March 2020. See you tonight at 7:30pm at the KCAC! #TalonsUp https://t.co/xitBdJaQiJ","date":"Fri Nov 12 19:44:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Our final new commercial focuses on research and exploration. If you did a research project at IUP, or were you involved with a professor's research, let us know! https://t.co/JpuqUfefhV","date":"Fri Nov 12 14:47:16 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Head over to the HUB from 2pm-6pm to grab everything you need for Graduation next month! 🎓 https://t.co/mpaHNU3Doh","date":"Thu Nov 11 16:05:59 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today we honor all who have served. Thank you! #IUPProud https://t.co/aGpMyBMB66","date":"Thu Nov 11 14:11:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@Noboyfriendiup You should talk to @IUPGradStudies. They can answer any question you might have about IUP's graduate programs.","date":"Wed Nov 10 21:35:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Our second new commercial features our healthcare options and learning beyond the classroom. If you've had an out-of-the-classroom academic experience at IUP, let us know what it was! https://t.co/szCXIwiFqT","date":"Wed Nov 10 19:21:53 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Can you see what we see? 🐿️ Fall at IUP is captivating. 🍂 https://t.co/1iqYV07YXB","date":"Wed Nov 10 17:44:28 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Graduation Fair is happening now in the HUB! https://t.co/gBnxBzL2GT","date":"Wed Nov 10 15:46:29 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Ready to heed the call? IUP has new commercials airing on TV and cable, as well as online. Like so many things at IUP, the commercials take place in the Oak Grove. Here's the first of three. How has IUP helped you grow? https://t.co/WGWZItpFxZ","date":"Tue Nov 09 21:05:16 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This Saturday, November 13 is our Open House. You’ll experience a little bit of everything from a campus tour to academic and student life fairs. Sign up here https://t.co/5h9ege7rEH https://t.co/kEMOuvsz28","date":"Mon Nov 08 19:02:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Student giving is an IUP tradition—from the Class of 1888’s “Rock of Ages” to raising funds for Grant Street Park a few years ago. A 1973 grad’s matching funds for the next Student Giving Challenge will help keep that momentum going. https://t.co/LdmB01NIhT","date":"Mon Nov 08 15:44:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP Self-Care Day...a day to rest and take care of yourself, Hawks! Find some time to get some fresh air, catch up on sleep, decompress, or hang out with your friends. Today is your day, enjoy it. https://t.co/8MY8KGZbDd https://t.co/RgAVhIBDry","date":"Fri Nov 05 15:12:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@_laurenfogle_ 🥳 Woo! We love to see it.","date":"Fri Nov 05 13:27:42 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Hey High School Seniors, haven’t applied yet? Join us next Thursday, November 11 for IUP Decision Day! Tour campus and get an acceptance letter the same day. Spots are limited, so register today! https://t.co/P6IYKRBBYX #IUPbound https://t.co/Ei31lh2olU","date":"Thu Nov 04 21:51:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP @PresDriscoll encourages everyone to participate in Self-Care Day and shares his presidential goals in support of the strategic plan. He also addresses recent concerns about the status of Thanksgiving break, which is not canceled. https://t.co/g9Mf7wjkhv","date":"Thu Nov 04 14:06:07 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud! Forbes has ranked IUP #6 for top Public University in Pennsylvania. What year did you graduate IUP? Let us know below. https://t.co/iRr8nGkPbR https://t.co/goIh11MFgj","date":"Wed Nov 03 16:52:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today is Election Day! Have you made plans to vote? Students living on campus can vote at Zink Hall. You can find more information here https://t.co/gNzTX5x5qz Make your voice heard. #YourVoteCounts #IUPproud https://t.co/BSpOmBIW8k","date":"Tue Nov 02 14:26:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Athletic trainers don't get much publicity but they're just as important as any other part of sports. They treat everything from blisters to broken bones, from concussions to contusions. At IUP, students learn the skills to land jobs in this growing field.https://t.co/OlwcEjmFru","date":"Mon Nov 01 22:00:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Happy Halloween, Hawks! 🎃 https://t.co/96bamNhoFm","date":"Sun Oct 31 16:09:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Tonight and tomorrow at 5pm are your last chances to see \"WPXI Pittsburgh Gets Real,\" featuring IUP. The show is streaming on WPXI Now. Find out how to watch: https://t.co/757GNep3LF","date":"Sat Oct 30 19:37:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"🏀🏀🏀🏀","date":"Fri Oct 29 17:51:51 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@IUPFootball takes on the Edinboro Fighting Scots at 2pm Saturday for our last regular season home game. 🏈 As always, IUP students get free tickets. 🎟 #TalonsUp, Hawks! @IUPCrimsonHawk https://t.co/xxACUQwYxL","date":"Fri Oct 29 16:05:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@CutexMarki @lmgriffjohnson Congratulations!","date":"Fri Oct 29 14:04:12 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Know someone who’s considering transferring to IUP? Join us Monday, 11/1 for Total Transfer Day. A one-on-one meeting with a transfer counselor for personalized guidance and an admission decision. IUP is here to help you make your new path to your degree. https://t.co/ZgcyVRpBDQ https://t.co/vVAMUw7aYN","date":"Thu Oct 28 14:47:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"And don't miss Masterpieces &amp; Mocktails on Nov. 11! https://t.co/Jp5xg6qHkI","date":"Thu Oct 28 14:00:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP has been ranked by the Wall Street Journal and Times Higher Education for the 2022 College Rankings List. We are #IUPproud. https://t.co/59ullDFQt0 https://t.co/7Mo4TZQJXO","date":"Wed Oct 27 20:30:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Auditions for our music program start in December. Auditions happen after you're accepted to IUP, so apply now if you want to be at that first audition date.","date":"Wed Oct 27 18:00:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"English professor Veronica Watson's work on issues surrounding police use of force was recently featured in this segment from WPXI. https://t.co/xO5QS9SyOt","date":"Wed Oct 27 16:53:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@elizagashe https://t.co/Bk6KOMeA5B","date":"Tue Oct 26 20:06:50 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"FYI: IUP hasn't canceled Thanksgiving Break. Today's article in The Penn was part of their Crimson Hoax series, which they describe as \"satirical stories.\" https://t.co/nHsvBAysVC","date":"Tue Oct 26 17:31:59 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Congratulations, new American citizens! This past Friday, 28 candidates for citizenship from 21 different countries took part in a naturalization ceremony held at IUP by the US Customs and Immigration Service. We wish each of them the best in their pursuit of happiness. https://t.co/wfrr6DQiSa","date":"Tue Oct 26 15:16:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@veronicavatter Thanks for the heads up!","date":"Tue Oct 26 12:42:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@veronicavatter Thanksgiving break is not canceled.","date":"Tue Oct 26 12:11:41 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Based on positive responses to last year's self-care day, and a strong recommendation from IUP's Student Government Association, we are designating Friday, Nov. 5, 2021, as IUP Self-Care Day across the university. Find out more: https://t.co/TdnLe3oMzG","date":"Mon Oct 25 21:46:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us at 6pm as two IUP alumni and former US Representatives, a Republican and a Democrat, discuss their time in politics, including their roles in bipartisan agreements. The conversation will be moderated by an IUP student. Audience questions welcome! https://t.co/wkWKWHI0Ux https://t.co/SUTeTc2W1J","date":"Mon Oct 25 19:04:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Over $14 million in scholarships awarded in 2019-20. Renewable merit scholarships offered to 93% of incoming students. In this recent @WPXI segment, Pres. Driscoll discusses even more ways IUP is working to make a college education more affordable for all. https://t.co/2FzVFzIrEG","date":"Sun Oct 24 17:47:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Who's excited for the 12th annual Coal Bowl? Kickoff is at 2pm. Lets go Hawks! 🏈 https://t.co/l4IlygFDWN","date":"Sat Oct 23 15:39:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"If you like romantic comedies and beautiful melodies, come see \"Gianni Schicchi,\" a one-act opera, this Fri. and Sat. at 8pm in Fisher Auditorium. Sung in English. Learn more about the opera and how to get tickets at https://t.co/2Ti2NTO1jZ https://t.co/eMMlElDhSg","date":"Fri Oct 22 19:51:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll provides an update on the strategic plan’s implementation and reinforces the need for everyone to participate. He also addresses a recent issue on campus and expresses his pride in our students and employees for their responses. https://t.co/8umM6bjZPL","date":"Fri Oct 22 13:03:42 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Tonight at 8pm, IUP will be featured on \"WPXI Pittsburgh Gets Real,\" streaming on WPXI Now. Find out how to watch and additional airing times at https://t.co/757GNep3LF","date":"Thu Oct 21 21:50:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#TBT to the Fraternity brothers of Phi Sigma. A nostalgic throwback of college life in 1940. Don't forget to order your copy of “The IUP Story: Indiana University of Pennsylvania, from Normal School to University.” today. https://t.co/dvVzYdF03l https://t.co/f3EW3KNAfC","date":"Thu Oct 21 19:22:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Pennsylvania's teacher shortage is especially acute when it comes to teachers of color. WPXI recently profiled IUP's efforts to bring more teachers of color into Pennsylvania primary and secondary classrooms. https://t.co/D3ZnOiUIgQ","date":"Thu Oct 21 19:18:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@kristiiburkett @kristiiburkett, we've reached out to your department chair and he has time to meet with you tomorrow morning. We'll put the details in your DMs.","date":"Thu Oct 21 19:04:25 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Catch IUP on @WPXI Pittsburgh Gets Real, tonight at 8pm.","date":"Thu Oct 21 17:29:17 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The Research Writing Party is happening now on the 2nd floor of Stabley Library! Come on over for writing and research help, prizes, food, and therapy dogs. Here til 4.","date":"Thu Oct 21 17:01:14 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Fall Fest is happening today at 5:00 p.m.! https://t.co/CbFH6arxJb https://t.co/ePnr6ILuQL","date":"Thu Oct 21 13:25:36 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Let's give a birthday shoutout to the best mascot - Norm! Happy 14th Birthday. 🎉 https://t.co/xdH37jFWgS","date":"Wed Oct 20 15:27:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Need help with research or writing? Maybe both. Check out the Research Writing Party 10/21 on the 2nd floor of Stabley Library from 1-4 p.m. https://t.co/H4Oizq3Fje","date":"Tue Oct 19 16:53:25 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Did you know we offer visits during the week? Register for a weekday campus visit and you'll get to take a tour with one of our awesome IUP Crimson Guides. We can’t wait to see you! https://t.co/XoYmHlVvFk https://t.co/3tCJNvUZe8","date":"Tue Oct 19 14:40:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Curious about diplomacy? Join Diplomat-in-Residence Danielle Harms to learn about career and student opportunities with the US Department of State. Harms, a Pennsylvania native, has been a career member of the US Foreign Service for more than 18 years. https://t.co/SenoRfl3Bz https://t.co/fOyL4mdvXx","date":"Mon Oct 18 17:42:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"As the cocreator of an art installation and gathering place in Philadelphia, an Iraqi refugee and IUP doctoral student is sharing his culture, exploring belonging and healing, and applying what he’s learned at IUP. https://t.co/Sks0ffYbcj https://t.co/qrkemAPQ0n","date":"Mon Oct 18 15:55:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us on 10/22 at 6pm for a virtual discussion with @IjeomaOluo, author of the @NYTimes best seller \"So You Want to Talk about Race.\" Oluo's work on race has been featured in multiple publications, and she has been named to the 2021 TIME 100 Next List. https://t.co/aPfmNJ74Oj https://t.co/syhYKT4ceq","date":"Fri Oct 15 18:36:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Another #IUPproud moment! Our nursing BSN has been ranked #8 in Pennsylvania by Nursing Schools Almanac. https://t.co/RFxyQVwJ2C https://t.co/ZACCb3KMEw","date":"Thu Oct 14 23:06:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are falling for this view 🍂 https://t.co/dTGWc4j9Ej","date":"Thu Oct 14 20:55:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are throwing it back to 1945 at the College Lodge. Students were celebrating the end of World War II and the return of men to campus. Order your copy of “The IUP Story: Indiana University of Pennsylvania, from Normal School to University.” today. https://t.co/dvVzYdF03l https://t.co/ibDiqP6539","date":"Thu Oct 14 15:14:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Thinking about going to grad school? We're here to help! Join us 10/20 at 6pm to learn more about our graduate programs, hear more about the application process and get your questions answered. https://t.co/i9OLsIhCdG https://t.co/8PEcDREPmg","date":"Thu Oct 14 13:32:50 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Have you registered for open house yet? Open houses are your all-in-one campus visit where you can experience academic sessions and residence hall tours. The next open house is this Saturday, 10/16. Sign up here https://t.co/5h9egep33h https://t.co/lZaVrW5KK1","date":"Wed Oct 13 21:22:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"A great opportunity to help employers and students network!","date":"Wed Oct 13 13:11:56 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Need help registering for the Spring 2022 semester? Join us today from 4-5pm for a workshop that will help make sure you are on the right path to success. https://t.co/6pcTkymg6w https://t.co/PZoUWx102E","date":"Tue Oct 12 19:21:46 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Need to catch up or get ahead on your graduation requirements? Take an online class over winter break! Winter Session registration is now open: https://t.co/eRd0WV7FPr https://t.co/XiVwakonVI","date":"Mon Oct 11 21:28:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Registration for spring classes opens today! Follow the link to find your registration window and everything you need to be ready for next semester. https://t.co/cEQWRnY8GV https://t.co/V7mZJ0QSx6","date":"Mon Oct 11 16:27:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Welcome home, @Erika_Stanish! #IUPproud","date":"Fri Oct 08 16:00:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#TalonsUp","date":"Fri Oct 08 12:25:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us Monday, October 11 for IUP Decision Day! Tour campus, meet with admissions counselors who will help achieve your goals, and get acceptance letter the same day. Spots are limited, so register today! https://t.co/P6IYKRBBYX https://t.co/GduibkptmD","date":"Thu Oct 07 22:18:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Be sure to stop by the Eberly Café at 6pm today for great food!","date":"Thu Oct 07 19:29:58 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#TBT to the Oak Grove in 2005. A beautiful place to study or hang out with friends, especially in its fall colors. Order your copy of “The IUP Story: Indiana University of Pennsylvania, from Normal School to University.” today. https://t.co/dvVzYdF03l https://t.co/39TfHkgS1S","date":"Thu Oct 07 19:21:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us for a panel discussion to reflect on the history and politics of Afghanistan. Panelists will include: Christine Baker, Terilyn Huntington, Ali Sayed, Cory Shay, and Rachel Sternfeld.https://t.co/rFwlbrSscA https://t.co/mO1WU6TxMY","date":"Thu Oct 07 15:49:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"🦖Shout out to IUP Professor Shundong Bi, who worked with other scientists to find a site in China with over 100 dinosaur footprints from the Jurassic. #IUPproud 🦖","date":"Tue Oct 05 18:20:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"https://t.co/wvj0ihMzve","date":"Tue Oct 05 15:12:49 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Homecoming 2021 was one for the books! Thanks to everyone who came out and celebrated. Don't forget to tag us in your Homecoming pictures with the hashtag #IUPHoco21 https://t.co/r0D1RtrydF","date":"Tue Oct 05 15:12:48 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@j_keps We send campus-wide alerts when University Police determine there is a threat to the community. Police investigating this incident did not determine it as a threat and continue to believe it was an isolated incident.","date":"Tue Oct 05 13:19:23 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Please consider this Thursday, Oct. 7. The panel will also feature Dr. Christine Baker (Department of History), Mr. Ali Sayed (Muslim Student Association, PhD candidate, and former candidate for Parliament in Afghanistan), and Mr. Cory Shay (Military Resource Center).","date":"Mon Oct 04 14:00:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"An IUP English professor helps police cadets explore the human side of policing using methods from the humanities. By bringing novels about Black detectives to police training, Veronica Watson opens conversations about race, fairness, and policing. https://t.co/mCwnT4L8dw","date":"Mon Oct 04 13:55:41 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"An inclusive rainbow flag now flies next to @IUP_MCSLE, in response to requests by LGBTQIA+ students. A formal dedication takes place Oct, 12, at noon.\n\nFollow the link to find out about the support available for LGBTQIA+ students at IUP. https://t.co/Z9tGz6HHZe https://t.co/SHihaaadGo","date":"Sun Oct 03 15:15:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"If you're back for #IUPHoco21, you might notice a familiar name: Leonard Hall. In honor of Charles &amp; Donna Cashdollar, the HSS Building has become the third IUP building to bear the name Jane E. Leonard. Click for more about the renaming and \"Aunt Jane.\" https://t.co/S4ZpNtLamZ","date":"Sat Oct 02 17:15:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We wish all our alumni could come back for #IUPHoco21 this year. But for those who can't make it, we've installed a brand-new Grove Cam! Stop by and spend a little virtual time in the Grove whenever you like. #IUProots https://t.co/jorfvdU0m3","date":"Fri Oct 01 21:04:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud","date":"Fri Oct 01 13:32:46 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It's almost the weekend, which means it's almost time for Homecoming! Many great events are happening in the next couple of days, including a night of laughter with Comedian Bill Engvall and a Class of 2020 celebration. #IUPHoco21 https://t.co/c0v14wvMTc","date":"Thu Sep 30 16:00:36 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Kick off Homecoming weekend with this Fireside Chat with the Black Experience Alumni Committee tonight at 5:00pm in the Elkin Hall Great Room. A discussion to improve the academic success and social experience of Black students at IUP. See you there! https://t.co/3YxQ2Jp2MP https://t.co/B6kjLURyru","date":"Thu Sep 30 14:51:50 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Welcome, back alumni! In today's video, @PresDriscoll welcomes alumni back for IUP Homecoming, previews this weekend’s events, and provides an update on some of the challenges @IUPDining is currently facing. #IUPHoco21 https://t.co/k5F6wwxwHd","date":"Thu Sep 30 12:15:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Spirit Week is in full swing and we are so excited for Saturday! Don't forget to tag us using #IUPHoco21. https://t.co/9RoppIvAks","date":"Wed Sep 29 16:16:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Figure out your next step—today, 10am, KCAC. Find an internship, a grad program, or a job. #IUPStartsCareers","date":"Wed Sep 29 12:23:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Welcome to Homecoming Week! We know you are just as excited as we are. Join us this week as we celebrate Spirit Week. Don't forget to tag us using #IUPHoco21. https://t.co/0eKvJ6mZHK","date":"Mon Sep 27 20:50:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We can barely contain our excitement that it's finally Homecoming Week! How about you? Don't forget to mark your calendars for Saturday, October 2. Activities begin at 10:00am with a parade on Philadelphia St. 📆  https://t.co/kwP2QdxFZH https://t.co/kkGsh4OEqm","date":"Sun Sep 26 14:13:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are #IUPproud that we have been ranked in U.S. News and World Report for \"Best Undergraduate Nursing Program\" and “Best National Universities.\" When did you graduate from IUP? Let us know below! https://t.co/HwPRiNSKoH https://t.co/dEp5Hr4psP","date":"Thu Sep 23 22:13:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are throwing it back to 1967 Homecoming with this dragon showstopper. We are only 10 days away from one of the best weekends of the year!#IUPhoco21 Order your copy of “The IUP Story: Indiana University of Pennsylvania, from Normal School to University.” https://t.co/dvVzYdF03l https://t.co/wyTGQWWFJO","date":"Thu Sep 23 16:15:11 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Happy First Day of Fall! 🍂 https://t.co/JX4iUqJ2tW","date":"Wed Sep 22 14:04:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We can't stop thinking about how much fun Family Weekend was! What was your favorite Family Weekend memory? https://t.co/ySyAs8y6aW","date":"Tue Sep 21 15:55:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We’re looking for current IUP students—undergrad and grad—to work as paid extras in some new commercials we’re filming next week. Follow the link to learn the details! https://t.co/s1k4JEOYxX https://t.co/DswgPtD5Ao","date":"Mon Sep 20 19:34:52 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"If you dive deep into it, you'll discover that math is more than numbers and symbols. For IUP graduate Vincent Thompson, math is freedom. It's helped him grow, communicate, and even turn his life around. #IUPproud https://t.co/UzCFsTbIQ7","date":"Mon Sep 20 14:04:23 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We had the best time yesterday with all of you for Family Weekend and cheering on the Hawks. What was your favorite event? 🏈 https://t.co/CTmWB4pEsc","date":"Sun Sep 19 18:58:19 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We will never get over these views. #IUProots https://t.co/JSrAbg7ScL","date":"Fri Sep 17 16:02:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We have been ranked by Washington Monthly as one of the “Top 14 Universities in Pennsylvania” and \"Best Bang for the Buck University\" We say it every time, but we are always #IUPproud. You can read more here https://t.co/UyUnBFWJpA https://t.co/MhLVkAcfnL","date":"Thu Sep 16 14:58:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Just a mid-week brain break!\nPhotographed 8/20/21. https://t.co/O17cJXG7Gr","date":"Wed Sep 15 15:46:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today, President Driscoll discusses IUP Day. He also shares his excitement about the first Crimson Hawks Football game and recognizes the 9/11 remembrance ceremony. @PresDriscoll https://t.co/KbnSVWrila","date":"Tue Sep 14 19:44:27 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We're so excited for the return of Family Weekend and the Hall of Fame football this weekend. Register for a weekend of fun here https://t.co/VyBdLEEVWW. The last day to register is 9/16. We can't wait to see you soon!\nThis photo was taken 8/18/20. https://t.co/ZcnztXrL4W","date":"Mon Sep 13 20:08:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@LuvinMotherhood It's still there. Just out of frame and further to the right.","date":"Mon Sep 13 12:54:43 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Honoring the lives lost 20 years ago today and remembering the three IUP alumni lost: Donald Jones ’80, William Moskal ’79, and William Sugra ’93. #NeverForget\nThis photo was taken 9/11/20. https://t.co/luY1RrYppD","date":"Sat Sep 11 14:45:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"20 years after Flight 93's crash, Tim Lambert '92, who spoke at today’s 9/11 ceremony, and NPR's Scott Detrow tell the story of what happened that day and what happened over the years to come. You can listen here https://t.co/jS9VM15qi2 @nprpolitics","date":"Fri Sep 10 21:25:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Members of IUP’s Army ROTC stand at attention during the memorial ceremony. https://t.co/Bufrir7wWM","date":"Fri Sep 10 19:46:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Tim Lambert ’92, journalist and graduate of IUP’s communications media program, speaks during the memorial ceremony. Lambert’s family owned part of the land where Flight 93 crashed on Sept. 11, 2001. https://t.co/zz2Pt3hpHy","date":"Fri Sep 10 19:46:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Bethany Barefoot ’16 speaks during the memorial ceremony. Barefoot was the 2014–15 recipient of the Bill Sugra Memorial Scholarship. https://t.co/zNSO9rp0M3","date":"Fri Sep 10 19:46:08 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"A member of IUP’s Army ROTC unit holds the American flag. https://t.co/ZoRChVkHCu","date":"Fri Sep 10 19:46:07 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP President Michael Driscoll speaks during the ceremony. His remarks included a remembrance of three IUP alumni lost in the World Trade Center attacks: Donald Jones ’80, William Moskal ’79, and Bill Sugra ’93. https://t.co/MQ5uoQ67xg","date":"Fri Sep 10 19:46:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We observed the 20th anniversary of the September 11, 2001, terrorist attacks by hosting a memorial service in the IUP Oak Grove on September 10, 2021. https://t.co/YIhRmYz8H7","date":"Fri Sep 10 19:46:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"You can catch us here all weekend! 😎 \nThis photo was taken 4/11/21. https://t.co/kAyQR91E07","date":"Fri Sep 10 19:02:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We have been selected for the Princeton Review's Best Colleges guidebook for the 21st consecutive year. IUP is a place where you can achieve academic excellence while also feeling right at home. We are #IUPproud! Read more here https://t.co/0u5LwjXe3g https://t.co/izli5bakWa","date":"Thu Sep 09 19:23:17 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are so excited to celebrate and recognize the Class of 2020 at Homecoming this year! All Class of 2020 graduates are invited to the Homecoming Huddle as guests of honor. Preregister here https://t.co/9CFuyuP0Cq https://t.co/vVlrKGNMXj","date":"Thu Sep 09 13:27:25 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us on Friday, September 10 as we gather near the 9/11 memorial in the Oak Grove to commemorate the tragic events of 9/11. This program will begin at 11:40 a.m. We will mourn those we lost, while remembering those who helped us recover. https://t.co/Osk4BLmlDW https://t.co/DJzLe3hNIX","date":"Wed Sep 08 17:43:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Reforesting the Flight 93 memorial in Shanksville—a site damaged by mining long before the #September11 crash—has involved IUP faculty and students for nearly a decade. Saturday marks the tragedy’s 20th anniversary. @IUPBiology #IUPresearch #IUPproud https://t.co/UjxWBD6ftC https://t.co/xyN6uLra0u","date":"Tue Sep 07 12:10:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Happy Labor Day, Hawks. Enjoy the long weekend! #IUProots https://t.co/0U7H3894cd","date":"Mon Sep 06 16:22:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are once again #IUPproud. Eberly College of Business MBA program has been ranked #1 in Pennsylvania by Best Value Schools. Did you receive your MBA from IUP? Let us know what year you graduated with your MBA! https://t.co/AYePCL5vRw https://t.co/hfbu9Qknab","date":"Fri Sep 03 20:57:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Rise and shine! Enjoy the long weekend. #IUPproud \nThis photo was taken 8/15/21. https://t.co/1MoPpSy1vb","date":"Fri Sep 03 14:26:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#TBT to a map of the IUP campus in 1985. Changes happen over the years, but we will always be #IUPproud https://t.co/yT8FYtXFRl","date":"Thu Sep 02 19:48:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Friday is National College Color Day! Don't forget to wear your Crimson and Gray and share a photo with the #IUPproud hashtag.\n\nPhoto from September 2019. https://t.co/6O6FmFrkRC","date":"Wed Sep 01 17:47:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In August, IUP kicked off the Crimson Scholars Circle. A new program designed to reduce the retention and persistence gap for Black and Brown students. Crimson Scholars combines support, learning, and guidance. Click here https://t.co/6jtxNEtZcY to see their week on campus. https://t.co/6ZxDdcXq8t","date":"Tue Aug 31 20:30:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@stephliebel The winners have been notified by an email from the interim provost; We’re working on publicity about the scholarship and recipients, but we’re checking with the recipients first to make sure they are comfortable with publicity.","date":"Mon Aug 30 18:18:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"First week ✔️ How was your week? #IUProots https://t.co/rHVSZeXbTU","date":"Fri Aug 27 20:19:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@_TayHolder Log in to MyIUP from https://t.co/Tu26XJyy9d. On the Academics page, scroll to the Class Schedule section and click detailed class schedule. Your Student ID begins with an @ sign and is in the top-right corner of the page.","date":"Wed Aug 25 20:26:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Welcome Class of 2025! We are so excited you are here. Be sure to stop by Folger Student Center to sign your name on the hawk! #IUPbound #IUP25 https://t.co/NUakJlIaCU","date":"Tue Aug 24 15:18:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"What if one class made you change your mind about the rest of your life? That's what happened to Susie Adams. While in the field for a geology class, she discovered a passion she never knew existed inside her. #IUPproud @IUProcks https://t.co/6uRSvtkngR https://t.co/rxWuk8YZPi","date":"Mon Aug 23 15:55:25 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In this week's update, President Driscoll welcomes back students and employees for the fall semester. He talks about the updated COVID-19 policies on campus this fall and upcoming activities. https://t.co/fDIFYy0bCI","date":"Thu Aug 19 18:17:13 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The average GPA for IUP student-athletes has risen every semester since IUP became one of the few State System schools to designate an academic support staff member for athletics. https://t.co/r4K4uRPeLL @IUPCrimsonHawk @IUPgolf @IUPSAHE @NCAADII #TalonsUp https://t.co/oKhR7bzg4E","date":"Wed Aug 18 14:22:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"COVID Update: IUP will require everyone to wear masks in indoor public spaces, regardless of their vaccination status. This means vaccinated students and faculty will need to wear masks in face-to-face classes. More details are available on our website: https://t.co/qmlYD1DgQx https://t.co/f7QyM2pBsE","date":"Mon Aug 16 21:08:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"A few reminders of our COVID-19 policy. Testing and vaccinations are available for free\nat the IUP Health Service. Masking is required on Buses and Health Service offices. Vaccinated? Masking is highly recommended for most indoor spaces. Find out more here https://t.co/UilbuvWE8o https://t.co/ToC8JQeboD","date":"Fri Aug 13 21:11:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Only 29 days till football starts...but who's counting!? #TalonsUp @IUPfootball @IUPCrimsonHawk https://t.co/ivvihpjLxc","date":"Fri Aug 13 18:42:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"For this #ThrowbackThursday we are going back to 2019’s Welcome Week. What are you most excited about for Welcome Week 2021? https://t.co/7PlF0YWCkM","date":"Thu Aug 12 15:52:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"All smiles when you are #IUPbound https://t.co/N2KtLkYTEB","date":"Wed Aug 11 16:50:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are throwing it back to the early 1960's to when freshmen wore dinks during Welcome Week. A tradition that held through after WWII. We are so excited to welcome the class of 2025 in 18 days. Order your copy today https://t.co/dvVzYdF03l https://t.co/ENjTigZC8J","date":"Thu Aug 05 21:53:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Views like this make this Wednesday just a little better! #IUProots https://t.co/2sekVkDLjE","date":"Wed Aug 04 16:14:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"With guidance from mentor professor Mark Piwinsky, Woodside is creating a video about students doing research on campus during COVID-19. https://t.co/wHjmLjur8J","date":"Tue Aug 03 13:41:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Hayley Woodside is researching how filming, production techniques, storytelling, and student research have adapted to pandemic conditions. https://t.co/bmvj2gW5z2","date":"Tue Aug 03 13:41:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Adeline Kubicsek is investigating jewelry and metals techniques, in consultation with mentor professor Sharon Massey, to create a body of work around the theme of environmentalism and sustainability. https://t.co/6DPgUzsK0u","date":"Tue Aug 03 13:41:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Sophomore Scott Semelsberger, with guidance from mentor professor Cuong Diep, is researching the process in which zebrafish use stem cells to make new kidney tissue. https://t.co/xOpFltxaou","date":"Tue Aug 03 13:41:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Isaiah Woodard is studying the biochemical and behavioral effects of 5-Hydroxytryptamine in mice. Woodard’s research, with mentor professor Daniel Widzowski, is related to serotonin receptors that function as a neurotransmitter in the nervous system. https://t.co/rKdIRjgnBh","date":"Tue Aug 03 13:40:58 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It’s been a great summer for research at IUP. Here are a few images of students in our U-SOAR (Undergraduate Summer Opportunities for Applying Research) program exploring research topics with professor mentors. @IUPBiology @IUP_Edu_Comm #IUPproud #IUPusoar https://t.co/a8obfGEMSh","date":"Tue Aug 03 13:40:58 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The IUP Marching Band...the pride of the university! If you are interested in joining \"The Legend\" sign up here to be apart of their 100th year of performing. #IUPproud @IUP_Music https://t.co/54bVEVGzzo https://t.co/mGPxmtoFkj","date":"Mon Aug 02 21:33:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We want to know what movies you want to see during Welcome Week this year. Vote here! https://t.co/OUbUreBwyL #IUPWelcomeWeek #IUPClassof2025 https://t.co/IM5vg0vaGF","date":"Wed Jul 28 15:20:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Need a reminder of your new class schedule? Forgot where Eberly Hall is? Be sure to download IUP Mobile today to connect you to Indiana University of Pennsylvania with personalized information, news, and events. https://t.co/pXizS92DTZ https://t.co/Schb3CPcxS","date":"Tue Jul 27 21:06:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Fish sometimes can't swim farther down a stream because of a culvert under the road. Grad student Nick Christensen is tracking trout to see what can be done to help the trout population stay strong. https://t.co/MtIwODQ3Fl @WaterLandLife @IUPBiology @IUPGradStudies #IUPproud","date":"Tue Jul 27 12:51:48 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"As of July 23, IUP will remove its requirement for indoor face coverings/masks for fully vaccinated individuals. Individuals who are not fully vaccinated are urged to follow the CDC guidelines. More information can be found here https://t.co/DJ0WP0anbh https://t.co/LAwBXAs3rX","date":"Fri Jul 23 15:47:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP is committed to hands-on opportunities—from an internship at Tesla, to an internship at big-four accounting firm Ernst &amp; Young, to an internship in graphic arts for a marketing agency, and so much more. We help you make your mark. https://t.co/k9QPHhBNkd #IUPProud https://t.co/SQH0bcDokD","date":"Tue Jul 20 18:06:08 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"What are your plans this weekend? Ours? We're showing high school students our awesome campus and giving HS seniors admissions decisions before they leave to go home. See how and sign up for our 9 or 11 a.m. timeslots https://t.co/BKEZCQrKfS. We hope to see you there! #FutureHawk https://t.co/sMqG2thuaF","date":"Tue Jul 20 00:43:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We can't wait to see you on campus in 47 days! #IUPBound https://t.co/KeenkqrC9h","date":"Fri Jul 16 15:08:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are #IUPProud that we have been ranked #6 in Pennsylvania for Best College for Veterans according to Military Times. Were you a Veteran at IUP? Let us know what you are up to today! https://t.co/ZYDKtV2IXf","date":"Thu Jul 15 20:35:08 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Speech-Language Pathology students at IUP have an extra advantage, thanks to a new lab that simulates a variety of medical settings—from a neonatal intensive care unit to a radiology suite—adding to the students’ training in school settings. #IUPproud https://t.co/JcH3iLfVhs","date":"Tue Jul 13 18:16:07 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Applications for Fall 2022 are now open! Start yours today https://t.co/XOzBtHFLNz. Want more info? Find out more here https://t.co/QRhBUDt6pE. Who's ready to become a Crimson Hawk? #FutureHawk #Classof2026 https://t.co/XAThyVSwlp","date":"Mon Jul 12 16:40:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Welcome to the dog days of summer! 🐶😎 #IUPProud https://t.co/dvWL9QETh6","date":"Fri Jul 09 20:10:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Eleven IUP undergraduate and graduate anthropology students are excavating the site of a WWII plane crash in Germany through an IUP field school—part of a continuing US effort to account for missing personnel from the nation’s past conflicts. #IUPinternational @IUPHawksAbroad https://t.co/EULKCkx40H","date":"Wed Jul 07 23:09:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Have a safe and happy 4th, Hawks! #IUPProud https://t.co/0lL4yZUtmK","date":"Sun Jul 04 13:48:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In his decade of work on The IUP Story, to be published later this summer, professor emeritus Charles Cashdollar found two key themes: “consistent commitment to excellence” and “persistence in overcoming obstacles.” Read “The Story behind The IUP Story.” https://t.co/fHPTtRwWQT https://t.co/tdi9vEEYRD","date":"Tue Jun 29 21:06:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"During the 2019-20 school year, IUP provided a total $14M+ in scholarships, awards and assistantships to ease the financial burden for students. This and other stories can be found in our 2020 President’s Report. https://t.co/sRizagwmEh #IUPProud https://t.co/48UYAzc95Q","date":"Wed Jun 23 16:05:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We are getting so excited about the progress of Kopchick Hall, opening in 2023. Kopchick Hall will be the home of science and mathematics research, teaching, and learning. A place where scientists can work side-by-side every day. Learn more here: https://t.co/sRizagwmEh https://t.co/WqzrJRoS22","date":"Tue Jun 22 18:58:11 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Great interview with Prof. Dan Lee, chair of our Department of Criminology and Criminal Justice. #IUPproud","date":"Tue Jun 22 14:00:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us this Wednesday at 3 p.m., in the Elkin Great Room or virtually https://t.co/IcZVgTwGMq, to learn more about being an ally with members of the LGBTQIA+ community. The knowledge and skills you’ll gain through Ally Training have many applications. #PrideMonth @LGBTQIAatIUP https://t.co/r7R6P5ELx2","date":"Tue Jun 22 00:24:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"You can find more information about our fall plans here: https://t.co/FW1M6J4n58 https://t.co/29sQP9gsxW","date":"Mon Jun 21 20:10:14 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Our students and employees have done an amazing job helping to mitigate the spread of the virus, and we know that Crimson Hawks will again rise to the occasion to keep each other safe.","date":"Mon Jun 21 20:10:13 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"COVID-19 testing and vaccines will be available on campus for students. Here’s why we’re asking everyone to mask up indoors: State System universities like IUP are not legally permitted to require COVID vaccinations or ask about the vaccination status of students or employees.","date":"Mon Jun 21 20:10:13 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Because we won’t know the vaccination rate on campus—and we don’t have space inside our classrooms for social distancing—we are requiring masks to keep everyone safe.","date":"Mon Jun 21 20:10:13 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Fall Semester Update: When IUP resumes traditional, in-person classes this fall, employees, students, and visitors will no longer be required to wear a mask outdoors. Masks will still be required indoors and on IndiGo buses.","date":"Mon Jun 21 20:10:13 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Dr. Bharathan has been doing amazing work during the pandemic to bring rapid COVID-19 testing to rural communities. Find out more here: https://t.co/UmCHKbbs2L and in the podcast linked below. #IUPproud","date":"Mon Jun 21 14:00:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today, we commemorate the official end of slavery in the U.S. In this picture, a crowd celebrates Emancipation Day (aka Juneteenth) in 1905. IUP continues to make strides for our campus to be a safe and inclusive space. Learn more here. https://t.co/sRizagwmEh #Juneteenth2021 https://t.co/7vdo1TR2du","date":"Sat Jun 19 17:17:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP Libraries employee Carol Asamoah—presented “The ABCs of Juneteenth” during the Indiana County NAACP’s four-day virtual celebration of Juneteenth to explain the importance of the holiday. https://t.co/KW20TfHCzH @IUPLibraries @IUP_MCSLE #Juneteenth2021 https://t.co/y1tYoq1zGf","date":"Thu Jun 17 21:55:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@Studydotcom editors select programs for rankings based on the programs that provide a high-value education, all while still being accessible and affordable. Find out more about getting your degree in criminology here: https://t.co/wqIx7rlb7d #IUPProud https://t.co/HBfm48Y7Xi","date":"Wed Jun 16 17:39:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join us tomorrow at 3 p.m. as Dr. Jennifer Demchak talks about the difficulties the LGBTQIA+ community has faced receiving health care services during the pandemic. https://t.co/IcZVgTwGMq #PrideMonth https://t.co/JdLsmgqqBN","date":"Tue Jun 15 14:10:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join Dr. Jennifer Demchak virtually on June 16 as she discusses the difficulties the LGBTQIA+ community has faced over the years in receiving health care access and overcoming negative attitudes from health care providers, especially during the pandemic. #PrideMonth https://t.co/hMnngfpSAi","date":"Fri Jun 11 19:59:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Hey Hawks! Did you know that since last fall, each incoming freshman is assigned a staff or faculty Guide who can answer questions or provide guidance? No topic is off limits! This story can be found in our 2020 President’s Report. https://t.co/sRizagwmEh #IUPProud @PresDriscoll https://t.co/MXl7Wy4su6","date":"Fri Jun 11 14:48:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"One of IUP’s greatest accomplishments in 2020 was our quick reaction to COVID-19. Migrating well over 1,500 courses in 10 days. IUP was recognized by the Pittsburgh Technology Council for the Top COVID Pivot Award in November! Find out more here: https://t.co/sRizagwmEh https://t.co/dI8gTchrZn","date":"Thu Jun 10 00:10:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This year’s “It’s On Us PA” grant focuses specifically on our LGBTQIA+ community. The $30k grant combats campus sexual assault through a community bystander intervention program. More info here: https://t.co/zCkdwhxKFc #PrideMonth #IUPProud @IUP_MCSLE https://t.co/7tPamD2n3k","date":"Wed Jun 09 14:03:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP Athletic Department is excited to announce its 12-member Hall of Fame Class of 2021. Representing eight different sports and comprise the department’s 25th induction class. You can find more information here: https://t.co/OtPwFcipMJ #IUPProud @IUPCrimsonHawk https://t.co/qdpDEo0D5r","date":"Mon Jun 07 19:29:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In recognition of Pride Month, members of MCSLE share their stories of being allies or members within the LGBTQIA+ community. Join us as an ally or member of the community on June 9th at 3 PM! @IUP_MCSLE #PrideMonth #IUPProud https://t.co/EeVaF98kYR","date":"Fri Jun 04 20:45:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Meet Khala Vines, a sophomore with a double major in international and Asian studies. Khala just recently became a three-time international scholarship winner! This and other stories can be found in our 2020 President’s Report. https://t.co/sRizagwmEh #IUPProud @PresDriscoll https://t.co/CrG7SXSNfU","date":"Fri Jun 04 14:45:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Happy Pride Month, Hawks! You will notice we have a new look this month that includes our new Progress Pride flag that brings focus on inclusion and progress within the community. #PrideMonth #IUPProud https://t.co/xH34rw2n2p","date":"Thu Jun 03 22:11:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@AWBeattieCC Congrats Zach!","date":"Tue Jun 01 13:00:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today, we remember those who served and honor their sacrifice. #MemorialDay #IUPProud https://t.co/eQYMdcTyhJ","date":"Mon May 31 16:43:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP has been ranked in the top 10 for online colleges in PA, and top 20 in the nation by EDSmart! #IUPProud! https://t.co/mkN9gXuqRN https://t.co/l9nitFIy7O","date":"Fri May 28 16:07:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Got off track this past year? No worries – you still have time to catch up and register for Summer Sessions. You can find more information here: https://t.co/fDfvVe0AOL https://t.co/rNgYZrud5C","date":"Tue May 25 19:40:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@bradwalk17 Congratulations! See you in the fall Adam. #IUPProud","date":"Tue May 25 12:49:47 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@IUP_Music Congratulations IUP Symphony Orchestra!","date":"Mon May 24 20:58:55 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We just can't stop celebrating the amazing spring 2021 graduates! Check out our virtual commencement ceremonies that are happening tomorrow for those who couldn't join in person: https://t.co/Hd8vfVaZRm. Wishing all our graduates success in their futures. #IUPproud #IUPCongrats https://t.co/ZieSPyl06x","date":"Fri May 21 15:09:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP has been ranked #7 in the nation of Best Literacy Master of Education. #IUPProud! https://t.co/Payza1FtON https://t.co/2AXOdXxgxt","date":"Thu May 20 20:51:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Two Art and Design professors and several art students recently came together to stage a public art installation across from the Oak Grove. An island getaway experience without leaving Indiana. Learn more about the Sculpture Support System here:https://t.co/3flxwjcMsK @ArtHotline https://t.co/AXPydpeLMk","date":"Wed May 19 14:25:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Though 2021 kicked off with unprecedented conflict, the IUP community moved ahead. Professors overcame obstacles to give students a strong education and our students met challenges with hard work and strength. We embraced the need to learn from one another. https://t.co/v2vr3lnxzQ","date":"Mon May 17 20:00:30 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Attending college this year was challenging in all-new ways, but you did it. Today early Summer Sessions start, a great way to bounce back and catch up. Check out https://t.co/fDfvVe0AOL to learn more about the other Summer Sessions. https://t.co/l8xc2xUfL6","date":"Mon May 10 18:19:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It’s graduation day! Congratulations to the Class of 2021. Share your celebration using #IUPcongrats! Watch the webcast of the commencement ceremonies: https://t.co/dbeblY1lNx https://t.co/3uFovpiHpZ","date":"Sat May 08 21:28:49 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Congratulations to the IUP master’s and doctoral Class of 2021! Don’t forget to share your celebration using #IUPcongrats! Watch the livestream of the commencement ceremony: https://t.co/dbeblY1lNx https://t.co/cLvrDE1J4g","date":"Sat May 08 01:59:24 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Folger is closed today but check out these study spaces that are available. https://t.co/4vIsdbhG1S","date":"Fri May 07 14:46:08 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join @IUP_MCSLE today from 5-7PM in the Elkin Hall Great Room to show off your artistic skills and participate in the Finals Break Paint Party. Masks and social distancing will be required. https://t.co/WKQIMLoucr","date":"Thu May 06 15:19:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll shares his excitement for the 2021 graduating class. He also recognizes the community’s support for keeping the campus safe and healthy with COVID-19 protocols and the upcoming Council of Trustees meeting. https://t.co/1jKp69xVbj","date":"Thu May 06 14:13:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP has been ranked #16 on @StudyDotCom’s list of Best Bachelor’s Degree Programs in Nutrition! This is based on academic and career resources and the quality of education. #IUPProud Find out more here: https://t.co/9dEODolR6Z https://t.co/X0GucSLwJ1","date":"Wed May 05 20:46:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Don’t forget Putt P.O.D. closes at 4PM today and will remain closed the rest of the week. https://t.co/c7enJ2jOIN","date":"Wed May 05 15:05:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Take a study break and grab some pancakes served by none other than IUP’s celebrity servers, tonight from 10:30 p.m. to midnight at North Dining. All students are welcome free of charge, whether they have a meal plan or not. https://t.co/nyE2VdGbV7","date":"Mon May 03 20:33:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"As a sophomore, Justin Brown M’13 created a diversity awareness program. He's since presented it more than 1,000 times on 40 national stages. The IUP Student Affairs in Higher Ed program grad discusses his diversity, equity, &amp; inclusion journey. https://t.co/aOPtY1c4Cw @IUPAlumni","date":"Mon May 03 16:32:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Did someone say puppies? Come hang out with IUP’s famous therapy dogs at Folger from 6PM-7:30PM. Health and Wellness Promotion will also have other activities set up for you to participate in! https://t.co/jqmNJ0CTCy","date":"Mon May 03 16:10:08 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"We’ve got everything you need to get those last study sessions in before finals, check out our resource guide: https://t.co/lfNyQ9d5Sn https://t.co/EMgPCjDxDT","date":"Mon May 03 13:26:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@serena_estok We sure are! Monday, May 3, 10:30 p.m. to midnight at North Dining. You can find all of our final events here: https://t.co/NY6wMYAIAX","date":"Sat May 01 01:46:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@sierra8leonard Folger Hall is open until 10PM and the HUB is open until 11pm throughout finals. More details are here: https://t.co/lfNyQ9d5Sn","date":"Fri Apr 30 13:24:57 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Today is our annual Chalk the Walk in the Oak Grove! Have something to say or an idea you want to share? Free t-shirts while they last and a chance to win prizes for participating students: https://t.co/EqNXPcx58x https://t.co/NNeoopstHD","date":"Wed Apr 28 16:44:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Have something to say? Something to express, or just share? Come to the Oak Grove on Wed. for the annual Chalk-on-the-Walk Sidewalk Chalk contest. We’ll provide the chalk (and prizes!) and you can make any social, political, or other comment that you want. https://t.co/iL4p6Ajyus https://t.co/uXkyshiULM","date":"Tue Apr 27 14:29:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@adakinnz Details on Bill Nye's Zoom visit are here: https://t.co/lpm7OMsTuE\n\ncc: @STATICatIUP","date":"Mon Apr 26 19:52:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Since last fall, IUP has provided every new freshman &amp; transfer student with a Guide—in addition to their academic advisor—to answer their questions &amp; connect them with resources. Here's a check-in on how the program has helped students in its first year. https://t.co/HrUdjP1odU","date":"Mon Apr 26 16:45:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Way to go, Hawks! #TalonsUp","date":"Sun Apr 25 21:34:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@fanlimah Scholarships for graduate students vary a lot depending on the degree you seek. We recommend contacting your new department—they'll know about any scholarships especially for your program. Also, check out our pages on International Student Scholarships: https://t.co/VmwCztGRdU","date":"Sun Apr 25 20:31:12 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@CCHSRedDevils We look forward to seeing all seven of you on campus this fall! #IUPBound","date":"Fri Apr 23 20:35:16 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"President Driscoll recognizes members of the university community for their support of one another through challenging times. He also recognizes important student accomplishments and expresses his appreciation for the generosity of the IUP family. https://t.co/A4mNcIxKFN","date":"Fri Apr 23 15:15:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Congratulations to our 2021 Scholars Forum Winners! From video game success to engineered nanomaterials to juried art and everything in between—check out our winners: https://t.co/5MXiYJ9VPw https://t.co/mOUwTUTRb6","date":"Thu Apr 22 21:11:29 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The student virtual town hall with President Driscoll is TONIGHT at 5:30 p.m. Get your questions about fall semester, IUP NextGen, and more answered.\n\nIt's open to all students, but preregistration is required: https://t.co/yhpJXGdLGC","date":"Thu Apr 22 16:06:11 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Want to learn about dining options on campus? Join Abby as she takes you on a tour of North Dining, the Crimson Café (where you’ll find Starbucks), the P.O.D.s, and the Hawk HUB food court, which includes Chick-fil-A. There’s something for every taste!  https://t.co/sVSIPyZBh8","date":"Wed Apr 21 17:36:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@janellmaxine We couldn't know exactly how many seats would be available for friends &amp; family until we had a count of participants. Now we know &amp; we can make more tickets available. We know not everyone can change plans to use the extra ticket, but we want to give everyone the opportunity.","date":"Wed Apr 21 15:49:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@IUP_MCSLE Registration is here: https://t.co/v0Ujn4WpRY","date":"Tue Apr 20 20:31:23 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Tonight at 7, students from the IUP Chapter of NAACP, Students Against Racism, SGA, Dr. Veronica Watson, and Debra Evans Smith ’81 will lead a discussion on the Chauvin trial.\n\nSponsored by @IUP_MCSLE and @iupse_t9. All IUP students are welcome. https://t.co/PxJnKgFMR2","date":"Tue Apr 20 20:18:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Have questions about fall semester? IUP NextGen? Coming schedule changes like the Common Hour and additional time between classes? Ask President Driscoll and other university leaders at this students-only event on April 22 at 5:30 p.m. Register here: https://t.co/dTzFnDrX0e https://t.co/ABERAc1zPj","date":"Tue Apr 20 18:10:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The outdoor concert by the IUP Wind Ensemble and Symphony Orchestra to celebrate the arrival of spring has been moved to its May 2 rain date.","date":"Mon Apr 19 18:58:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Three siblings. Three All-Americans. The Mikesells are a force to be reckoned with, in and out of the pool. https://t.co/fQiYgFsN69 https://t.co/xIh4uiJQ5n","date":"Mon Apr 19 16:34:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@rpaterno1023 So you do have it at this point? We apologize for any delay.","date":"Mon Apr 19 16:02:25 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@rpaterno1023 If you still haven't received your diploma, please contact the Registrar's Office https://t.co/7A0hb89NAH\n\nDiplomas should be in graduates hands by 3 weeks after the ceremony, whether it was virtual or in person.","date":"Mon Apr 19 14:50:36 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"For the third year in a row, tuition at IUP and other State System schools has been frozen for the upcoming academic year. Learn more at https://t.co/7z5WAsa1nE https://t.co/kqNn0aUQnb","date":"Sat Apr 17 14:29:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Congratulations to the 2020 and 2021 Distinguished Alumni Award recipients who will be honored for their career achievements and service in a virtual ceremony on April 17. https://t.co/8pKXqAS4Ky","date":"Fri Apr 16 20:02:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Thinking about graduate school? Then you'll definitely want to register for the @IIUPGradStudies virtual open house on Thursday at 6pm. Sophomores and juniors, stop by to learn how you can save money through early admission to grad school. Register at https://t.co/YGqprL7cVx https://t.co/gzmiZSjRWL","date":"Tue Apr 13 21:16:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Relax in a hammock like Hannah, who introduces you to the heart of our beautiful campus—the Oak Grove. Enjoy the sun filtering through the leaves on your way to class or spread out a blanket and study with a friend. Don’t miss the fun of Chalk on the Walk on April 28!\n\n#IUProots https://t.co/pBHalk0CXs","date":"Tue Apr 13 16:52:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Graduating into a global pandemic is—intimidating. If you’re a new grad entering the workforce this May, how concerned should you be? How should you prepare? Tammy Manko, director of our Career &amp; Professional Development Center, shares insights and advice.\nhttps://t.co/7eWS6PtFS8","date":"Mon Apr 12 16:28:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"📷 by @iupadmissions: Tomorrow’s Q &amp; A features Political Science major, Jorge!  Click on our story to ask him a question. Jorge is also the Vice President of iup_ambassadors so ask him questions about getting involved on campus! @iupedu https://t.co/CW4fCFUagO","date":"Mon Apr 12 16:00:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@kathy_eisel Yes, we are currently planning on an in-person commencement. Details are here: https://t.co/X1PfgS7etC","date":"Sat Apr 10 00:52:39 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In this week's update, President Driscoll urges everyone to “stay the course” in the fight against COVID-19, thanks event organizers for their creativity, and recognizes three IUP students who have been honored with national and regional awards. https://t.co/YjWytRAzJj","date":"Fri Apr 09 18:39:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@ZacekLex Challenge dollars are still being calculated. Check back at https://t.co/ytx0lhxU8j to see the final results.","date":"Fri Apr 09 14:19:39 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"What an impact!!!!  644 alumni, students, and friends raised over $97,500 for 14 areas during #IUPGivingDay. We are #IUPproud! https://t.co/OsSf2cTMal","date":"Fri Apr 09 13:27:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Which fund will win? The fund with the most dollars raised will unlock an extra $2,500. #IUPGivingDay \nhttps://t.co/d2bUyWwLyi https://t.co/xmqbFGcDDc","date":"Thu Apr 08 20:00:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Student orgs, the spotlight is on you! Be sure to post a photo showing your IUP spirit using #IUPGivingDay and tag IUP and the fund of your choice could win $500! Three winners will be selected. https://t.co/d2bUyWwLyi https://t.co/dNpwARqEPo","date":"Thu Apr 08 19:01:17 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"You better be quick—the first 10 donors will unlock an additional $100 towards their supported fund. https://t.co/d2bUyWOmWS\n\n#IUPGivingDay https://t.co/voWjyUXG21","date":"Thu Apr 08 18:01:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Hey Crimson Hawks—it's #IUPGivingDay. Ready to accept the challenge? \nVisit https://t.co/d2bUyWwLyi. Seniors, if you give $20.21 you will receive your philanthropy cords for commencement + your gift will increase to $30.21. #IUPproud https://t.co/Uu2gvpY8Vc","date":"Thu Apr 08 16:22:43 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Calling all @IUPAlumni! The first 200 alumni donors will see their gift increase by $24. https://t.co/d2bUyWOmWS\n\n#IUPGivingDay https://t.co/ZLJeloLIbh","date":"Thu Apr 08 14:00:43 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Did you know the fund with the most donors will unlock $2,500? #IUPGivingDay \nhttps://t.co/SxRMYlk4GJ https://t.co/JQ8ETytQ0o","date":"Thu Apr 08 13:05:26 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP, today's the day! #IUPGivingDay! Show you're #IUPproud and support students today. https://t.co/SxRMYlBG5j https://t.co/DtFu2G8cuv","date":"Thu Apr 08 12:00:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud! 👏 👏\nSusan Adams, a junior geology major and first-generation college student, has been selected for a Goldwater Scholarship.\nhttps://t.co/nb8PxR5XZa https://t.co/oiKtLTcEmJ","date":"Wed Apr 07 16:39:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join Steven for a tour of the HUB (Hadley Union Building). At the HUB you can work out in the expansive fitness center or try the indoor basketball court and track. Fuel up at the HUB food court or shop for your textbooks, IUP clothes, and more at the Co-op store.\n\n#IUPbound https://t.co/m6iBjaQM5W","date":"Tue Apr 06 14:02:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Let's join together as one IUP family to create lifelong opportunities for students. When we come together, there's no limit to what we can do.  https://t.co/d2bUyWOmWS https://t.co/ghMBXtplzz","date":"Tue Apr 06 00:42:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"It's Research Appreciation Week at IUP. To celebrate we're putting the spotlight on U-SOAR, the Undergraduate Summer Opportunity for Applying Research. To learn more about U-SOAR or Research Week, visit https://t.co/0Muhgmmy4t https://t.co/vgtZVjBTmf","date":"Mon Apr 05 16:24:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"How can we be better allies in support of people struggling for equality and equity? \nFind answers at the mini-conference \"Intersectionality Works: Allyship, Coalition, Solidarity\" on Friday, April 9.\nhttps://t.co/C09RKs86Ly","date":"Fri Apr 02 15:10:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@vanessa_jesenia #IUPproud!","date":"Thu Apr 01 02:35:23 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"On this week’s episode of LFTO, Charles and Hayley invited Brandyn Ott to talk about intramural sports at IUP. Being part of an intramural team is a great way to get involved and meet people with similar interests.\n#IUProots #IUPbound\nhttps://t.co/lJG5rRzrOU","date":"Wed Mar 31 16:19:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Students Rachel and Michelle show you everything you’ll find at the Center for Multicultural Student Leadership and Engagement, aka @IUP_MCSLE, aka \"the center.\" Need a place to meet? A dance studio? The center’s got you covered. #IUProots #IUPbound\nhttps://t.co/ac5aoMVuHI","date":"Mon Mar 29 16:31:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"An artist, a scientist, a professor, and more. Learn about the six IUP graduates of the last 15 years who were honored this week with 2021 Young Alumni Achievement Awards for outstanding work in their professions. #IUPproud\n\nhttps://t.co/j8JPw3awSH","date":"Sat Mar 27 05:58:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In this week's update, President Driscoll offers his appreciation for the good work of the IUP community in keeping COVID-19 positive numbers low. He also shares information on how May commencement and the summer sessions will proceed.\nhttps://t.co/MDSMu99Nnt","date":"Fri Mar 26 15:48:06 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join Meg on a tour of Indiana, PA. Just a couple of blocks from campus, you’ll find a downtown main street with restaurants and coffee shops, including one featuring local art. You can even bike or walk on the Hoodlebug Trail right from campus.\n\n#IUPbound #IUProots https://t.co/w34ZpIBGJZ","date":"Thu Mar 25 15:15:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Running a restaurant while the coronavirus pandemic has changed the world has given Hospitality Management students a lesson in resilience—and valuable experience for entering a hard-hit industry.\nhttps://t.co/QjDvMZZmDf","date":"Mon Mar 22 19:40:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Dear Crimson Hawks,\n\nWe are saddened by the dramatic rise in hateful violence against Asian Americans across the country. Hate has no place at IUP. We are here to support you in the case that you experience discrimination, acts of hate, or violence.\nhttps://t.co/nlTRN7kcub","date":"Thu Mar 18 21:50:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Wish there was a podcast that could connect you with IUP faculty and alumni? @IUP_SGA has you covered. The SGA Hawkcast is a weekly podcast where guests share their experiences + best memories from their time at IUP. \n\nGive SGA Hawkcast a listen today ⬇️\n\nhttps://t.co/ObGIn4LrvP","date":"Wed Mar 17 17:45:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"“Math Club isn’t solving insane calculus problems on a Friday night. It's a good way for us to hang out and have fun.” - Mikayla Dokos, Math Club President.\n\nThis week Find Your People features the Math Club. Learn more about this club below. #IUProots\nhttps://t.co/qezZVdDSIW","date":"Wed Mar 17 16:23:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"If diversity had a voice, what would it say about what is going on in our world today?\n\nJoin James Taylor tomorrow for a panel discussion on \"Diversity, Equity, and Inclusion in the Workplace\" to learn his answer. Register at https://t.co/p1ED2M8fkV https://t.co/9htTxTNVQO","date":"Tue Mar 16 17:42:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Join @IUPAlumni Debra Evans-Smith tomorrow for a panel discussion on \"Diversity, Equity, and Inclusion in the Workplace.\" Evans-Smith will discuss diversity in law enforcement and excessive use of force. Register for the panel at https://t.co/p1ED2M8fkV https://t.co/fHeR02Vbo9","date":"Tue Mar 16 17:00:34 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"“Diversity programs are designed to help you become more self-aware and open to different points of view.” \n- Mauro Wolfe\n\nJoin @IUPAlumni Mauro Wolfe tomorrow for a panel discussion on \"Diversity, Equity, and Inclusion in the Workplace.\" Register at https://t.co/p1ED2M8fkV https://t.co/X6TigoqALh","date":"Tue Mar 16 16:19:53 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This week is Thank a Donor Week. Donors support Crimson Hawks every day through scholarships and student opportunities. Submit a message of thanks to donors this week for your chance to win a grand prize valued at $300. https://t.co/CbrXBdrP4e\n\n#IUPproud | #IUPThanks https://t.co/b3VNpTDNE2","date":"Mon Mar 15 18:43:00 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Coauthor of The Atlas of Mars, #IUP Geoscience’s Ken Coles has been eagerly following news of the rover Perseverance, which landed on Mars last month. In this interview, he shares his insights into the mission and its value to Earthlings.\n\nhttps://t.co/ypvWkr1lQh","date":"Mon Mar 15 16:51:11 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"IUP has been on the Military Friendly Schools list for seven years. This year we are one of only six universities in PA to be selected for Gold Award status. #IUPproud\n\nhttps://t.co/b6eqAsY5Fy https://t.co/jPbNPa2qpe","date":"Fri Mar 12 16:02:08 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This week on Let's Figure This Out, Kevin Foster, Assistant Director for Student Involvement and Leadership Development, talks about the variety of organizations and ways to get involved + he offers tips on getting the most out of what IUP has to offer. \nhttps://t.co/qIgLqRotBH","date":"Thu Mar 11 21:33:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"\"We provide education and resources to students on important topics like sexual and domestic violence . . . toxic masculinity, bystander intervention, and healthy and unhealthy relationships.\" - Chloe DePaola, grad assistant for the Haven Project.","date":"Wed Mar 10 14:16:29 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@IUPHaven Project tackles violence, stalking, relationship issues, and other tough topics with the help of students. \n\nhttps://t.co/34fo6zft8n","date":"Wed Mar 10 14:16:28 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"ICYMI on @DrewBarrymoreTV: Donte Palmer '09, founder of Squat for Change, talked about changing the narrative on what it means to be a father. #IUPproud!","date":"Tue Mar 09 20:42:46 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Dorothy Ramale ’43 was well-known as a math teacher and an @IUPAlumni Association president. Until recently, many didn’t know she cracked enemy codes for the US military during WWII. In honor of #WomensHistoryMonth, here is her story. \nhttps://t.co/cytFwmq4DS https://t.co/BpghQRKKik","date":"Mon Mar 08 16:29:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In this week's update, President Driscoll urges the IUP community to continue following COVID-19 safety guidelines as spring approaches and discusses new IUP initiatives, spring sports, and upcoming Women’s History Month activities: https://t.co/KYiEWAXPrb","date":"Fri Mar 05 15:37:37 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This week Find Your People is focusing on the IUP chapter of the NAACP. “We push for the advancement of colored people, whether that’s in the workplace, school, or everyday society.\" - President Stanley Rogers.\nhttps://t.co/kokZz2cfMp","date":"Wed Mar 03 16:42:02 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud! Our Safety Sciences program has been ranked third in the nation for excellence by https://t.co/NTvpXkKrtA.\n\nhttps://t.co/brhF0X4jhO https://t.co/MqT3ppB94J","date":"Mon Mar 01 16:25:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"As you return from the long weekend, remember to schedule a COVID-19 test. Results can take 24-48 hours. Schedule an appointment at https://t.co/GiRHn7k7cH https://t.co/2vC19OHDvR","date":"Sun Feb 28 15:54:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud of our own @JeremyCMcCool for co-authoring the children's book Princess and the Power of Melanin. Don't miss this event on March 25. @IUPLibraries","date":"Thu Feb 25 13:58:11 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud! Our bachelor of science degree in hospitality management has been ranked in the 2021 top 10 best bachelor’s degrees in hospitality management by https://t.co/XxPKn7eVoW. Our program is the only PA college or university in the top 10 listing.\n\nhttps://t.co/l8Hrwisveh https://t.co/7S0QIEzHnx","date":"Wed Feb 24 20:20:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This week Find Your People profiles Pride Alliance, which has worked for decades to make the campus safe and supportive for students, regardless of sexual orientation, gender identity, or gender expression.\nhttps://t.co/NjD6ycskLj","date":"Wed Feb 24 16:16:05 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"The fight for civil rights in Indiana took many forms. IUP retiree Edith Cord shares her memories from the ’60s and ’70s of efforts “to give everyone a better chance at the American dream.” #BHM\n\nhttps://t.co/Wbl2dXLOrr","date":"Tue Feb 23 14:08:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Planning to visit home or travel during this week's non-class days on Thursday and Friday? Now is a good time to schedule a COVID-19 test. \n\nIf you are feeling sick, you cannot be tested at the KCAC.\n\nSchedule a test at https://t.co/6a05JS4FaT https://t.co/iomntBWWxu","date":"Mon Feb 22 19:18:43 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Mauro Wolfe: born in Panama, senior partner at Duane Morris in NYC, and next month he’ll participate in a virtual panel discussion on diversity, equity, and inclusion in the workplace. Hear Wolfe’s insights on creating a culture of change at https://t.co/94TWoIylzz","date":"Mon Feb 22 18:58:10 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@corangers_ There are four ways to pay for a bottle of water: cash, credit card, flex dollars, and meal swipes. Meal swipes cover the cost of an entire meal, so if you have selected a meal swipe to pay for only a drink on GrubHub, then a meal swipe is equal to $5.43.","date":"Mon Feb 22 17:50:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"With the understanding that changes in the coronavirus pandemic may force different decisions closer to the fall semester, we are intending to resume traditional, in-person classes and events for the 2021–22 academic year.\n\nhttps://t.co/OsvWEst2sW","date":"Mon Feb 22 15:55:09 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In this week’s update, President Driscoll addresses the IUP family with good news on the COVID-19 front at IUP, including federal funding available to disburse to qualified students.\nhttps://t.co/K5DGQRXeua","date":"Fri Feb 19 15:47:04 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"In each episode Hayley and Charles will collaborate with a new guest to figure out the ins and outs of being a student at IUP. Stay tuned for more episodes coming soon. https://t.co/8EAb4H5wjH","date":"Thu Feb 18 15:33:33 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Follow along as our student hosts Hayley Woodside and Charles Coleman drop all the knowledge about making connections and getting through the day by day. This week Hayley and Charles break down the how and why of Let’s Figure This Out.\nhttps://t.co/YpT4WOGdSh","date":"Thu Feb 18 15:33:33 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Let’s Figure This Out is about to help you figure out how to navigate college and life during these tough times. https://t.co/0nuKWS35Eq","date":"Thu Feb 18 15:33:32 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"#IUPproud!","date":"Wed Feb 17 18:34:03 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"This week, Find Your People profiles the College of Business Student Advisory Council, an organization that encourages students to build leadership and professional skills and to get involved on campus. @EberlyIUP \nhttps://t.co/0dXIo5rP0V","date":"Wed Feb 17 16:42:01 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"Us preparing to go outside this morning.\n\nStay warm, Hawks! https://t.co/sX2mfp8ofW","date":"Wed Feb 17 13:25:23 +0000 2021","user_id":"16422886"},{"handle":"iupedu","text":"@IUP_CPDC's semi-annual JCPenney Suit-Up Event will be on Feb. 19–21, 2021. For more details, visit https://t.co/S1WjEfb2nh https://t.co/kgGTErvQ5E","date":"Tue Feb 16 17:52:53 +0000 2021","user_id":"16422886"}]