[{"handle":"LawrenceUni","text":"Sound the drums and celebrate World Music Day! Of course, every day is a celebration of music at Lawrence. From concerts to jam sessions to outdoor practices, music infuses and invigorates our creative campus! #worldmusicday https://t.co/UNfyjIsDci","date":"Tue Jun 21 21:50:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It was wonderful welcoming alumni back to campus for the first in-person Reunion since 2019.  Get a taste of the weekend and read more in our Reunion recap! https://t.co/gJQGwtZy4m https://t.co/9Tcf3kOSyj","date":"Mon Jun 20 21:29:07 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It’s been two years for some, and 50+ years for others. However long it has been, we’re so excited to welcome our alumni home to campus for Reunion 2022!\n\nhttps://t.co/pXxWTzA6lv","date":"Thu Jun 16 01:14:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"This is fun. Emily Hallock '12 is heading back to MasterChef for round 2. @HigginsEats and @PostCrescent have the details. Go, Emily. https://t.co/V22TpPkFJ4","date":"Tue Jun 14 19:00:10 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congratulations to this year's Faculty Award recipients: Brigetta Miller, Peter Peregrine, Nancy Lin, &amp; Jesus Smith! Their teaching and scholarship makes Lawrence better and brighter!\n\nhttps://t.co/PthRXAuiUy","date":"Mon Jun 13 20:14:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It was a beautiful day to celebrate the Class of 2022! Our students are inspiring and incredible and we're so proud of you! Get a look at just some of the day's highlights and read more about today's Commencement celebration! https://t.co/bNuHbusMk8 https://t.co/zaineCqEo8","date":"Sun Jun 12 21:03:05 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Can’t make Commencement in person? Catch the livestream! https://t.co/dWJf1aAfs1","date":"Sun Jun 12 14:49:26 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Oh, how far you've come! The years since you started at Lawrence have been filled with highs and lows, challenges and triumphs, and always, light, more light! You have sparkled and shone and we are so proud of you. Congratulations Class of 2022! #LUgrads2022 https://t.co/oZMkakIurh","date":"Sun Jun 12 14:06:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"The day is here! Congratulations, graduates! Main Hall Green is gussied up and waiting to welcome you and your friends, family, and loved ones. We’re all ready to celebrate you and cheer you on as you take the next steps of your journey. #LUgrads2022 https://t.co/a2rMTWMAqk","date":"Sun Jun 12 13:46:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Senior Karina Herrera walks familiar paths in cherished places as she and the rest of our graduates prepare for their next steps. What a journey it has been, and what adventure awaits in the world beyond campus. Congratulations Class of 2022! #LUgrads2022 https://t.co/Tzjiihe4dB","date":"Fri Jun 10 17:11:19 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Thank you to retiring faculty members Paul Cohen, Jeff Collett, Peter Gilbert, Eilene Hoft-March, and Brent Peterson for your incredible service to Lawrence, our students, and a liberal arts education. Your impact is immeasurable. https://t.co/2nh1kFInW5","date":"Thu Jun 09 18:00:21 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Biofest is another great academic tradition that gives biology, biochemistry, and neuroscience students a chance to shine and show off the incredible work they've done as part of their Senior Experience project.\nhttps://t.co/6JPBVYjNKz","date":"Tue Jun 07 21:01:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Let the countdown begin! We’re one week away from Commencement and celebrating the accomplishments of our amazing seniors. Here are 22 things to know about 2022’s Commencement, from ceremony info to social media kits and more.\n\nhttps://t.co/x3hmj7KGJl https://t.co/LAieCr8zy8","date":"Sun Jun 05 15:00:19 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Celebrate Pride with a horn fanfare! Prof. Ann Ellsworth joined with musical friends to form the Lawrence Graduate Bayreuth Tuben Quintet (LGBTQ). They recently released their debut album, a celebration of LGBTQ composers &amp; the Bayreuth tuben. https://t.co/nN0d5GppYG","date":"Sat Jun 04 15:08:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Hop on in! Rabbit Gallery open through Monday. Check out this pop-up art gallery organized, curated, and run by students!\n\nhttps://t.co/r7dAblfT2E","date":"Fri Jun 03 20:01:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence is excited to announce Jason Imperati as the new Director of Athletics. Jason comes from Bowie State &amp; has a wealth of knowledge with an emphasis on the student-athlete experience. It’s a great day to be a Viking, indeed! Welcome Jason! #GoVikings https://t.co/7VqZiiyoJL","date":"Fri Jun 03 15:52:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"200 students. 27 months. 1 cathartic performance. The Conservatory’s awe-inspiring major works concert returns Friday for the first time since an emotional farewell performance made waves online in March 2020 in the early days of the pandemic.  \nhttps://t.co/r6lk4Uy4s9","date":"Wed Jun 01 21:08:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Members of the Lawrence community shine their light in so many ways. Helping to guide us through the pandemic. Championing diversity, equity and inclusion. Supporting students in &amp; out of class. Learn more about this year's incredible Lawrence awardees. \nhttps://t.co/Zt8EQas17k","date":"Tue May 31 20:33:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"“There is a distinct pattern that many folks who attend Lawrence Conservatory start out wanting to help their music communities in some way and end their time at LU as change-makers with many, many helpful tools.” \n\nhttps://t.co/FhJ9fV5P3Z https://t.co/13uO54VRpq","date":"Sun May 29 16:20:35 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"For 25 years, the Richard A. Harrison Symposium has showcased incredible student research in the social sciences in humanities. From public policy to German film, students can share their expertise, all while honing and developing new skills. \nhttps://t.co/CeOyFBW8Tf","date":"Fri May 27 14:01:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet education professor Stephanie Burdick-Shepherd and find out why she loves questions she can’t answer. \n\nhttps://t.co/6jqRWZamJJ","date":"Sat May 21 15:03:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Record number of victories. ✓ \nMake a national splash. ✓\nWin Midwest Conf. championship. ✓ \nPlay in the NCAA DIII Baseball Tournament... Action starts Friday at 10! Go Vikes! Good luck! #ReadytheShip #HornsUp\nhttps://t.co/ygcsgb7paa","date":"Thu May 19 20:02:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Here we go, Vikings. All the details you need as Lawrence baseball heads into Friday's start of the NCAA Tournament.","date":"Wed May 18 18:19:25 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Peter Peregrine, professor of anthropology and explorer of the past. https://t.co/pMXfS1TQt6","date":"Tue May 17 21:21:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"The dream season continues for the Lawrence University baseball team. It’s on to Stevens Point on Friday to open the 2022 NCAA Division III Tournament. The Vikings will face host UWSP at 10 a.m. as part of a four-team regional. Let’s go get this. https://t.co/LGLGGMMuCS","date":"Mon May 16 20:26:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"There it is! Congratulations, Vikings. Winners of the @MWCSports baseball tournament and on to NCAA tourney. The journey continues.","date":"Sat May 14 20:53:07 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Thank you for sharing, @PostCrescent","date":"Sat May 14 18:13:18 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Good luck to the Vikes in the championship game! Noon at Whiting Field!","date":"Sat May 14 16:30:39 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Who doesn’t need an LU cheesehead antelope sticker? Get yours at the pop-up merchandise shop during the Brighter Together picnic on Main Hall Green 11-1. Can’t make it in person? Buy online: https://t.co/6PrLwPshor https://t.co/uLE6bKjVUS","date":"Sat May 14 16:26:47 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"President Laurie A. Carter was formally inaugurated as president of Lawrence University Friday with a light-filled ceremony in Memorial Chapel, marking a major moment in its 175-year history. Carter emphasized light &amp; building a bright future for Lawrence.\nhttps://t.co/7zUJpIQzW2","date":"Sat May 14 14:03:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"https://t.co/8JOXout8nJ","date":"Sat May 14 01:30:42 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"https://t.co/Ca8s68fyBu","date":"Sat May 14 01:28:49 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"https://t.co/0zsgRrMbdz","date":"Sat May 14 01:25:39 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"https://t.co/MqyV2qDts8","date":"Sat May 14 01:17:16 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"https://t.co/DepRP1N08m","date":"Sat May 14 01:15:50 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"https://t.co/ztXe7Avfox","date":"Sat May 14 01:14:32 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Inauguration of President Laurie A. Carter is happening now. Watch the live stream! https://t.co/fesee2d3oA","date":"Sat May 14 00:07:26 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"On to the championship game. Let's go, Vikings!","date":"Fri May 13 22:23:16 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"As Lawrence prepares for tonight's inauguration of President Laurie A. Carter and Saturday's Brighter Together Picnic, @PostCrescent featured the many ties that bind LU and @cityofappleton together and help make this place special. https://t.co/PWlI6iOyv2","date":"Fri May 13 17:08:24 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Campus is gussied up and ready for the inauguration of President Laurie A. Carter! This historic occasion takes place during Lawrence's 175th anniversary year. You can watch the livestream starting tonight at 7 p.m. here: https://t.co/fesee2d3oA https://t.co/kebWE9Ot8s","date":"Fri May 13 14:33:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"A little something to get you fired up for @LUvikesbaseball and the start of the Midwest Conference tournament today at Whiting Field. Let's go, Vikes: https://t.co/ZU5TuTSK8X","date":"Fri May 13 13:28:11 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Good luck to @LUvikesbaseball in the conference tournament! The action starts Friday morning. #readytheship #hornsup https://t.co/dCcHZGqN3r","date":"Thu May 12 21:20:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"\"The community we know today as Appleton wouldn’t be what it is without Lawrence University, and I don't think Lawrence University would be what it is without a community like Appleton around it.\" - Mayor Woodford https://t.co/PWlI6iOyv2","date":"Thu May 12 13:32:33 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"No Mow May is having a Mow-ment! Discover how an experiment to help pollinators like bees championed by LU bio prof Israel del Toro four years ago has grown into a national phenomenon--and a great research opportunity for students. #nomowmay\n\nhttps://t.co/bDIg3W4su0","date":"Tue May 10 20:33:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"A moment 40+ years in the making. Huge congratulations to the @LUvikings  @LUvikesbaseball for clinching the regular season conference title. It's been an incredible season. Go Vikes! And #ReadytheShip for the Midwest conference tournament this weekend. \n\nhttps://t.co/5CQbblI72X","date":"Mon May 09 17:10:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"This Mother's Day, take a moment to say thank you to the mothers, grandmothers, aunts, friends, guardians and more for all that they do. #BeKindLU #17DaysofKindness https://t.co/cDUaHH7dcJ","date":"Sun May 08 14:07:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congratulations to seniors &amp; Fulbright awardees Alex Chand and Marion Hermitanio! They have received Fulbright awards to study and teach abroad. Alex is heading to the UK and Marion to Mexico. \nhttps://t.co/fVQZPUoQAC","date":"Thu May 05 21:42:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"May 13-14 is going to be a celebratory weekend at Lawrence. Presidential inauguration on Friday; followed on Saturday by a celebration for the whole community. Food, live music, arts, a resource fair and more. 175 years in the making. We’ve got details. https://t.co/o8P8ZHrE48","date":"Tue May 03 21:50:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"No Mow May, led by Lawrence biology professor Israel Del Toro, continues to get attention across the country. Check out this story on @NPR this morning. https://t.co/VTHNA2L0ED","date":"Mon May 02 13:16:58 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tyler Nanstad on Why Lawrence: “I don't think that I knew right away, but once I got that sense of community and just knowing everyone and really feeling connected, I felt so at home here. It's been a beautiful place to grow.” Admitted &amp; ready to say yes? https://t.co/en672bNm4N https://t.co/X1xJRJnst3","date":"Sat Apr 30 14:54:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Interest in the No Mow May movement, led by Lawrence biology professor Israel Del Toro, continues to spread far and wide. Sierra magazine is latest publication to sing its praises. https://t.co/0mUsajwbwb","date":"Fri Apr 29 20:22:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Big news! Lawrence is once again recognized by the Princeton Review as a Best Value School--and LU is also one of the Top 20 schools for making an impact! #LULights https://t.co/bBFbKdVynt","date":"Thu Apr 28 18:00:22 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"17 Days of Kindness begins today! In honor of the inauguration of Laurie A. Carter as Lawrence's 17th president, and as a reflection of the community we share, today we begin to celebrate 17 Days of Kindness. #BeKindLU https://t.co/VoDwTijI24","date":"Wed Apr 27 14:10:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence University is thrilled to announce Anthony Mackie as our 2022 Commencement speaker. Mackie is an acclaimed actor who has become Marvel’s new Captain America and is prepping to shoot the much-anticipated series for Peacock, Twisted Metal. https://t.co/HzPfPLzO15","date":"Tue Apr 26 18:24:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Earth Week continued through the weekend at Lawrence. Students joined physics professor Megan Pickett for a night of stargazing outside of Briggs Hall, painted the Lawe Street wall in honor of Earth Day, kayaked on the Fox River, and celebrated at Earth Fest on Main Hall Green. https://t.co/Fz2NZT8Itb","date":"Mon Apr 25 21:30:05 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"President Laurie Carter signed the Second Nature Climate Commitment on #EarthDay as Lawrence joins colleges and universities across the country in the Climate Leadership Network. https://t.co/n4YU9COVXN","date":"Fri Apr 22 22:45:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"First-year student Kai Frueh loves photography and nature. He spent many hours capturing gorgeous shots of birds and other wildlife on the Lawrence campus. He shared this photo essay on #EarthDay https://t.co/Q04em4fIsw","date":"Fri Apr 22 16:02:44 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lauren Chamberlain '24 shares #WhyLawrence. \"The people here made me feel that love for learning and challenging myself again. I just knew that this community would be so supportive of me through my college career.\" Ready to say yes to LU? Visit https://t.co/en672bNm4N https://t.co/UXtXLkf28P","date":"Wed Apr 20 22:30:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence alum Joe Kortenhof's Boston Marathon performance gets some love from NBC26.","date":"Wed Apr 20 13:39:19 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Spend some time with English professor and poet Austin Segrest for #NationalPoetryMonth. He recently released his Vassar Millar Prize-winning collection of poems, Door to Remain, inspired by his late mother.\n\nhttps://t.co/o8vW83sint","date":"Tue Apr 19 20:03:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Impressive work by a great Lawrentian.","date":"Tue Apr 19 13:33:37 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Wow!","date":"Mon Apr 18 21:29:59 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Lauren Kelly &amp; Emma Zelles, leaders of the Lawrence University Environmental Organization, and learn more about what's on tap for #EarthWeek! Discover how Lawrence students &amp; organizations engage in sustainability this week and year-round. \n\nhttps://t.co/lUqVLyM3ey","date":"Mon Apr 18 20:03:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Luther Abel has been awarded a competitive journalism fellowship with the National Review. He says at Lawrence he's able to explore and deconstruct ideas he disagrees with, making him more thoughtful, comfortable, and confident in his own arguments. https://t.co/Wj87vCPoqQ","date":"Sat Apr 16 15:17:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"SOL Studios is student-run and dedicated to providing a space for all Lawrence musicians, regardless of whether they’re in the conservatory or the college, to create and record music and to collaborate with fellow musicians.\nhttps://t.co/qtK3tzD5aC","date":"Fri Apr 15 19:00:14 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Great piece from @WBAY on Lawrence's Jacob Charon, who is drawing notice on the baseball field this spring. He's on a home run binge that's setting school records and turning heads.  https://t.co/j4ZZ5IeRQF","date":"Thu Apr 14 16:27:12 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Recent Lawrence grads Katie Kitzinger ’20 and Gus Lowry ’18 have been awarded National Science Foundation Graduate Research Fellowships. Katie in organic chemistry @UNC and Gus in biochemistry @DukeU. Lawrentians doing impressive work in the sciences. https://t.co/jvGBZgSPOt","date":"Tue Apr 12 21:35:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence psychology professor Lori Hilt and her students continue to build on research into youth mental health. Mindfulness study keeps momentum going. Story per @PostCrescent  @madeline_heim @hilton_annmarie https://t.co/JQB4PYk4n9","date":"Tue Apr 12 13:43:33 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congratulations to Karen Bruno, director of the Lawrence Community Music School, for being named one of Insight Publications’ 2022 Women of Influence. She is one of eight honorees. Well deserved.  https://t.co/NKU8dueDl2","date":"Tue Apr 12 13:33:58 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know? The Lawrence College library was located on the second floor of Main Hall from 1857 to 1906. Zelia Ann Smith is the librarian pictured here behind the desk. Lawrence is celebrating the 175th anniversary of its founding throughout 2022. #Lawrence175 https://t.co/1dN5vppIJM","date":"Mon Apr 11 21:30:04 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrentians celebrated traditions old and new this weekend to close out the second week of spring term. https://t.co/G0JfMiiOYa","date":"Sun Apr 10 16:30:10 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"What links French courses, funded summer research opportunities, and Cloak Theatre? Claire Chamberlin's journey of translating Molière-inspired plays performed this winter from French to English. \nhttps://t.co/ZXb9A4StFY","date":"Sat Apr 09 15:04:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Samir Datta will join LU this spring as VP for finance &amp; administration. “With the skills I’ve developed over the years working in both the public and private sectors ... I think I’m in a position to help drive the mission of the university going forward.” https://t.co/pwXx1zF7hd","date":"Fri Apr 08 20:37:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Innovation + impact=KidsGive. Lawrentians spent spring break in Sierra Leone working with local experts to facilitate eye tests, help build a school, conduct research, and share Sierra Leonean life &amp; culture while gaining nonprofit professional experience.\nhttps://t.co/tquZ9TQUd6","date":"Thu Apr 07 20:23:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congratulations to two Lawrentians with big wins in Tuesday's Appleton Common Council election: biology professor Israel Del Toro and 2004 grad Vered Meltzer.   https://t.co/rVI8udU0Ef via @postcrescent","date":"Wed Apr 06 19:01:52 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know? The solar panels on Hiett Hall provide 10,000 kilowatt hours of energy to campus. #EarthMonth https://t.co/zwIbHfqMzo","date":"Tue Apr 05 21:30:04 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Karen Carr, professor of religious studies! Her blend of serious scholarship and insightful wit have helped students engage with complex topics through meaningful debate and discourse in Lawrence classrooms for 35 years. \n\nhttps://t.co/0tggxwmctA","date":"Mon Apr 04 22:31:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence voice professor Estelí Gomez is heading back to the Grammy Awards this weekend!\n\nGomez is featured as a soloist &amp; a member of the chamber ensemble Conspirare on The Singing Guitar, an album nominated in the Best Choral Performance category.\nhttps://t.co/K969nzfkMg","date":"Fri Apr 01 17:20:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Elda Anderson, a pioneering scientist &amp; educator who taught at Milwaukee-Downer College &amp; was recruited in the 1940s to work on the Manhattan Project, is finally getting her story told thanks to physics prof Megan Pickett. #Lawrence175 #WomensHistoryMonth\nhttps://t.co/VijR10DGbb","date":"Thu Mar 31 21:46:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's Athletics Crowdfund time! We have one unifying goal this year: give Alexander Gym’s interior the extreme makeover it deserves. Support our student athletes and get in the game! #LUVikes4Life #ReadyTheShip\nhttps://t.co/qi03GhrTzP https://t.co/XyVowzfWyG","date":"Wed Mar 30 17:09:24 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"The recipient of a Fulbright U.S. Scholar award, theatre professor Timothy X. Troy is heading to Ireland next academic year to teach in a master’s program while also researching and writing a play set during the Irish War of Independence!\nhttps://t.co/mzRTbH5JKE","date":"Tue Mar 29 21:41:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence professors @IsraelDelToro &amp; @relenaribbons have been the driving force behind No Mow May, an effort to save the bees by providing better habitat. \n\nCheck out this feature in the @nytimes about their work and how the movement is spreading ⬇️ \nhttps://t.co/0ZmngNeGrH","date":"Mon Mar 28 22:31:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy first day of Spring Term, Lawrentians! Good luck with your new classes! \n\nIn just a few weeks, campus will be in full bloom and we'll be enjoying meals and music in the sunshine among the flowers.☀️ 🌷 See you on Main Hall Green! https://t.co/8xxq4EdZzM","date":"Mon Mar 28 21:23:04 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's time for the Oscars! Good luck to Pawo Choyning Dorji ’06 whose film \"Lunana: A Yak in the Classroom\" is nominated in the International Feature Film category! 🎬 \nhttps://t.co/rbed8M5OTc","date":"Sun Mar 27 14:19:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Eli Ferrell, a Lawrence University senior, wants to use his recent experience in the Washington Semester program to pursue one of his passions—animal rights advocacy.\n\nGet to know Eli ⬇️ \nhttps://t.co/WYSh7tY7m7","date":"Fri Mar 25 17:06:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to Maggie McGlenn, biology major from Madison, as she becomes the 77th Lawrentian over the past 53 years to be awarded a Thomas J. Watson Fellowship!\nhttps://t.co/bLTXlq4sqI","date":"Thu Mar 24 22:10:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Spring is in the air! Check out the spring sports schedules at https://t.co/qSzibVia4l\n\n📸 : 1950s https://t.co/IwWh6lL1ME","date":"Wed Mar 23 23:01:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet Beth De Stasio ’83, a biology professor who has been a leader in the sciences since joining the Lawrence faculty 30 years ago.\n\nWe caught up with De Stasio to talk about interests in and out of the classroom.\nhttps://t.co/0SMG3Gw3Lm","date":"Tue Mar 22 22:20:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to ethnic studies professor @DrSmithJG for winning this well-deserved award from @FoxCitiesChmbr! Watch the video to see the surprise on his face as he learns he won this award on live TV!","date":"Fri Mar 18 17:59:55 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Good luck to Yaw Asare '96 as he takes his Sharay’s Ghana Style Peanut Brittle to the television program \"Project Pitch It\" this weekend!\nhttps://t.co/xa2sWgZiBj","date":"Fri Mar 18 17:09:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"So many legends have visited Lawrence over our 175 years! Take a look at this list of 47 of our famous visitors! #Lawrence175\nhttps://t.co/hwVBbU7p9m","date":"Fri Mar 18 15:11:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to Lawrence music professor Brigetta Miller for being named one of 39 most influential Native American leaders in WI by Madison 365. A well-deserved honor! #LULights\nhttps://t.co/4NLGNmhI90","date":"Wed Mar 16 21:41:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our study abroad program in Dakar, Senegal—part of the Francophone Seminar—is back this spring!\n\nTen Lawrentians will soon depart for Senegal to be immersed in local customs &amp; languages while working on independent study projects over 10 weeks.\nhttps://t.co/YRe3Xm7gfE","date":"Tue Mar 15 21:44:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Three years after receiving a major grant for research on youth mental health, psychology professor Lori Hilt is ready to share results:\n\nThe daily use of a mindfulness app can have a positive effect on adolescents struggling with negative thoughts.\nhttps://t.co/yRJmptJKH4","date":"Mon Mar 14 21:44:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's the last day of Winter Term classes and spring break is just a few finals away. Study hard this weekend, Lawrentians, but don't forget to take breaks! 📚 https://t.co/v6z34ljMk7","date":"Fri Mar 11 22:23:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"In addition, Cayla Rosche ’13, who recently earned her doctorate from the UW-Madison has been named a finalist!","date":"Thu Mar 10 23:32:49 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to six Lawrentians who have made it to the semifinalist stage of the Fulbright U.S. Student Program!\n👏 Emmeline Sipe '22\n👏 Marion Hermitanio '22\n👏 Anna White '22\n👏 Alex Chand '22\n👏 Koby Brown ’18\n👏 Joseph (Sam) Samuele Genualdi ’17\nhttps://t.co/SFKvHx4yUK","date":"Thu Mar 10 23:01:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to the three members of the Lawrence faculty who have been granted 2022 tenure appointments:\n🎶 Tim Albright, trombone\n🎼 Mark Dupere, orchestral studies\n📚 Constance Kassor, religious studies\nhttps://t.co/54VV5c2ren","date":"Wed Mar 09 22:48:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"On #InternationalWomensDay, enjoy this reflection from Karina Herrera ’22, co-captain of @LUVikingsWBB, about her co-captain Kenya Earl '22.\n\nKenya recently became the all-time leading scorer in Viking basketball history—men &amp; women—with 1,610 points!\nhttps://t.co/qBocncRugU","date":"Tue Mar 08 22:57:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lauren Stokes, assistant professor of history at Northwestern University, will discuss migration and race in Germany on Tuesday, March 8 as part of the Povolny Lecture Series in International Studies.\n\nTune in virtually at 4:30 p.m. Central ⬇️ \nhttps://t.co/s9wvimbAHI","date":"Mon Mar 07 23:02:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's that time of year. One sunny, 45-degree day you start eyeing your sandals in the back of your closet, and the next day snowfall summons your boots once more. ☀️ ❄️ ☀️ https://t.co/Fo2of3eJLu","date":"Mon Mar 07 22:45:05 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Dylan Fitz, associate professor of economics, who specializes in development economics.\n\n\"I decided to study economics because it provides guidance on how to fight poverty more successfully.\"\nhttps://t.co/RQmV6oE04T","date":"Sun Mar 06 14:19:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence University is ranked among the top 10 small colleges in the Midwest in the recently released Wall Street Journal/Times Higher Education College Rankings!\nhttps://t.co/vqUtdKgrMN","date":"Fri Mar 04 18:10:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know our @sgmudd Library not only has stacks of books and periodicals, but we also have a whole collection of sheet music for students and faculty to use?\n\nLearn about the collection here: https://t.co/2cShLMzHmQ https://t.co/OU4PIObFyG","date":"Wed Mar 02 22:55:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Chris Clarke, Lawrence's new dean of students, wants to be an advocate for students.\n\n“I want to make sure that students know that I’m here for them, to help them get the best out of their experience here at Lawrence,” he said.\n\nGet to know Dean Clarke ⬇️ \nhttps://t.co/oEIlvwltGa","date":"Wed Mar 02 00:16:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"What a joy to welcome admitted students and families to campus for our in-person LUX event for the first time in a couple years! Thanks for making the trip from far and wide to be here!\n\nAdmitted students can sign up for future LUX events here: https://t.co/RMRY00ZCjc https://t.co/CTFGArXP5m","date":"Tue Mar 01 23:08:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Shortly before winter break, Lawrence junior Michael Zhang told a friend that his dream was to meet and sing with his idol, Ed Sheeran. 🎤 \n\nLittle did he know he’d get his chance a few weeks later. Read about Michael's big moment on an NYC stage👇 \nhttps://t.co/JKgYE661v8","date":"Mon Feb 28 23:13:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"A few photos from @dtdamiani of last night's Cultural Expressions, a talent showcase hosted by the Black Student Union each #BlackHistoryMonth https://t.co/UD8zZptvY4","date":"Mon Feb 28 01:21:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Megan Pickett always has her eyes to the sky. 🌌 🔭\n\nThe LU associate professor of physics is an educator of and an advocate for the night sky, inspiring students to pursue the wonders of astronomy. Get to know Pickett inside &amp; outside the classroom ⬇️ \nhttps://t.co/YEiIOkYgUH","date":"Sun Feb 27 15:23:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome to Lawrence Dr. Allison Vetter, new director of equal opportunity compliance and Title IX coordinator!\n\nVetter will begin her duties at Lawrence March 1, working in the Office of Diversity, Equity, and Inclusion.\nhttps://t.co/d6YtxBjh20","date":"Fri Feb 25 15:24:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Over our 175 years, many Black luminaries have graced the stages of Lawrence, including Frederick Douglass, Ella Fitzgerald, and Maya Angelou to name a few. \n\nCheck out this list of 10 iconic campus visitors during #BlackHistoryMonth\nhttps://t.co/iWuPzXaLo8","date":"Thu Feb 24 23:04:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"The LU Diversity &amp; Intercultural Center has a new Hair Care Initiative partnering with local salons &amp; barbershops to provide services to students of color!\n\nThe D&amp;IC hopes this will also help foster connections between students &amp; community members.\nhttps://t.co/M3FaULKV5z","date":"Wed Feb 23 22:54:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"President Carter was recently mentioned in The History Makers newsletter: https://t.co/CvoHw7FgSX","date":"Wed Feb 23 15:02:49 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"On #BlackHistoryMonth, we want to recognize Black history in the making and send love to President Laurie A. Carter, the first BIPOC president of Lawrence University! https://t.co/xxyFR5C6Y6","date":"Wed Feb 23 01:30:04 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Winter Term Convocation featured multidisciplinary artist Alexandra Bell on Friday. A journalist turned artist, Bell's work \"boldly addresses urgent contemporary concerns about media &amp; representation.\" \n\nLearn more about her work and the address ⬇️ \nhttps://t.co/wOCorPc6wU","date":"Sun Feb 20 15:17:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Senior basketball standout Brad Sendell is just 11 points away from breaking the @LUvikings all-time career scoring record! 🏀\n\nIt may happen at today's home game vs. Illinois College. Watch @LUVikingsMBB today &amp; catch the webcast: https://t.co/yBFAwFH7xZ\nhttps://t.co/9AqZzCANJY","date":"Sat Feb 19 15:05:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"When two choral groups from LU's Conservatory take the stage at Chicago’s Harris Theatre on Feb 18, there will be some knowing nods of respect for one of the country’s elite college music programs.\n\nOne choir performing is a big deal. Lawrence has two. 🎶 \nhttps://t.co/v18KiF7B4a","date":"Fri Feb 18 18:33:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Behind the scenes takes center stage in this look at the work needed to make theatrical magic for the audience.\n\nPull back the curtain with this photo essay on the making of \"Molière Inspired,\" a theatre production opening tomorrow evening!\nhttps://t.co/vWzakYxs1I","date":"Thu Feb 17 23:07:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"The debut film from a 2006 Lawrence grad is among this year’s Academy Award nominees! 🎬 \n\n\"Lunana: A Yak in the Classroom,\" written &amp; directed by Pawo Choyning Dorji ’06 &amp; filmed in Bhutan, was nominated in the International Feature Film category.\nhttps://t.co/i3gvAAKyOV","date":"Wed Feb 16 23:12:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet junior Amaka Uduh, psychology major, dancer, and president of Lawrence's Black Student Union.\n\nLearn about the events BSU is putting on for #BlackHistoryMonth including Black Excellence Ball &amp; Cultural Expressions.\nhttps://t.co/VSnCBhtY1p","date":"Tue Feb 15 23:06:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence has always loved Appleton. Our founder Amos Lawrence loved his wife Sarah Appleton back in the 19th century like our university loves our city today. \n\nSo this #ValentinesDay, we want to send our love to @cityofappleton, our home for the last 175 years! ❤️ 💙 https://t.co/cHrAV8g73v","date":"Mon Feb 14 23:14:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"\"Reset the mindset and others will follow.\" That's ever-upbeat music professor @MatthewArau's mantra.\n\nHe's spreading his message of positivity to music educators far &amp; wide with his new book &amp; his side project Upbeat Global, LLC. Learn all about it ⬇️ \nhttps://t.co/s1SrDIKQ6y","date":"Thu Feb 10 23:08:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Senior Katie Mahorney earned a huge honor in the undergrad research competition at the Geological Society of America conference.\n\nThe double major in geosciences &amp; enviro studies was awarded the Outstanding Poster Presentation Award-First Place! 🏆 \nhttps://t.co/mAWr724NQX","date":"Wed Feb 09 23:25:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Learn about birding, watercolors, politics, or even the Beatles! Seminars are back at Björklunden, Lawrence’s pristine Door County retreat.\n\nThe adult-education seminars, which are open to the public, are returning in person for the first time in 3 years!\nhttps://t.co/2ph5SZCPmw","date":"Tue Feb 08 23:09:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"@archives_lu Order your artifacts here: https://t.co/6PrLwPJSfZ","date":"Tue Feb 08 03:18:40 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Winter Carnival was the perfect chance to celebrate winter and have some fun in the snow! ❄️ https://t.co/JTWdPsQqN8","date":"Mon Feb 07 23:03:10 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"We celebrated on campus with cookies, music, and giveaways as part of our year-long celebration of Lawrence's 175th anniversary. #lu175 https://t.co/IJBL3qqzzo","date":"Fri Feb 04 22:30:13 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet Andrew Mast, a music professor and director of award-winning bands in the Conservatory of Music who also loves motorcycles and the band Rush. \n\nGet to know him inside and outside the classroom ⬇️ \nhttps://t.co/Jksc9w6koC","date":"Thu Feb 03 23:17:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Learn from our students how to speak Wisconsin. They’ll tell you what the heck a bubbler is ⬇️\n\nhttps://t.co/8GKye7wKGg","date":"Wed Feb 02 23:03:28 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Wait… do we really sound like this?\n\nThanks for the Appleton shout out, Willem!","date":"Wed Feb 02 22:58:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"From internships to summer research to study abroad, funding for experiential learning, mostly supported by alumni &amp; donors, is available for all Lawrentians!\n\nCheck out the list of numerous funding options. Most are just an application away!\nhttps://t.co/4MXLgIF1wX","date":"Tue Feb 01 23:03:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Big day for us!\n\nWordle 226 1/6\n\n🟩🟩🟩🟩🟩","date":"Tue Feb 01 01:36:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Winter Carnival = Broomball time ❄️ See you on Ormsby Lake!\n\n📸: 2016 https://t.co/3VTqEOPtXR","date":"Mon Jan 31 23:35:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know you can purchase special edition Lawrence gear for our 175th anniversary celebration?\n\nShirts. Mugs. Hats. Blankets. More. Check it out 👇 \nhttps://t.co/6PrLwPshor","date":"Sat Jan 29 15:26:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Beep beep! You can now charge your electric vehicle on campus! 🚙 \n\nAt the beginning of this term, Lawrence’s first EV charging station was installed in the Memorial Chapel parking lot. Learn more about LU's latest sustainability effort ⬇️ \nhttps://t.co/GxX2PdASDn","date":"Fri Jan 28 18:10:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"She is strength. She is grace. She will beat you in a race. 🏃‍♀️ \n\nMeet Cristyn Oliver '24, psychology major and standout distance runner who already has a conference win under her belt this year!\nhttps://t.co/Fq7PqE6l7C","date":"Thu Jan 27 23:02:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Björklunden vid Sjön: Swedish for \"birch grove at the lake,\" Lawrentian for \"cozy getaway in Door County\" https://t.co/slH3b3397w","date":"Wed Jan 26 23:16:12 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"It’s a chilly one today, Lawrentians! Bundle up out there with layers and hats and gloves. https://t.co/L7FZomJ94u","date":"Wed Jan 26 13:52:58 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"The Great Midwest Trivia Contest @trivdilla arrives this weekend for the 57th consecutive year, built and nurtured by Lawrentians with a passion for trivia traditions that date back more than five decades!\n\nAnyone can play! Read all about it ⬇️ \nhttps://t.co/az2oEbJxCk","date":"Tue Jan 25 23:12:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Even in winter, a walk along the river trails near campus offers the best views ❄️ \n\n📸: Kai Frueh '25 https://t.co/htr8lnjQmE","date":"Mon Jan 24 23:15:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"George Mavrakis ’19 (aka George the fish guy) is celebrating the milestone of 1M subscribers to his YouTube channel where he shares videos about saltwater fish.\n\n“It’s crazy. For me, to have that Golden Play Button on the way, it’s like a childhood dream.”\nhttps://t.co/qqJwpWyJbe","date":"Sat Jan 22 15:07:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Kenya Earl '22, @LUVikingsWBB star who just broke the career scoring record &amp; will go down as one of the greatest players in Lawrence basketball history, almost didn't play college basketball. \n\nFind out how she found her way to Lawrence 🏀 ⬇️ \nhttps://t.co/Q1Tce0uohD","date":"Fri Jan 21 18:15:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"We love Lawrence, we love Wisconsin, and we love cheese. There. We said it. #NationalCheeseLoversDay https://t.co/KZSkMYtlWP","date":"Fri Jan 21 01:14:44 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Mask up, Lawrentians! Gabe ‘24 shares tips on best masking practices so we can keep each other safe and reduce COVID-19 transmission. Find KN95s in residence halls and at the wellness center. 😷 More info at https://t.co/YXKU3XBcFS #HonorThePledge https://t.co/wz3PJKDo8K","date":"Thu Jan 20 22:03:23 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Bundling up for the walk to class, a 175-year tradition ❄️🧣 #Lawrence175\n\n📸: 1975 https://t.co/m27EfdTxRz","date":"Wed Jan 19 23:09:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Some of our favorite traditions happen during Winter Term! Here are 10 things to look forward to this term. Mark your calendars! 🗓️ \nhttps://t.co/yB4xkSZ2Oj","date":"Tue Jan 18 22:52:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Dr. Martin Luther King, Jr. famously said, \"Life's most persistent &amp; urgent question is, 'What are you doing for others?'\"\n\nLawrentians answered that question today, honoring #MLKDay with educational workshops on social justice this morning &amp; service projects this afternoon. https://t.co/BEmg6t0vbb","date":"Mon Jan 17 23:06:11 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Founders Day, Lawrentians! Today, our university is 175 years old! \n\nFounded before Appleton was a town and before Wisconsin was a state, our history is long and full of proud moments and bright people! \n\nHere's to another 175 years! #Lawrence175 https://t.co/MtfB04tzgJ","date":"Sat Jan 15 15:02:21 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence is turning 175 years old this weekend, &amp; we are going to celebrate! 🎉 \n\nThis weekend includes a virtual trivia contest, a live-streamed music recital, &amp; the opening of an online merch store as we kick off our year-long celebration! #Lawrence175\nhttps://t.co/IbRTCUcwPk","date":"Fri Jan 14 14:24:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Today is #NationalStickerDay &amp; tomorrow kicks off our #Lawrence175 celebration, so what better way to celebrate than with this sweet 175 sticker?! Be on the lookout for your chance to get one of these stickers soon, Lawrentians! 👀 https://t.co/v3CwoCugKI","date":"Fri Jan 14 00:45:21 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrentians will mark MLK Day on Jan. 17 with a day of service that includes a series of virtual discussions in the morning, volunteer opportunities in the afternoon, and an online community celebration in the evening. \n\nLearn more about the plans ⬇️ \nhttps://t.co/zxabIUfPVD","date":"Thu Jan 13 18:19:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrentians, did you know you can get FREE tutoring help in the Center for Academic Success? 📚 \n\nGet a jump-start on your courses this year and learn more about tutoring services here: https://t.co/Ws8A36aQD0 https://t.co/EmPgAulbqv","date":"Wed Jan 12 23:21:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Joanne Metcalf, a professor of music composition in the Conservatory, saw her latest work get major attention in Germany recently! 🎶 \n\nIt’s the latest in a nearly three-decade collaboration between Metcalf &amp; Singer Pur, a leading German vocal ensemble.\nhttps://t.co/jh6ZTkKLq4","date":"Tue Jan 11 23:41:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"One week until the application deadline for our future Lawrentians! No app fee, test optional, and just one 47-word essay!\n\nFind your place, find your people, find your passion. Apply to Lawrence! https://t.co/xPFPDQWGzy https://t.co/uZd8mc3YtI","date":"Sun Jan 09 01:19:03 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Getting around the Fox Cities just got easier for Lawrentians! 🚍 \n\nBeginning immediately, students can ride Valley Transit buses for free with their student ID. The pilot program is a partnership between Lawrence and @ValleyTransit.\nhttps://t.co/FWAR67CHhD","date":"Fri Jan 07 18:06:01 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Soon, we skate ⛸️ ⛸️ \n\nShout out to the folks in Facility Services for maintaining Ormsby Lake and keeping campus in tip-top shape all winter long! https://t.co/42jHe1keoS","date":"Thu Jan 06 22:33:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"President Carter has now been at Lawrence for six whole months! Learn about her first months at the helm and her focus on supporting our students.\n\n“We have to make sure the students feel our arms around them,” Carter said.\nhttps://t.co/SAKOTSi2kn","date":"Wed Jan 05 23:02:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Travis Dillon ’21 has earned one of the nation’s most esteemed awards for undergrad students doing math research!\n\nThe LU grad will receive the 2022 AMS-MAA-SIAM Morgan Prize for Outstanding Research in Mathematics by an Undergrad tomorrow in Seattle!\nhttps://t.co/OSKssF0eNb","date":"Tue Jan 04 23:23:00 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Even if off to an irregular start, Winter Term is here, snow and all! ❄️  Good luck with your new classes, Lawrentians! https://t.co/T9i3NkmzOX","date":"Mon Jan 03 22:43:02 +0000 2022","user_id":"76679137"},{"handle":"LawrenceUni","text":"Play us out, #VikesonBikes. Here comes 2022! https://t.co/WNkCeuS2ge","date":"Fri Dec 31 18:30:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Hit rewind and watch our favorite videos from 2021 📼 👇 \nhttps://t.co/0SJb9LxmIy","date":"Thu Dec 30 15:06:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Check out our most-read stories of 2021!\n\nFrom the early March announcement of a new president being named to Lawrentians doing amazing things on and off campus, there has been no shortage of Lawrence stories to tell this year.\nhttps://t.co/lJb47TVH2f","date":"Wed Dec 29 22:59:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our campus photographer @dtdamiani chose his favorite photos of 2021. Take a look 📷 👇 \nhttps://t.co/Lbk4CA4wvL","date":"Mon Dec 27 22:50:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Today we spotlight eight Lawrence stories from the past year that speak to resilience, ingenuity, creativity, and resourcefulness. These stories are among our favorites of 2021! #LULights\nhttps://t.co/bt5e0n9Kle","date":"Mon Dec 27 01:02:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The #VikesonBikes are taking advantage of new equipment in the Wellness Center, though we're not sure that's how the TRX bands are meant to be used... 💪 💪 💪 https://t.co/KiLMBmTRgH","date":"Thu Dec 23 14:34:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"With the winter solstice behind us, each day will only bring #LightMoreLight ☀️ https://t.co/cAQ86Zxbse","date":"Wed Dec 22 15:34:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"On the day of the year with the least light, let @JohnHolidayLive, professor of music, brighten your day with this performance of \"This Little Light of Mine\" from our President's Welcome gathering early this fall!\nhttps://t.co/08akjo7dBe","date":"Tue Dec 21 22:40:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Michael, originally from China and NYC, is an economics and film studies student with a passion for music. He's part of LU Posse 13, active with SOL Studio, and has performed on campus at open mic nights and at Cabaret.","date":"Sat Dec 18 16:23:33 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Wow! @edsheeran invited Lawrentian Michael Zhang '23 up on stage last week at a small concert in NYC after hearing Michael singing harmony from the crowd!\n\nRead the story and watch the video of the awesome moment here: https://t.co/5gzcDAv4oX https://t.co/jxKwSdc2ir","date":"Sat Dec 18 15:06:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Junior Michael Murphy, pursuing a BMA degree in the Conservatory, will have an opportunity to show his skills Dec. 23 when he performs a holiday concert with a popular local R&amp;B band, STEEM, at the @FoxCitiesPAC in downtown Appleton. Get to know Murphy ⬇️\nhttps://t.co/kRvhhevWXZ","date":"Fri Dec 17 18:04:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Holidays from your friends at Lawrence University! Wishing you a holiday warm with joy and a new year bright with promise. https://t.co/VETpO1lcI3","date":"Thu Dec 16 22:52:29 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"50 degrees in December? The #VikesonBikes aren't wasting a day like this. https://t.co/4bFJKvns2P","date":"Wed Dec 15 22:45:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Check out this article from the @PostCrescent on Yaw Asare ’96 and his Sharay's Ghana Style Brittle. \n\nFind out how this alum turned peanut brittle that doesn't stick to your mouth into a delicious side hustle!\nhttps://t.co/sZZ9drH6xW","date":"Tue Dec 14 23:11:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Katherine Meckel ’11 @OfMiceAndMinds has received a 6-year, $447,000 fellowship from the @NIH that will allow her to continue her neuroscience research through her final years as a doctorate student &amp; then 4 years of postdoctoral work!\nhttps://t.co/noRa2rZXxJ","date":"Mon Dec 13 22:52:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The #VikesonBikes are busy baking holiday treats this weekend. No idea how they're going to get those in the oven... https://t.co/eqf5xLVyIA","date":"Sat Dec 11 15:08:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence is decked out in its winter best ❄️ Can you name this plant? https://t.co/y6XntTYs8X","date":"Fri Dec 10 18:07:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"As an optional two-week addition to the academic calendar, D-Term gives students the opportunity to take a focused, three-unit course such as Food, Politics and Culture or The Science of Superheroes or even Happiness: Meditation and Science!\nhttps://t.co/0rKXSVMlpC","date":"Thu Dec 09 22:48:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Ceara Larson '21 combined her work in the lab and on the softball field to research the biomechanics of a softball swing, jump-starting graduate-level research!\n\nCheck it out ⬇️  https://t.co/LaOM10DPKa","date":"Thu Dec 09 00:12:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our winter sports student-athletes sure brought the energy for media day! Check out these fierce Vikings! #ReadyTheShip https://t.co/7piELDjuZS","date":"Tue Dec 07 22:56:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Missing First-Year Studies? Enjoy this 2020 performance/lecture from Professor Mark Urness &amp; friends on Miles Davis's \"Kind of Blue\" album.\nhttps://t.co/0oapCSACEg","date":"Mon Dec 06 23:16:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Who says you have to wait for snow to hit the slopes?🎿📚 \n\nThe #VikesonBikes have made their way back to campus for another round of tomfoolery during winter break. Follow along throughout the month to see what trouble they're stirring up! https://t.co/xQcm46ATsS","date":"Sat Dec 04 15:34:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did a Milwaukee-Downer professor bring the song \"12 Days of Christmas\" to the US? It appears so.\n\nCheck out this neat story about how Milwaukee-Downer, a school that merged with Lawrence in 1964, played a role in popularizing the song!\nhttps://t.co/0mLWWkUpbn","date":"Fri Dec 03 18:19:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Asha Srinivasan, music prof, continues to make her mark as a talented composer. Her work benefits from interactions with students.\n\n\"I want my students to know that I see teaching as a reciprocal act of learning. They learn from me &amp; I learn from them.\"\nhttps://t.co/1AUWGP1Iaj","date":"Thu Dec 02 22:43:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get in the holiday baking mood by watching Lawrence alum Jonah Nigh ‘02 on @peacockTV new holiday baking competition show \"Baking It\" premiering tonight!\nhttps://t.co/LdFIYSKmxB https://t.co/6rbfWNmK3i","date":"Thu Dec 02 14:23:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to two LU faculty members who were named to endowed professorships this fall:\nMonica Rico, history, was named the Robert S. French Professor of American Studies, &amp; Michael Mizrahi, piano, was named the Frank C. Shattuck Professor of Music!\nhttps://t.co/om7Vxmkg9E","date":"Wed Dec 01 18:09:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Although you might not see LaDora Thomas in her leadership roles on campus, she’s everywhere. \n\nFrom LUCC to Residential Life to All is One—to name only a few of the positions decorating her long resume—Thomas is all about leading from the background.\nhttps://t.co/hWIsO2zGK0","date":"Tue Nov 30 23:03:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"A light dusting ❄️ https://t.co/L8XZSH62Qm","date":"Mon Nov 29 22:42:12 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's almost that time of year again! We can't wait until Ormsby Lake is filled and frozen for skating and broom ball this winter! ⛸️ https://t.co/p1ro4XWyrt","date":"Mon Nov 29 01:31:15 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"If you're looking for some good books to read or gift this holiday season, check out our First-Year Studies reading list for this year!  \nhttps://t.co/zMXxNC6cCL","date":"Sat Nov 27 15:36:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tired of eating leftover turkey and sitting on the couch with your relatives? 🍗 🛋️ \n\nEscape into our virtual tour for a few minutes ⬇️\nhttps://t.co/VTpTaeiKuv","date":"Fri Nov 26 18:33:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"As we honor #NativeAmericanHeritageDay, we encourage you to learn the meaning and significance of Otāēciah, the name of our newest sculpture which is located on the recently dedicated Kaeyes Mamaceqtawuk Plaza. \n\nLearn more about it here ⬇️ \nhttps://t.co/Muv1drEVhN https://t.co/SlJwecjVnP","date":"Fri Nov 26 15:05:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Can you guess what we're grateful for this year? #Thanksgiving\n\nHint: It's being back together on our beautiful campus for Fall Term 🍂 💙 \n\nWhat are you grateful for? https://t.co/bVUvO6Y98g","date":"Thu Nov 25 18:12:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Finals wrap up today and winter break officially begins! Nice work this term, Lawrentians! Enjoy your break! https://t.co/cz5wmtDuyd","date":"Tue Nov 23 18:33:07 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet the new Science Learning Commons! 🔬 ⚛️ \n\nRoom 121 in Youngchild Hall went from outdated lecture hall to interactive classroom divided into tables equipped with technology to keep every student engaged and involved, be it a lecture or a lab!\nhttps://t.co/bD1zxEoyoD","date":"Mon Nov 22 22:53:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"🚨 New major alert! 🌏 Lawrence has launched an International Relations major that will allow students to focus their studies on global diplomacy, economics, health, and security.\nhttps://t.co/l46vg7obM2","date":"Fri Nov 19 18:06:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's #InternationalEducationWeek and we're celebrating our students from more than 50 countries beyond the US! 🌏 \n\nAdapting to a new culture can take some time. Here is some advice from our current international students for future international students!\nhttps://t.co/rOoT8E3ysP","date":"Fri Nov 19 14:32:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy last day of classes! As we close out Fall Term, our campus photographer @dtdamiani is taking a look back at some of the photographs that he thinks best exemplify what it means to be #BrighterTogether here at Lawrence.\nhttps://t.co/q3XAi2pSre","date":"Thu Nov 18 23:29:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"“No big deal, just the coolest, most flexible B.A. music major on earth,” said Brian Pertl, dean of the Conservatory.\n\nLU has reframed its BA in music major to make it more open-ended for students to pursue whatever slice of the music world interests them.\nhttps://t.co/kUD6N9GDLY","date":"Wed Nov 17 22:56:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"There wasn't a lot of snow, but we made the most of it! ❄️ https://t.co/iedhzTwnhN","date":"Tue Nov 16 22:46:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The end of Fall Term is so close! Just 3 more days of classes. 🗓️ Keep going, Lawrentians! https://t.co/9GMEMPnJYE","date":"Mon Nov 15 23:11:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"BIG NEWS: Lawrence has landed on The Princeton Review Guide to Green Colleges’ 2022 edition!\n\nGrace Subat, sustainability &amp; special projects fellow, said the listing reflects ongoing sustainability progress at Lawrence but there is much more work to do.\nhttps://t.co/xpe4OAV8ja","date":"Mon Nov 15 01:17:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Say it louder. YOU BELONG HERE. This #WorldKindnessDay, make sure someone knows they belong here, they are enough, and they can do hard things.\n\nGood luck with the last week of classes, Lawrentians! https://t.co/dzrc9w9MTM","date":"Sat Nov 13 15:19:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"We take learning—and research—personally at Lawrence.\n\nAs a LU Research Fellow, you can participate in student-faculty collaborative research on campus or in locations around the world. And by taking advantage of our funded fellowships, you'll be paid to explore your curiosities! https://t.co/Nmupnq8UXo","date":"Fri Nov 12 22:32:14 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Thanks for the late nights and early mornings you put in at the gyms, fields, pools, courses, and rinks for our @LUvikings, JVA! You make a difference at Lawrence! #ReadyTheShip","date":"Fri Nov 12 18:34:16 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Thank you to all the Lawrentians who have served and are serving in our armed forces. #VeteransDay\n\nThis image is from 1918. Learn more about the history from @LUArchives https://t.co/TEJrYvoshH","date":"Thu Nov 11 23:01:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"This #VeteransDay, we say thank you to the many Lawrentians who have served in our armed forces.\n\nOne such Lawrentian is Andy Graff '09, who after serving 4 years in the Air Force, enrolled at Lawrence &amp; went on to author \"Raft of Stars.\" Learn more ⬇️\nhttps://t.co/BuSLAuDhk2","date":"Thu Nov 11 14:04:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"AWARD ALERT🚨: The Lawrence Conservatory of Music drew high praise in the recently released 2021 The American Prize Awards, with two faculty—and the students they direct—and three alumni being honored! #LULights\n\nRead about the awardees👇\nhttps://t.co/5ZORq9O0sN","date":"Wed Nov 10 23:24:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome to Lawrence, Robyn Bowers!\n\nBowers is a leader in student recruitment at Kenyon College and has been named the new dean of admissions at Lawrence University. She will lead the Lawrence admissions team beginning in early 2022.\nhttps://t.co/dVJNkY58AF","date":"Wed Nov 10 14:16:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"With the help of interns from Lawrence and other colleges, SOLA has now released online music catalogs for cello and viola, with others on the way! 🎶","date":"Wed Nov 10 02:10:12 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"“It gets at the larger issue of privilege,” Contreras said of SOLA’s mission.","date":"Wed Nov 10 02:09:45 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Horacio Contreras, music professor, &amp; Natali Herrera-Pacheco, LU/@SphinxOrg research &amp; intern coordinator, launched SOLA (Strings of Latin America) to build catalogs of classical music from Latin America &amp; raise the profile of Latin American composers.\nhttps://t.co/CPlicgMntU","date":"Tue Nov 09 22:58:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The program is still taking applications for Lawrence students interested in becoming mentors. Apply by Dec 6: https://t.co/OBR0p42raw","date":"Tue Nov 09 02:26:40 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Today we #CelebrateFirstGen students like Molly Ruffing '22, a first-generation student eliminating obstacles for others.\n\nIn partnership with @kaukaunasd &amp; LU, Molly created a mentorship program for future #FirstGen students called \"First of Many.\"\nhttps://t.co/FzOeAPYJNP","date":"Mon Nov 08 23:05:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet Jason Brozek, the government professor shaping minds in the classroom while also helping to shape the future of Lawrence! \nhttps://t.co/K47kl4fOwO","date":"Mon Nov 08 01:44:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Would you beleaf us if we told you it came off the tree this way? 🍁 https://t.co/tUSTpwsTY0","date":"Sat Nov 06 13:42:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"As the @LUVikingsMBB team begins their season Saturday at 5PM, they'll do it with a new coach at the helm.\n\nCasey Korn took over in September, and he's got his eyes on March. Get to know @Coach_Korn 🏀 👇 \nhttps://t.co/70MF4XpI1R","date":"Fri Nov 05 13:10:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The hustle and bustle doesn't stop, but we hope you will pause for a break, Lawrentians. Finishing projects and preparing for finals are important, but so is your mental health. Take care of yourselves. 💙 https://t.co/CCp1gvNfNO","date":"Thu Nov 04 21:43:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"This weekend is a big one for LU jazz &amp; basketball alike with Jazz Weekend &amp; basketball's season opener.\n\nMallory Meyer, a first-year from Washington, participates in both, combining her passions for trombone &amp; basketball as a BMA student &amp; athlete. 🎶 🏀 \nhttps://t.co/l2jZ2l3qrm","date":"Wed Nov 03 21:44:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The annual Fred Sturm Jazz Celebration Weekend, a staple of the jazz program in the LU Conservatory of Music for 4 decades, will be held Nov 5 and 6 with a bit of a twist.🎷\n\nRead about the plans for the weekend and the pandemic protocols in place ⬇️ \nhttps://t.co/1CLmy795BE","date":"Tue Nov 02 21:46:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It was a great weekend to be a Viking! #ReadyTheShip\n\nWith our @LawrenceXCTrack teams both winning the conference meet and women's &amp; men's soccer both qualifying for the MWC Tournament for the first time in 10 years, there are lots of reasons to be proud!\nhttps://t.co/XF1Cn3OEPQ","date":"Mon Nov 01 21:52:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Halloween! Did someone order a pumpkin delivery? It seems the delivery #VikesonBikes may be lost en route. 🎃 🚲 ❔ https://t.co/8Y2tVKKjwC","date":"Sun Oct 31 14:10:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Big congrats to both men’s and women’s @LawrenceXCTrack! Conference champs 👏 👏 👏 #ReadyTheShip https://t.co/Fu6XcmZTs1","date":"Sat Oct 30 21:49:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our @LUMenSoccer team didn’t get the victory today, but still made the Midwest Conference Tournament for the first time in 10 years! Great season, Vikings! #ReadyTheShip https://t.co/PpDH3gt8El","date":"Sat Oct 30 21:44:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"In overtime, @LUWomenSoccer scores to win their last regular season game and secure a spot in the @MWCSports Conference Tournament for the first time since 2011! #ReadyTheShip \n\n@LUMenSoccer play next - a win or draw secures a spot in the tourney for them, too! https://t.co/lWx4hzI4Jx","date":"Sat Oct 30 18:39:32 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It’s a great day to be @LUvikings! \n\n🏃‍♀️🏃‍♂️ Both men’s &amp; women’s @LawrenceXCTrack won the conference championship meet today\n\n⚽️ @LUWomenSoccer score in OT to secure a spot in @MWCSports tourney - first time since 2011\n\n⚽️ @LUMenSoccer playing now to secure spot in the MWC tourney","date":"Sat Oct 30 18:21:29 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"When eighth week is about to start and you’re still writing September on the date line... https://t.co/7JZ76bhiEA","date":"Fri Oct 29 17:37:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Fall is a beautiful time to experience Lawrence's campus 🍂 \n\nSchedule your visit to Lawrence, register for our Viking Visit Day on November 5, or find virtual visit options at https://t.co/6d8DKswXml https://t.co/DyqrWv5vTM","date":"Thu Oct 28 22:19:11 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The call of the wild is real here at Lawrence, and a wide array of student organizations exist to facilitate a connection with the natural world—and to create bonds with fellow lovers of nature in the process.\n\nRead about a few such orgs here👇 \nhttps://t.co/oGDldQJH78","date":"Wed Oct 27 21:41:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"On this day in Lawrence History 110 years ago, President William Howard Taft spoke to a huge crowd at the entrance of our beloved Main Hall on October 26, 1911! \n\nImagine walking to class and looking across the green to see the 27th president of the United States! https://t.co/hDWR6kq0Ok","date":"Tue Oct 26 22:05:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Melissa Range, English professor, is a poet with a love of both creative writing &amp; literature.\n\nOn any given day, her teaching could involve finger puppets, spoons with ambition, or runaway snowmen. Get to know Prof. Range and her wacky sense of humor👇\nhttps://t.co/llB6tI94Am","date":"Mon Oct 25 22:15:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Blue &amp; White Weekend was all about Lawrence and all about fun! See for yourself 👇 \n\nShout out to our Vikings for competing fiercely and SOUP &amp; LUCC for organizing fun events all weekend long! https://t.co/qw2DmawbXz","date":"Mon Oct 25 00:40:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"This is Lawrence!","date":"Sat Oct 23 18:33:52 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's Blue &amp; White Weekend and our campus community is celebrating with a block party, tailgating, supporting our Vikings at home football, swim meet, and hockey games, and carnival games as a finale tonight! #BlueAndWhite\n\n📷 : Elliot Marsh '22 https://t.co/YY7vkmuOqP","date":"Sat Oct 23 14:10:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Blue &amp; White Weekend, Lawrentians! 🔵 ⚪ 🔵 \n\nFor our students, faculty, and staff, check out the schedule of events at https://t.co/rBgiZ4E1zI https://t.co/NVnBXgmEc4","date":"Fri Oct 22 14:20:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Row, row, row your boat. Gently down the Fox. 🚣‍♀️ https://t.co/PGioQXoPMn","date":"Thu Oct 21 22:36:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Can you imagine more beautiful places to practice piano and organ? 🎹 🎶 https://t.co/23b5gJttbr","date":"Wed Oct 20 21:55:12 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"If they don’t know what IHRTLUHC means 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩","date":"Wed Oct 20 18:29:42 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence alum Katy Schwartz-Strei ’84, who has forged an impressive career as a leader in human resources, has joined the Lawrence Board of Trustees. \n\nThanks for using your talents &amp; experience to help guide Lawrence, Katy!\nhttps://t.co/GfHfybTwNG","date":"Wed Oct 20 14:29:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Check out this podcast featuring interviews with LU alumni sharing career advice and talking about their successes and missteps along the way!\n\nTy Collins, assistant director in the Career Center, put his background in radio to work to create this series.\nhttps://t.co/PjO8DIy74m","date":"Tue Oct 19 21:49:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Shaun Donnelly ’68, former U.S. Ambassador &amp; Distinguished Visiting Scarff Professor, says his message to Lawrence students interested in careers with an international focus is a simple one.\n\nYou’re in the right place.\nhttps://t.co/VrN5z1uWWc","date":"Mon Oct 18 22:03:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Kathy Privatt and the stage have gone hand in hand for more than two decades of teaching at Lawrence.\n\nGet to know the James G. Ethel M. Barber Professor of Theatre &amp; Drama &amp; professor of theater arts who has been teaching at Lawrence since 1999!\nhttps://t.co/ygGh7I7Fva","date":"Sun Oct 17 14:15:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Jesús Smith is excited to show off his dance moves tonight.\n\nThe LU professor of ethnic studies is 1 of 8 local community dancers competing in the Sexual Assault Crisis Center’s annual Shall We Dance competition at 7pm at the Red Lion Hotel in Appleton.\nhttps://t.co/BbukbbJvVe","date":"Sat Oct 16 14:20:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tiny but awesome indeed! #ReadyTheShip\n\n📸 : Atticus Fox Katerzynske, future Viking https://t.co/ItqVn6Nngx","date":"Fri Oct 15 17:03:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The only thing greater than the generosity of our alumni &amp; friends is our gratitude!\n\nOn Giving Day 2021, more than 3,300 donors stepped up to contribute more than $1.97 million, both all-time highs for the eighth annual event! Thank you! 💙 \nhttps://t.co/b9WzPtt4jj","date":"Thu Oct 14 17:37:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MatthewArau Thanks for your gift to the Conservatory! Our students appreciate your support! #LUGives","date":"Thu Oct 14 15:33:27 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@mccannac Collin and Kara, thanks for your gift to the Conservatory of Music! #LUGives","date":"Thu Oct 14 15:32:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@zmfrench11 Thanks for supporting Lawrence University! #LUGives","date":"Thu Oct 14 15:30:42 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@jawol Thanks for supporting Lawrence and Giving Day! #LUGives","date":"Thu Oct 14 15:29:58 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Iowasoxfan Thanks for your support of the softball team at Lawrence! #LUGives","date":"Thu Oct 14 15:29:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Nestorissocool Thanks for your gifts to the Conservatory, Bjorklunden, and the Lawrence Fund! #LUGives","date":"Thu Oct 14 15:28:24 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MegginRBP Thanks for your support of Lawrence on Giving Day! #LUGives","date":"Thu Oct 14 15:25:36 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Number12Stunna Thanks for your support of Lawrence! #LUGives","date":"Thu Oct 14 15:24:06 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Silagh Thank you for your support of the Lawrence Conservatory of Music! #LUGives","date":"Thu Oct 14 15:23:30 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MaxBurgess11 Thanks for your gift to Lawrence athletics. Our student-athletes appreciate your support! #LUGives","date":"Thu Oct 14 15:22:43 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@VoiceOfLele Thanks for your gift to Lawrence. Our students appreciate your support! #LUGives","date":"Thu Oct 14 15:21:26 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@mrosatapia Thanks for supporting Lawrence! #LUGives","date":"Thu Oct 14 15:20:25 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@joyvertz Thanks for supporting Lawrence on Giving Day 2021! Shout out to the Class of 1996! #LUGives","date":"Thu Oct 14 15:19:41 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@kdsherm Thanks for supporting Lawrence on Giving Day! #LUGives","date":"Thu Oct 14 15:18:27 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@thossainkay Thanks for supporting Lawrence! #LUGives","date":"Thu Oct 14 15:17:07 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@SarcasmoToYou Thanks for your gift to the Conservatory of Music! The Lawrence community appreciates your support! #LUGives","date":"Thu Oct 14 15:14:39 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@katherinediop Thanks for your gift to the Lawrence Fund! Our students appreciate the support! #LUGives","date":"Thu Oct 14 15:12:48 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@KayHossain Thanks for your support on Giving Day! #LUGives","date":"Thu Oct 14 15:12:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@McKenzieTW Thanks for supporting Lawrence's northern campus, Bjorklunden, and the Office of Diversity and Inclusion! #LUGives","date":"Thu Oct 14 15:11:17 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MalkahKai Thanks for your gift to Lawrence! Our students appreciate the support! #LUGives","date":"Thu Oct 14 15:08:08 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@grabesmusic Thanks for supporting Lawrence on Giving Day! #LUGives","date":"Thu Oct 14 15:05:59 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@KloppyJ Thanks for your gift to student scholarships! The LU community appreciates your support! #LUGives","date":"Thu Oct 14 15:02:41 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@TomAnsusinha Thanks for supporting Lawrence University! #LUGives","date":"Thu Oct 14 15:01:50 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@FictionForReal Thank you for your gift to the Lawrence Fund. Our students, faculty, and staff appreciate the support! #LUGives","date":"Thu Oct 14 15:01:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@NikitasTime3 Thanks for supporting Lawrence and Giving Day! #LUGives","date":"Thu Oct 14 00:48:19 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ChristynAbaray Thanks for your gift to Lawrence athletics! The LU community appreciates all that you do for Lawrence! #LUGives","date":"Thu Oct 14 00:47:37 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@yerb23 Thank you for your support of Swimming and Diving at Lawrence! Our student athletes appreciate your support! #LUGives","date":"Thu Oct 14 00:46:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ReginaCornish Thanks for your support of Lawrence University! #LUGives","date":"Thu Oct 14 00:44:56 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@hayleengarciaa Thank you for supporting Lawrence University! Shout out to the Class of 2025! #LUGives","date":"Thu Oct 14 00:42:11 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@carolyndezroz Thanks for your support of Lawrence and Giving Day! #LUGives","date":"Thu Oct 14 00:41:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@PKPlaid Thanks for your support of Lawrence athletics! #LUGives","date":"Thu Oct 14 00:40:18 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@gsonnemann Thanks for your gift to Lawrence! The LU community appreciates your support! #LUGives","date":"Thu Oct 14 00:39:47 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@theonlyjuan98 Thank you for your support of Lawrence! Shout out to the Class of 2020! #LUGives","date":"Thu Oct 14 00:38:21 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@betsywinter Thanks for your support of Lawrence and Giving Day! #LUGives","date":"Thu Oct 14 00:36:55 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@SydneyMPertl Thanks for supporting Lawrence University! #LUGives","date":"Thu Oct 14 00:33:57 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@kerry_kruk Thanks for your gift to the Red Class Legacy Scholarship! Our students appreciate the support! #LUGives","date":"Thu Oct 14 00:33:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@c_kingsland Thanks for your support of Lawrence University! #LUGives","date":"Wed Oct 13 23:28:54 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@magdalena_waz Thanks for your support of Lawrence! Shout out to the Class of 2011! #LUGives","date":"Wed Oct 13 23:24:12 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@DawnMagnusson Thanks for your gift to the Office of Diversity and Inclusion! #LUGives","date":"Wed Oct 13 23:23:28 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@led_jl Thanks for your gift to student scholarships! The Lawrence community appreciates your support! #LUGives","date":"Wed Oct 13 23:22:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@yooper79 Chuck and E-Ben, thanks for your support of Lawrence athletics! #LUGives","date":"Wed Oct 13 23:20:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@lonesax47 Thank you for your support of Lawrence! #LUGives","date":"Wed Oct 13 23:18:26 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@nyhftwe Thanks for your support of Lawrence on Giving Day! Shout out to the Class of 2007! #LUGives","date":"Wed Oct 13 23:12:21 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@TerryMoran Thanks for your gift to Lawrence on Giving Day 2021! The Lawrence community appreciates your support! #LUGives","date":"Wed Oct 13 22:10:25 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@JohnGiudicessi Thanks for your support of Lawrence University! #LUGives","date":"Wed Oct 13 22:08:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@AlexanderFairc3 Thanks for your gift for Lawrence athletics! Our student athletes appreciate the support! #LUGives","date":"Wed Oct 13 22:06:46 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@helen_of_boyd Thank you for your support of the Office of Diversity and Inclusion and Giving Day 2021! #LUGives","date":"Wed Oct 13 22:05:42 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@nick__paulson Thanks for your gift for student scholarships at Lawrence! Our students appreciate your support! #LUGives","date":"Wed Oct 13 21:17:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@jason_brozek Thanks for your gift to the Office of Diversity and Inclusion. The Lawrence community appreciates your support! #LUGives","date":"Wed Oct 13 21:15:30 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@KyleSBrauer Thank you for your support of Bjorklunden and the Conservatory of Music! #LUGives","date":"Wed Oct 13 20:51:54 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@romero_hicks Thanks for your support of International Student Scholarships at Lawrence. Our students appreciate the support! #LUGives","date":"Wed Oct 13 20:50:13 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@RealLowVibe Thanks for your support of Lawrence! #LUGives","date":"Wed Oct 13 20:48:28 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@nghertel Thanks for supporting Lawrence on Giving Day 2021! #LUGives","date":"Wed Oct 13 20:47:53 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@meklingensmith Thank you for supporting Lawrence University and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:46:56 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@gloverb_1 Thanks for your gift to the Lawrence Fund! Our students appreciate the support! #LUGives","date":"Wed Oct 13 20:46:11 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@martinabby Thanks for your support of Lawrence University! #LUGives","date":"Wed Oct 13 20:45:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@saraaaa__23 Thank you for your support of Lawrence athletics and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:44:35 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@DaFishComposer Thanks for supporting the Conservatory of Music and the Lawrence Community Music School! #LUGives","date":"Wed Oct 13 20:43:33 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@andrewhd Thanks for your gifts to the Purple Class Legacy Scholarship and the Conservatory of Music! LU faculty, students, and staff are grateful for your support! #LUGives","date":"Wed Oct 13 20:42:31 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Squirtpac Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:41:26 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@eliz_bast Thanks for supporting the Lawrence library and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:40:50 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@stcroix4all Thanks for your gift in support of student scholarships. Our students appreciate the support! #LUGives","date":"Wed Oct 13 20:39:25 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@draper_sara Thanks for your gift to the Lawrence Fund! The LU community appreciates your support. #LUGives","date":"Wed Oct 13 20:38:21 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ChristofToft Chris and Nicole, thank you for supporting Lawrence University! #LUGives","date":"Wed Oct 13 20:37:17 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@abby_drapes13 Thank you for your gifts to the Lawrence Fund and the Office of Diversity and Inclusion! The LU community is grateful for your support! #LUGives","date":"Wed Oct 13 20:35:59 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@sdavbre Thank you for supporting Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:34:46 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@judgetrainer Thank you for your support of Lawrence on Giving Day 2021! #LUGives","date":"Wed Oct 13 20:34:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@LindaLMimms Thanks for your gift on Giving Day 2021! Our students are grateful for your support. #LUGives","date":"Wed Oct 13 20:17:54 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@faraway64 Thanks for your gift on Giving Day 2021! The Lawrence community is grateful for your support! #LUGives","date":"Wed Oct 13 20:11:22 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Berkowij Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:10:36 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@Coach_Antosz Thanks for your support of Lawrence athletics and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:09:53 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@msco Thanks for your gift to the Lawrence Fund! The LU community appreciates all that you do for Lawrence. #LUGives","date":"Wed Oct 13 20:04:24 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@elizlisa Thanks for supporting Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 20:02:56 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@okadventures_mn Thanks for supporting Lawrence on Giving Day 2021! #LUGives","date":"Wed Oct 13 20:01:33 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@JackNilles1 Thanks for your gift to the Lawrence Fund. Our faculty, staff, and students appreciate the support! #LUGives","date":"Wed Oct 13 20:00:55 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@nothinghead Thanks for your gift to the Lawrence Fund. The LU community appreciates your support! #LUGives","date":"Wed Oct 13 19:59:46 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@alylawmn Thanks for supporting Lawrence on Giving Day! Shout out to the Class of 1999! #LUGives","date":"Wed Oct 13 19:59:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@annedediemar Thanks for supporting Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 19:57:48 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@whatmatters2219 Thank you for your support on Giving Day! The Lawrence community appreciates you! #LUGives","date":"Wed Oct 13 19:56:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@natlustatz Thanks for supporting Lawrence on Giving Day! #LUGives","date":"Wed Oct 13 19:55:21 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@aj_composer Thanks for your gifts to the Conservatory and the Lawrence Fund. We are grateful for your support! #LUGives","date":"Wed Oct 13 19:54:44 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@kgreene29 Thank you for your gift to the Lawrence Fund! The LU community appreciates your support! #LUGives","date":"Wed Oct 13 19:53:48 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@kgeiser22 Kim and Jenn, thanks for supporting Lawrence on Giving Day! Shout out to the Class of 2000! #LUGives","date":"Wed Oct 13 19:52:39 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@msvachon Thanks for supporting Lawrence and Giving Day 2021! Shout out to the Class of 2009! #LUGives","date":"Wed Oct 13 19:51:18 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@NathanBLawrence Thanks for supporting the Lawrence library and the Office of Diversity and Inclusion! The LU community appreciates you! #LUGives","date":"Wed Oct 13 19:50:29 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ae_barton Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 19:49:38 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@carolyntomecek Thanks for your support of the Lawrence library and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:59:40 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ByGlenJohnson Thanks for supporting Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:57:11 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@coachfast Thanks supporting Giving Day 2021 and all the other ways that you support Lawrence! #LUGives","date":"Wed Oct 13 18:56:24 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ireta1423 Thanks for your support of Lawrence and Giving Day 2021! Shout out to the Class of 1988! #LUGives","date":"Wed Oct 13 18:55:38 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@hannahgabes Thanks for supporting Bjorklunden and the Red Class Legacy Scholarship on Giving Day 2021! #LUGives","date":"Wed Oct 13 18:54:15 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@raggedmeadow Thanks for your support of Bjorklunden and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:52:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@rclairem14 Thanks for supporting the Lawrence Fund and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:51:22 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@CCasper75 Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:50:38 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@chargedcurrent Thank you for your generous support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:49:34 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ravikatstp Thanks for your gifts to Bjorklunden and the Office of Diversity and Inclusion. The Lawrence community is grateful for your support! #LUGives","date":"Wed Oct 13 18:45:18 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MaggieEMiller Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:43:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@lucybullshit Thanks for your support of Lawrence! #LUGives","date":"Wed Oct 13 18:41:53 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@jrjFeist Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:40:28 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@GraceKutney Thanks for all that you do for Lawrence, including your gift on Giving Day 2021! #LUGives","date":"Wed Oct 13 18:39:23 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ThatJennie Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:38:32 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@gabys912 Thanks for your support of international student scholarships at Lawrence University! #LUGives","date":"Wed Oct 13 18:37:52 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@JV_UrbanPlanner Thank you for your support of the Lawrence Fund and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:28:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@TaraCJensen Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:27:12 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@musicbymarianna Thanks for your gift! The Lawrence community appreciates your support! #LUGives","date":"Wed Oct 13 18:26:38 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@sewpiano Thanks for supporting Lawrence on Giving Day 2021! #LUGives","date":"Wed Oct 13 18:25:47 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MollyRuffing Thanks for your gift to student scholarships on Giving Day 2021! Shout out to the Class of 2022! #LUGives","date":"Wed Oct 13 18:25:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@EmpathParis Thanks for your support of Lawrence's Office of Diversity and Inclusion! Your gift makes a difference for the Lawrence community! #LUGives","date":"Wed Oct 13 18:24:14 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@barbaralom Thanks for supporting Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:23:15 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@CramerLab Thanks for your support of Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:21:45 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@JohnNewhall Shout out to the Class of 2019! John, thank you for your support of Lawrence! #LUGives","date":"Wed Oct 13 18:21:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@rebeccazornow Thanks for your gift! The Lawrence community appreciates your support! #LUGives","date":"Wed Oct 13 18:15:29 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@sthorntonflute Thanks for your support of Lawrence on Giving Day! #LUGives","date":"Wed Oct 13 18:14:25 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@josephttennis Thanks for your support of the Lawrence library and Giving Day 2021! #LUGives","date":"Wed Oct 13 18:11:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@mirandawbryan Miranda and Joel, thanks for your support of Lawrence! Shout out to the Class of 2005! #LUGives","date":"Wed Oct 13 18:10:19 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@awborresen Thanks for your gift on Giving Day 2021 and for all that you do for Lawrence! It's a great day to be a Viking! #LUGives","date":"Wed Oct 13 18:06:44 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@kmrein Thanks for supporting the Lawrence Fund and the Office of Diversity and Inclusion! #LUGives","date":"Wed Oct 13 18:05:33 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@BachhuberJohn Thanks for your generous gift to Lawrence! Your support changes lives! #LUGives","date":"Wed Oct 13 18:03:45 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@heffeln Thanks for your support of Lawrence University! Shout out to the Class of 2002! #LUGives","date":"Wed Oct 13 17:59:58 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@willardb Ben and Erin, thanks for supporting Lawrence and Giving Day 2021! #LUGives","date":"Wed Oct 13 17:56:50 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@CEMEBrenn Thanks for your gift to student scholarships! The Lawrence community is grateful for your support! #LUGives","date":"Wed Oct 13 17:47:18 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@peteg Pete and Sarah, thank you for your gift to the library and for all that you do for Lawrence University! #LUGives","date":"Wed Oct 13 17:46:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@nataleecnm Natalee and Layla, thank you for your support of Lawrence University! Your gift makes a difference for our students! #LUGives","date":"Wed Oct 13 17:43:56 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@abuchholz2010 Thanks for your support of Lawrence University! Shout out to the Class of 2014! #LUGives","date":"Wed Oct 13 17:40:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@patmillerbirder Thanks for your support of Lawrence University and Giving Day 2021! Shout out to the Class of 1976! #LUGives","date":"Wed Oct 13 17:36:08 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@redgem123 Thanks for your gift for student scholarships! The Lawrence community appreciates your support! #LUGives","date":"Wed Oct 13 17:31:32 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ReadWriteLib Thanks for supporting Lawrence University! #LUGives","date":"Wed Oct 13 17:30:40 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@DavisFlyer Thank you, Rick and Julie, for your support of the Lawrence Fund and Giving Day 2021! #LUGives","date":"Wed Oct 13 17:28:23 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@msamberrenee Amber, thank you for supporting Lawrence on Giving Day 2021! The Lawrence community appreciates all that you are doing to make this day a success! #LUGives","date":"Wed Oct 13 17:27:15 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@EdB1947 Ed and Leslie, thanks for your generous support of Lawrence on Giving Day 2021! Shout out to the Class of 1968! #LUGives","date":"Wed Oct 13 17:25:17 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@AliLeeLat Thanks for your generous support on Giving Day 2021! Shout out to the Class of 1997! #LUGives","date":"Wed Oct 13 17:24:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@jamespcheng Thanks for supporting Lawrence and Giving Day 2021! The LU community appreciates your support! #LUGives","date":"Wed Oct 13 17:22:47 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@jpatterson740il Joe and Mary, thanks for your support of Lawrence! Shout out to the classes of 1969 and 1971! #LUGives","date":"Wed Oct 13 17:15:32 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@MariaSchaff2 Thank you for your gift for student scholarships! #LUGives","date":"Wed Oct 13 17:12:21 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tomorrow is our 8th annual Giving Day! 🎉 🎉 🎉  Join us to celebrate Lawrence and support current &amp; future generations of Lawrentians! #LUGives\n\nLearn more about Giving Day and how to participate here: https://t.co/hm4ksy7dul https://t.co/6FQW50kEWH","date":"Tue Oct 12 21:46:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The LU &amp; local communities gathered to dedicate the new Otāēciah sculpture and Kaeyes Mamaceqtawuk Plaza today on #IndigenousPeoplesDay. \n\nRead about the new spaces, the event, and remarks from campus leaders, local indigenous leaders, and the artist ⬇️ \nhttps://t.co/Muv1drnjTd","date":"Tue Oct 12 01:47:51 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"As we celebrate #NationalComingOutDay, Wisconsin LGBTQ residents share their coming out stories in this @PostCrescent story, including our own Jesus Gregorio-Smith @DrSmithJG, professor of ethnic studies.\nhttps://t.co/Bw1w7wWq3L","date":"Mon Oct 11 21:49:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Today on #IndigenousPeoplesDay we gather to dedicate the Kaeyes Mamaceqtawuk Plaza &amp; the new Otāēciah sculpture.\n\nThe installation is dedicated to the Menominee Nation &amp; their ancestral homelands, on which our campus is located. Learn about Otāēciah ⬇️ \nhttps://t.co/rrERbLu0x3","date":"Mon Oct 11 17:29:34 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"That golden sunset lighting 👀 \n\nThe Warch Campus Center's many windows make for a prime place to take in the beauty of Lawrence! 🌅 https://t.co/3d28lNjqcU","date":"Fri Oct 08 22:50:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our own voice professor @JohnHolidayLive visited with @WFRVLocal5 about his journey, the joy of teaching Lawrentians, and his new single \"Waste Mine.\" Check it out 👇 \nhttps://t.co/U0gBm0rvTw","date":"Fri Oct 08 14:01:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"How is it the end of week 4 already?? These 10-week terms can take some getting used to. Here are some tips from student writer Karina on how to make the most of each term! \n\nHint: don't procrastinate...\nhttps://t.co/8TpmT1daUC","date":"Thu Oct 07 21:51:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Is it Giving Day yet? \n\nIn just one week, we will be celebrating our 8th annual Giving Day on October 13th!  Giving Day is a powerful example of how our community is #BrighterTogether. We'll celebrate all things Lawrence and raise funds to support current &amp; future Lawrentians! https://t.co/k9W4AMsh2v","date":"Thu Oct 07 00:40:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"President Carter shared her thoughts on the importance of arts in higher education and in society with @ArtsEngines last weekend! Give it a watch 👀 ⬇️ \nhttps://t.co/eh0g13nDli","date":"Wed Oct 06 13:40:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Four faculty members have recently brought in six-figure &amp; five-figure national grants to enhance their research &amp; work:\n➗  Julie Rana, math\n🐝  Israel Del Toro, biology\n📲  Lori Hilt ’97, psychology\n🎨  Beth Zinsli ’02, art history\n#LULights\nhttps://t.co/8X8G1SgOdp","date":"Tue Oct 05 22:19:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Help us welcome to Lawrence our new vice president for diversity, equity, and inclusion Dr. Eric Mayes, a higher education leader who has championed diversity &amp; education reform initiatives for nearly two decades!\nhttps://t.co/Mz3ouJOesc","date":"Mon Oct 04 20:55:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Israel Del Toro loves bees. 🐝 \n\nThe LU assistant professor of biology studies bees, researches bee habitats, teaches about bees, caters to bees on the Lawrence campus, and advocates for bees across the Fox Valley and beyond. \n\nGet to know Del Toro ⬇️ \nhttps://t.co/5vObIDQv1L","date":"Sun Oct 03 14:13:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Take a break today to enjoy nature, Lawrentians. Rest is productive. 🍂 https://t.co/1tayfDo8N1","date":"Fri Oct 01 17:05:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tashi Litch is a mandolin player with a passion for bluegrass music &amp; a deep curiosity about the world.\n\nA sophomore in the new B.M.A. program, he &amp; 3 more Conservatory students formed a bluegrass band &amp; they're playing at a festival in Raleigh, NC!\nhttps://t.co/qZPj8pFEr0","date":"Thu Sep 30 21:47:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our @LUvikings are back in action this year! Check out these photos from our first-ever fall sports media day. Photographer @dtdamiani shares a few of his favorites. #ReadyTheShip #BrighterTogether\nhttps://t.co/4B5hOMQJJG","date":"Wed Sep 29 23:01:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Finally together on campus as sophomores, we present to you the Class of 2024! #BrighterTogether https://t.co/tielNm1sOG","date":"Tue Sep 28 22:06:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Brittany Bell, assistant dean of students and director of the Diversity and Intercultural Center! She's all about the student journey and building relationships with Lawrentians!\nhttps://t.co/5sCYy3Cf5H","date":"Mon Sep 27 23:08:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Take a (virtual) stroll around campus with our virtual tour! \n\nNew additions include views of living spaces in most residence halls, art areas in Wriston, a look at the new Center for Academic Success, additional athletic spaces, and more!\nhttps://t.co/VTpTaeiKuv","date":"Sun Sep 26 14:15:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Is there anything better than First-Year Studies outside? 📚 🌳 https://t.co/QxJDbmNdJH","date":"Fri Sep 24 17:56:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know the stars hold stories and legends from cultures around the world? ✨ 🔭 \n\nAvery Greene '24 spent the summer on a research project called Celestial Histories &amp; is creating an oral history of astronomy &amp; personal connections to the night sky.\nhttps://t.co/nI6YV9AsHu","date":"Thu Sep 23 22:30:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Anyone know the answer for 42 down on today’s New York Times crossword? https://t.co/rQMF5vcUpv","date":"Thu Sep 23 00:06:42 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get out the sweaters! The leaves are changing! 🍁 \n\nFall is the *best* time to be on campus. Watch for more autumnal beauty coming soon! https://t.co/pMIdlT5fAp","date":"Wed Sep 22 17:33:08 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Time spent on Main Hall Green is time well spent!\n\nWhether you're planning a picnic, getting friends together for a game, or hitting the books, we've got a guide for what you'll need to fully enjoy the Green. 🌳 📚 \nhttps://t.co/3rwHECoVMN","date":"Tue Sep 21 21:46:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"New year, new faces! 👋 \n\nMeet Garrett Singer, the new director of the Center for Community Engagement and Social Change, who is helping students serve &amp; build connections with our greater community.\nhttps://t.co/jppIdBU2wn","date":"Mon Sep 20 21:56:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our faculty practice what they teach. Jason Brozek, government professor and cycling enthusiast, is working with layers of government to improve bike safety on a \"scary\" stretch of highway between Appleton and Little Chute.\nhttps://t.co/luPaZ7erpW","date":"Sun Sep 19 14:25:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Alum Molly Preston ’10, an aspiring filmmaker, brought her Portland, Oregon-based film crew to the Fox Cities to film scenes for \"Freedom, WI,\" a coming-of-age comedy that she has written and is directing. Read about her journey 🎥 👇 \nhttps://t.co/3Yqxli53sG","date":"Sat Sep 18 14:13:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"To read more about today's Convocation, read our story: https://t.co/YynJvbrWLz","date":"Fri Sep 17 22:11:59 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"President Carter's first Convocation ended with this moving video of students sharing why they love Lawrence. We're not crying, you're crying. #BrighterTogether\nhttps://t.co/VOqFHeDawo","date":"Fri Sep 17 22:11:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"An important part of the Lawrence experience is the opportunity to serve &amp; make connections in the community.\n\nAs Fall Term begins, Garrett Singer is excited to welcome students as the new director of the Center for Community Engagement &amp; Social Change.\nhttps://t.co/eaU7Wd5OOF","date":"Fri Sep 17 14:03:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Getting involved is one of the best ways to make friends &amp; get the most out of your college experience. Here are 15 ways to get involved at Lawrence!\n\nBe sure to check out the community &amp; involvement fairs on Friday to find opportunities!\nhttps://t.co/sGLmYz2VRx","date":"Thu Sep 16 21:46:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"We are looking forward to President Laurie Carter's first Matriculation Convocation to the Lawrence community at 12:30 p.m. Friday, Sept. 17. \n\nRead more about the theme of comfort with discomfort and find out how to livestream ⬇️ \nhttps://t.co/KYtWkOSWOW","date":"Wed Sep 15 22:11:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"BIG NEWS just in time for the first day of classes: Lawrence is once again ranked among the best colleges in the country by U.S. News &amp; World Report!\n\nLawrence also makes the lists for Best Undergrad Teaching &amp; Best First-Year Experiences, among others.\nhttps://t.co/Mz9hRVo4Uw","date":"Mon Sep 13 15:05:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome, Class of 2025! https://t.co/hMGVx5L2Vh","date":"Mon Sep 13 01:04:13 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know our newest class of Lawrentians!\n\n23% are from Wisconsin\nAbout 100 are varsity athletes\n10% are international students representing 30 nations\nMore than 20% are first-generation college students\n\nRead more about their welcome👇\nhttps://t.co/ZydpFYozvW","date":"Sat Sep 11 14:23:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Yesterday was a perfect day for welcoming new students to the Lawrence family! \n☀️ President's Welcome at Main Hall\n✍️ Signing of the Honor Code\n🤝 Each student met Laurie Carter at the President's Handshake, receiving a sticker instead of shaking hands as a COVID-19 precaution https://t.co/FjFoalQvzR","date":"Fri Sep 10 17:08:13 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our newest Lawrentians are here! Move-in complete ☑️   #BrighterTogether https://t.co/7GZehxP7Go","date":"Thu Sep 09 19:45:13 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence has a language of its own! Learn a few LU vocab words ahead of the new academic year 👇 \nhttps://t.co/vxjigvy3Yw","date":"Wed Sep 08 17:11:06 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome to Lawrence, Coach Korn! #ReadyTheShip","date":"Wed Sep 08 16:26:57 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@ackerjg @ReedTimmerAccu It missed us at Lawrence, thankfully.","date":"Tue Sep 07 23:53:37 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It's finally move-in week! Welcome to campus, Lawrentians. We're glad you're here. We're #BrighterTogether! https://t.co/L6s4QBwHL2","date":"Tue Sep 07 22:22:21 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"One week from now, most Lawrentians will be moved into their residence halls and settling in before classes begin Monday, September 13. Take a quick tour of a few of our residence halls ahead of move-in here: https://t.co/pusFyiDq2u https://t.co/JC760Ljvzs","date":"Sun Sep 05 23:32:14 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Big win for the Vikings! 42-6 🏈\n\nCoach Aker gets a W for his first game at Lawrence! #ReadyTheShip #DontFlinch https://t.co/dqPtjY4Iab","date":"Sat Sep 04 22:54:18 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It’s game day! 🏈 Football Coach Tony Aker’s first game day at the helm since joining the Vikings in late 2019. Kick off at 3 PM Central. #ReadyTheShip \n\nMeet the coach ⬇️\n\nhttps://t.co/iFcyxPXpU7","date":"Sat Sep 04 18:56:47 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"We have many traditions at Lawrence that have carried on through the years. As we prepare to begin a new academic year, let’s celebrate 13 of them! #BrighterTogether\nhttps://t.co/FKZCJ450cC","date":"Sat Sep 04 14:13:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Curious about the First-Year Studies reading list for 2021-22? Martyn Smith, director of First-Year Studies, unbags the 10 works featured this year in this video 📚 👇 \nhttps://t.co/utFnT5rPCG","date":"Fri Sep 03 17:11:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Fall Term, here we come! #BrighterTogether\nhttps://t.co/hoUah5FeC9","date":"Thu Sep 02 22:16:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome to Lawrence! As our new international students arrive on campus this week, the international community at Lawrence has come together to offer tips, advice, and what they wish they had known during their first year. \nhttps://t.co/io4n4g0vnA","date":"Wed Sep 01 21:46:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"BIG NEWS: Lawrence University is again listed as one of the best colleges in the nation by @ThePrincetonRev! \n\nWe're also included in several separate lists within the ranking—Best Value Colleges, Best Green Colleges, &amp; Best Midwestern Colleges. #LULights\nhttps://t.co/1BxpqNWlOL","date":"Tue Aug 31 22:00:08 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"New Program Alert: We are excited to introduce a new Health and Society minor that will explore the intersection of human health &amp; global social inequities.\n\nLearn more about the new minor👇 \nhttps://t.co/TB7LPqLC90","date":"Mon Aug 30 21:53:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our beloved stained glass windows in the Memorial Chapel are being restored just in time for another academic year of community and music-making! https://t.co/eaMRfC7tiY","date":"Mon Aug 30 00:04:07 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Nobody:\n\nSconnies: Aw jeeze, do you know where the bubbler is, er no?\n\nBefore moving to Wisconsin and beginning life at Lawrence, there are a few new words you might want to master. We can help.\nhttps://t.co/MLembbTpD3","date":"Sat Aug 28 14:09:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It’s easy to recognize the power of music in concert halls &amp; music classrooms, but Betsy Kowal Jett &amp; 4 Conservatory students took it a step further this summer, tapping into music’s healing powers to help people on their mental health recovery journeys.\nhttps://t.co/WplLQ06Gjt","date":"Fri Aug 27 17:05:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"This #NationalDogDay, we are honored to introduce Pepper, the Presidential Pup! \n\nPepper is a 12-year-old toy poodle who loves treats and his humans: President Laurie Carter, her husband Gary, and their son. https://t.co/6ABdbpyG2O","date":"Thu Aug 26 14:08:12 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Twin XL sheets ✔️ \ncleaning wipes ✔️ \npens/pencils ✔️ \nshower shoes ✔️ \npower strip ✔️ \n\nDon't forget the essentials as you pack for residence hall life. Here are 14 items you'll want on your list👇 \nhttps://t.co/MVYIykcGA9","date":"Wed Aug 25 21:38:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our VITAL program pairs Lawrence students with Appleton Area School District students in need of tutoring. We connected with 134 students last year alone. Lawrence's Garrett Singer and Molly Ruffing spoke about the program on @fox11news morning show today.\nhttps://t.co/atbP7iWnj2","date":"Tue Aug 24 22:58:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"We're excited to welcome new faculty members to Lawrence! In fact, 10 new tenure-track faculty will join us for the 2021-22 academic year. \n\nGet to know this talented, dedicated group of scholars ⬇️ \nhttps://t.co/NPlUE6UldP","date":"Tue Aug 24 21:55:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It was in an LU environmental economics class that Doan Thu Thuy Nguyen ’21 realized her interest in economics &amp; her passion for the environment could co-exist. \n\nNow she's earning a doctorate at @CarnegieMellon in the Engineering &amp; Public Policy program.\nhttps://t.co/RelF5uYQPE","date":"Mon Aug 23 00:31:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"We're celebrating #NationalHoneyBeeDay from one of the first bee-friendly campuses in Wisconsin!  We earned the designation in 2019 from @xercessociety &amp; @BeeCityUSA thanks to efforts led by @IsraelDelToro, biology professor. https://t.co/BoXXZEAETW","date":"Sat Aug 21 14:07:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Summer is a peaceful &amp; beautiful time at Lawrence, but we are ready for campus to come alive again! Come back, students! We miss you! #BrighterTogether https://t.co/nTaeEy7mck","date":"Fri Aug 20 17:05:15 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Thanks to strong financial support from alumni &amp; friends, Lawrence raised $25.03 million in the 2020-21 fiscal year, marking the 4th time in school history that we've topped the $25M mark.\n\nThank you for supporting our students in a tough year!\nhttps://t.co/7F1Aw0gotI","date":"Thu Aug 19 21:46:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Our annual guide to the First-Year Studies reading list has arrived. You'll find some familiar works and discover a few new ones!\nhttps://t.co/zMXxNC6cCL","date":"Wed Aug 18 21:48:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get a sneak peek of the newest sculpture on campus! Otāēciah by Chris Cornelius, artist &amp; professor of architecture at UWM, will be dedicated with a ceremony this fall. https://t.co/JmvC1DISfo","date":"Tue Aug 17 22:04:11 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome, @LUvikings! As our fall student-athletes begin moving to campus to start their seasons, student writer &amp; @LUVikingsWBB captain Karina '22 has some tips for balancing the demands of academics and athletics.\nhttps://t.co/4ctXIFCmFW","date":"Mon Aug 16 21:54:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It won't be long until our buildings are buzzing with student voices and music again. Classes start in just one month! 🗓️  #BrighterTogether https://t.co/LVdq3sj0WZ","date":"Fri Aug 13 17:17:16 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"12 Lawrentians are setting the foundation for the Social &amp; Environmental Justice Cohort program, a new summer internship initiative at LU focused on social &amp; environmental justice issues.\n\nThey work across 9 orgs in the MKE area &amp; meet weekly as a cohort.\nhttps://t.co/hElaj2AGPW","date":"Thu Aug 12 21:55:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Each student carves their own path at Lawrence, but there are some experiences nearly all Lawrentians share! \n\nHere are 17 quintessential LU experiences ⬇️ \nhttps://t.co/be1BVpIU9A","date":"Wed Aug 11 22:04:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Read more about Andrew Graff and “Raft of Stars” here: https://t.co/BuSLAuCJuu","date":"Tue Aug 10 13:35:40 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"ICYMI: “Raft of Stars,” a novel by Andrew Graff '09, released in spring to much acclaim, is being featured on @WPR Chapter A Day July 26 through Aug. 20. Start from the beginning here: https://t.co/c69tBKTLQa \n\nGraff is from Wisconsin’s Northwoods and the novel is set in WI. https://t.co/Jxfj2k0IIN","date":"Tue Aug 10 13:20:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"There's so much to explore near Appleton! Here are 7 excellent day trips to pop the \"Lawrence Bubble\" and feed your sense of adventure!\nhttps://t.co/JcGEpplLhI","date":"Mon Aug 09 21:55:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Rain or sun, our campus sure did shine over the past four days as a venue for Appleton's @MileOfMusicFest https://t.co/qrXsoaQapX","date":"Mon Aug 09 01:00:26 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The @MileOfMusicFest's Music Education Team is back for another day of creating musical experiences for people of all ages! Check the schedule to fit some music-making into your day! https://t.co/BtKfRPyyEs","date":"Sat Aug 07 15:28:30 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Even the #VikesonBikes can't wait for #MileofMusic to begin! \n\nGet ready for 150+ artists performing 700+ FREE live original music sets right here in downtown Appleton over the next three days! https://t.co/dg5RS5a03G","date":"Thu Aug 05 13:50:07 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The @MileOfMusicFest is back starting tomorrow, and with it comes a return of the Music Education Team, led by Lawrence Conservatory of Music faculty, students, and alumni.\nhttps://t.co/B23eXT534X","date":"Wed Aug 04 22:11:31 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know Lawrence runs on a trimester schedule? 10-week terms can take time to adjust to, but student writer Karina '22 has some tips to help as we start preparing for another school year.\nhttps://t.co/MATUlRscd5","date":"Tue Aug 03 21:40:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"It’s official! We already have our first applications for the Class of 2026! We can’t wait to read apps and learn more about future Lawrentians. https://t.co/jem5xefW6Y","date":"Mon Aug 02 14:22:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Who doesn't need more veggies in their life? Students working in the SLUG (Sustainable Lawrence University Gardens) have been harvesting and selling their produce on campus this summer! 🌱 🌿 🥕 https://t.co/qOBK66bgsj","date":"Sun Aug 01 14:03:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Have we mentioned how excited we are about our new president Laurie Carter? Read this article from @DeviShastri at the @journalsentinel to find out why.\nhttps://t.co/95rBkOH29h","date":"Sat Jul 31 14:02:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The Decoda Chamber Music Festival is happening now! Tonight's 7pm CT performance in Memorial Chapel will be the first public performance on campus since the pandemic began! 🎹 🎻 \n\nLearn more about the festival and upcoming performances ⬇️  \nhttps://t.co/9WihqpmrmL https://t.co/h2iOMDp52Y","date":"Fri Jul 30 17:01:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"A very happy #InternationalFriendshipDay to all the Lawrentians who met their besties at Lawrence! 💙 https://t.co/i0NkKvoyMX","date":"Fri Jul 30 13:28:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Jesús Smith is excited to show off his dance moves.\n\nThe LU assistant professor of ethnic studies is one of 8 local dancers preparing to compete this fall in the Sexual Assault Crisis Center’s annual Shall We Dance competition in downtown Appleton.\nhttps://t.co/G9Aixjqixc","date":"Thu Jul 29 13:14:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Read President Laurie A. Carter's first letter to the Lawrence community: Moving Forward Together ⬇️ \n\n\"Together, we will ensure that the light of Lawrence shines brighter than ever before.\"\nhttps://t.co/pRqOHKv8tz","date":"Wed Jul 28 21:43:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Like any city, Appleton has its own claims to fame, whether it’s an actor from here who made it big or an innovation in technology that has its roots here in this community. \n\nHere are six facts you should know about Appleton!\nhttps://t.co/0ALFCy11Cj","date":"Tue Jul 27 21:35:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Meet Monita Mohammadian Gray ’92, who returned to LU in 2016 as our first dean of academic success.\n\n\"Honestly, the best part of my work is to watch students we support transform into more confident individuals while they find their best academic selves.\"\nhttps://t.co/vAtpxeMpvw","date":"Mon Jul 26 21:46:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Did you know LU international students form relationships with local Friendship Families? Listen as Leah McSorley, Associate Dean of Students for International Student Services, talks with @whby about the Friendship Family Program &amp; how to apply!\nhttps://t.co/C7d3RHy3wO","date":"Sun Jul 25 14:08:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Summertime, and the livin' is easy 🎶 https://t.co/TrVwPQ74nh","date":"Sat Jul 24 14:01:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Riverwalk Trail upgrade alert! Lawrence will widen, pave, and light a campus trail that runs along the Fox River, with work on the project expected to begin in 2022.\nhttps://t.co/M7o7kwDX10","date":"Thu Jul 22 21:42:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"From mapping erosion along the shores of Lake Michigan to translating theatrical works from French to English, more than 100 Lawrentians are diving deep into a wide range of research this summer funded through LU's Summer Research Fellows Program.\nhttps://t.co/lGR4Vlft9H","date":"Tue Jul 20 21:43:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"If you're looking for a sweet treat to cool you down this #NationalIceCreamDay, we've got ten ideas not far from campus 🍨 \nhttps://t.co/79jH3QBLPh","date":"Sun Jul 18 14:32:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Can you name this spot on campus? https://t.co/aBic5rcOfu","date":"Fri Jul 16 17:09:08 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"For any incoming first-year, starting the journey as a college student and making a new set of friends can be both exciting and nerve-wracking. Here are nine tips for finding your people from our student writer Karina '22.\nhttps://t.co/Rk25kMieMa","date":"Wed Jul 14 22:14:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The Decoda Chamber Music Festival, presented by the Lawrence Conservatory of Music and the musical collective Decoda, will take place in Appleton from July 28 to Aug. 6.\nhttps://t.co/ckTNltdUUZ","date":"Tue Jul 13 21:54:16 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Check out these seven man-made wonders in our neck of the woods from @TravelWI and add a few to your bucket list! \nhttps://t.co/hfXTqOxpZw","date":"Mon Jul 12 21:52:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Look who's getting settled in the President's Office. Welcome to Lawrence, President Carter! https://t.co/hGgciPlirA","date":"Thu Jul 08 17:27:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tee Karki ‘23, a government major from Nepal, has been raising awareness for the ongoing COVID-19 crisis in South Asia. That’s included the compiling of an extensive list of resources for people who want to help.\nhttps://t.co/xSPKRKuVtY","date":"Wed Jul 07 17:07:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Gary Vaughan, coordinator of Lawrence’s Innovation and Entrepreneurship Program and lecturer of economics, who lives the words “innovation” and “entrepreneurship.”\nhttps://t.co/53U2btzFPr","date":"Tue Jul 06 21:36:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy 4th of July 🇺🇸 https://t.co/Efs3qyJVso","date":"Sun Jul 04 14:02:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"As our newest Lawrentians register for their first classes, our student writer Alex '23 has some tips to help!\nhttps://t.co/9UCQRL0hZY","date":"Sat Jul 03 14:10:02 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Can't say for sure, but the skies might be brighter and the clouds might be happier over the Lawrence campus... ☀️ ☁️ https://t.co/dT3OF3Xlfu","date":"Fri Jul 02 17:03:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Welcome, President Laurie A. Carter!\n\nJuly 1 marks the beginning of a new era at Lawrence University as Carter steps in as the 17th president in the 174-year history of the university.\nhttps://t.co/Ci8syUrq2E","date":"Thu Jul 01 17:14:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Just in time for new residents, the house where the Lawrence President lives is being renamed the Olive Hamar House in honor of a student who a century ago sought to create a new social space on campus and advocated for women’s rights.\nhttps://t.co/NEDH5dcciV","date":"Wed Jun 30 21:47:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Thank you, President Mark Burstein, for all you've done for Lawrence over the last eight years. Your legacy will be a lasting one!\n\nThe Lawrence community &amp; Appleton's Mayor, Jake Woodford '13, surprised Mark with a farewell gathering on one of his last days on campus. https://t.co/Rti4ypgYG5","date":"Tue Jun 29 21:53:13 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Looking for a long summer read?\n\nRead about how Lawrence's willingness to adapt, to embrace change without uprooting our deep commitment to the liberal arts, has the school well-positioned to face coming challenges in a tumultuous higher education climate.\nhttps://t.co/7c0GRpq5Mk","date":"Mon Jun 28 21:40:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Planning for life after Lawrence can be daunting. Terrence Freeman ‘22 is preparing by participating in the Graduate School Exploration Fellowship program this summer.  \nhttps://t.co/CMnHwLRuk5","date":"Sat Jun 26 14:24:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Summer is a great time to explore the many beautiful parks and trails in the Fox Cities! 🌳 🌻 🌞  Here are a few close to campus to put on your list👇\nhttps://t.co/vJyotrwaP4","date":"Fri Jun 25 17:47:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Get to know Mike O’Connor, leader of the Career Center, who arrived at Lawrence two years ago with a mission to reimagine how the school guides students in planning for the life that awaits after graduation.\nhttps://t.co/bhAGUtm6VZ","date":"Thu Jun 24 21:53:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Two new members will join the Lawrence Board of Trustees beginning July 1: Francesca Romero Siekman ’11 will serve as a Recent Graduate Trustee &amp; Sachin Shivaram as a Term Trustee. \n\nCory Nettles ’92 will also begin his tenure as chair of the Board.\nhttps://t.co/JSM6kGFQ4e","date":"Wed Jun 23 21:53:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"The Office of Communications has bid farewell to two 2021 graduates who worked as student writers for the past two and a half years.\n\nRead a few of Awa Badiane &amp; Isabella Mariani's favorite stories they told over the years ⬇️ \nhttps://t.co/jjgIgZPAHu","date":"Tue Jun 22 22:05:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Two educators who influenced members of LU's Class of 2021 were honored by the university with the annual Award for Outstanding Teaching in Wisconsin:\nCatherine Wilda, English teacher at Kaukauna\nJudy Mueller, an English language arts teacher at Watertown\nhttps://t.co/Mh58OHWRH2","date":"Tue Jun 22 17:15:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"@LUvikings Welcome back, Coach Paider! #ReadyTheShip","date":"Mon Jun 21 23:12:03 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Pride Month! 🏳️‍🌈 https://t.co/RCaqXIhy5E","date":"Mon Jun 21 17:10:09 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy #FathersDay to all the Lawrence Dads! https://t.co/8T9SzEmdvX","date":"Sun Jun 20 14:07:06 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"\"It's a song about the Black American experience through the perspective of a Black mother,\" he said \"I wrote 'Dear America' in 2018, as a senior at Lawrence University. This is a full-circle moment, to say the least.\"","date":"Sat Jun 19 17:57:43 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy #Juneteenth Day! Lawrence alum B. Lilly performed his song “Dear America” at Appleton’s Juneteenth celebration last weekend. https://t.co/TXUsDlh0PO","date":"Sat Jun 19 17:57:42 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Tom Zoellner ’91, who is celebrating his 30th Reunion this weekend, carved out an impressive run as a journalist by seeing stories where others didn’t, drilling down to the why, &amp; always being present, all things he first explored as a Lawrence student.\nhttps://t.co/voYMgQU9sU","date":"Fri Jun 18 14:52:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Reunion Weekend! We're welcoming back hundreds of Lawrence alumni virtually over the next few days to reconnect and celebrate all things Lawrence &amp; Milwaukee-Downer! #IHRTLUVR21 https://t.co/5w95Y6n58c","date":"Thu Jun 17 17:32:05 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Lawrence University alumni will come together June 17-20 for a Virtual Reunion that will include honoring eight 2021 Alumni Award winners. Read about the eight awardees ⬇️ \nhttps://t.co/QXFVIg9DiR","date":"Wed Jun 16 22:08:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"We caught up with Mark Burstein as he finishes his final weeks as Lawrence University President. Read his reflections on eight years at Lawrence ⬇️ \nhttps://t.co/X6JD7AuQXd","date":"Tue Jun 15 21:42:00 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Three Lawrence University professors were honored with 2021 faculty awards during Commencement:\n⭐ Gustavo Fares, Spanish\n⭐ Rebecca Perry, Music Theory\n⭐ Massimiliano Verità, Arabic, Italian, &amp; Religious Studies\n\nCongratulations to all!\nhttps://t.co/X1lw9bfjv2","date":"Mon Jun 14 22:31:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Congrats to the newest alumni of Lawrence University, the Class of 2021! 🎓  #LawrenceGrad https://t.co/vTVBEd0hpv","date":"Sun Jun 13 22:35:10 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"They rose to the challenges of a rigorous Lawrence University education and persevered through obstacles no one could have imagined when they arrived on campus four years ago. Congrats to the Class of 2021! #LawrenceGrad\nhttps://t.co/nQBftqUgtn","date":"Sun Jun 13 20:25:01 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"Happy Commencement Day! 🎓 We're celebrating the Class of 2021's journey and accomplishments today! #LawrenceGrad https://t.co/M0BwskKqMJ","date":"Sun Jun 13 13:30:04 +0000 2021","user_id":"76679137"},{"handle":"LawrenceUni","text":"One more sleep until our seniors walk across the stage and officially become graduates! The #VikesonBikes have been busy preparing for the first Banta Bowl Commencement in Lawrence history! #LawrenceGrad https://t.co/3bVpYfXACh","date":"Sun Jun 13 00:04:02 +0000 2021","user_id":"76679137"}]