[{"handle":"mit","text":"Boston Globe reporter Tim Logan spotlights MIT’s efforts to increase connections with the neighborhoods surrounding Kendall Square. https://t.co/HtpoDMzJBc","date":"Wed Jun 22 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Seeing the whole from some of the parts: A new technique in computer vision may enhance our three-dimensional understanding of two-dimensional images. https://t.co/iyT7W6WwhG https://t.co/YSVVxax0QQ","date":"Wed Jun 22 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Erin Walk studies the impact of social media on the Syrian conflict as a PhD student in social and engineering systems. “My path was much less linear than I expected,” she says. “I don’t think I even realized that a field like this existed.” https://t.co/2JVcAScESt https://t.co/ALsGzFVfTK","date":"Wed Jun 22 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Molecules found in mucus can thwart fungal infection: Harnessing the strength of these specialized sugar molecules could help researchers develop new antifungal drugs. https://t.co/L6pTG624rh https://t.co/FJ2dGuaxqv","date":"Wed Jun 22 06:00:44 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Katharina Ribbeck and her research lab are deconstructing how glycans hidden inside mucus can work to keep specific organisms healthy. https://t.co/hBUFnXIrp1","date":"Tue Jun 21 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Companies use MIT research to identify and respond to supply chain risks: Pinpointing risks can also help businesses save money as they become more resilient. https://t.co/QLvvwzr0B5 https://t.co/V4kdP3BY2t","date":"Tue Jun 21 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Inspired by fireflies, EECS researchers have created insect-scale robots that can emit light when they fly, which enables motion tracking and communication. “It only takes about 3 percent more energy to shine out light,” Kevin Chen says. https://t.co/Nnn75bSwPH https://t.co/AY8XHZfmvV","date":"Tue Jun 21 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Summer solstice in the Northern Hemisphere was at 5:15 a.m. EDT today. Happy #FirstDayofSummer. 🌞 https://t.co/YpR2uljYgh","date":"Tue Jun 21 14:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chancellor Melissa Nobles and colleagues detail racism’s legacy in science, in a guest editorial for Nature. https://t.co/KZ5JxQwbOm\n\nMIT is closed today in observance of Juneteenth. https://t.co/1vRlBrJ36A","date":"Mon Jun 20 14:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"An astrophysicist in a biomedical universe: Magdelena Allen is developing a highly sensitive brain PET scanner that can help answer fundamental questions in neuroscience and particle physics. https://t.co/R0lWCKcNKu https://t.co/cWSH8mvp8X","date":"Sun Jun 19 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Those awarded include two assistant professors of physics, Erin Kara and Kiyoshi Masui, as well as alumni Camille Carlisle SM ’10, Charles Keith Gendreau PhD ’95, Laura Lopez ’04, Richard Mushotzky ’68, and Donald York ’66. https://t.co/aZneCKg6Sm","date":"Sat Jun 18 15:05:01 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT engineers developed a wireless, reconfigurable chip that could easily be snapped onto existing devices like a LEGO brick. “Having the flexibility to customize and upgrade an old device is a modder’s dream.” https://t.co/aMAT3O3Ch1","date":"Fri Jun 17 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Evan Leppink: Seeking a way to better stabilize the fusion environment. In a residency supported by the Department of Energy, the MIT PhD candidate will explore the high-field side of the DIII-D tokamak. https://t.co/WUsC11B6CJ https://t.co/vgDSALMzBq","date":"Fri Jun 17 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Could used beer yeast be the solution to heavy metal contamination in water?: A study shows that yeast, an abundant waste product from breweries, can filter out even trace amounts of lead. https://t.co/vJhZJCH490 https://t.co/tQAkdTAWxA","date":"Fri Jun 17 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Adela (YiYu) Zhang ’18, left, mentored current undergraduate Jakin Ng in MIT’s Program for Research in Mathematics, Engineering, and Science, or MIT PRIMES. https://t.co/xoYMqj3ypc https://t.co/Ry0MfyLoeK","date":"Fri Jun 17 06:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"In a new exhibit by sculptor and mixed media artist Azza El Siddique, which will be on display this summer at the MIT List Visual Arts Center, “viewers are invited to contemplate the transitory nature of everything.” https://t.co/RRTh3vIWWT","date":"Thu Jun 16 17:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Astronomers discover a multiplanet system nearby: Just 33 light years from Earth, the system appears to host two rocky, Earth-sized planets. https://t.co/iaNpRbG4bC https://t.co/LIpR6BcduA","date":"Thu Jun 16 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Stronger security for smart devices: Researchers demonstrate two security methods that efficiently protect analog-to-digital converters from powerful attacks that aim to steal user data. https://t.co/FMIV60QmkZ https://t.co/tdGgM1uNxC","date":"Thu Jun 16 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"An interdisciplinary team of researchers from MIT and elsewhere is striving to create screen-reader-friendly data visualizations that offer a similarly rich experience. https://t.co/EJufALdrdF https://t.co/r7Jtnh1aIW","date":"Thu Jun 16 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed a wood-like plant material that could eventually serve as a viable wood substitute in various construction projects. https://t.co/lTwWjZB4jW","date":"Wed Jun 15 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New maps of asteroid Psyche reveal an ancient world of metal and rock: The varied surface suggests a dynamic history, which could include metallic eruptions, asteroid-shaking impacts, and a lost rocky mantle. https://t.co/ZzAMSZ012A https://t.co/sekkGy0Uni","date":"Wed Jun 15 16:02:55 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Engineers have developed a stackable, reconfigurable AI chip that could keep devices up to date while reducing electronic waste. “You can add as many computing layers and sensors as you want,” Jihoon Kang says. “It has unlimited expandability.” https://t.co/wvOZWqWPl2 https://t.co/C04ja8IqYj","date":"Wed Jun 15 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Charting a safe course through a highly uncertain environment: A new technique can safely guide an autonomous robot without knowledge of its environmental conditions or the size, shape, or location of obstacles it might encounter. https://t.co/Vy0MhN7qc9 https://t.co/ZyZZ3Xabkz","date":"Wed Jun 15 06:00:48 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A passion for science and music: Fieldwork campfire jam sessions and geology lessons helped inspire senior Zoe Levitt to pursue songwriting full time. https://t.co/VhRtAsOdk8 https://t.co/aCybTkISqG","date":"Tue Jun 14 19:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“MIT’s success takes the spotlight as the world’s preeminent university and the US shines as the world’s superlative higher education system,” says Ben Sowter, QS senior vice president. https://t.co/sYQRRFbMSq","date":"Tue Jun 14 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"American Astronomical Society honors seven MIT affiliates with 2022 awards, prizes: Two MIT professors and five alumni recognized for outstanding contributions to astronomy research, education, and communication. https://t.co/aZneCKg6Sm https://t.co/Tyqja2rxl5","date":"Tue Jun 14 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new sensor can distinguish between viral and bacterial pneumonia, which could reduce unnecessary use of antibiotics. “If you treat a viral pneumonia with antibiotics, then you could be contributing to antibiotic resistance,” Sangeeta Bhatia says. https://t.co/4FpEvAdVQG https://t.co/wLHiERlQTy","date":"Tue Jun 14 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Linguistics luminaries Noam Chomsky and Morris Halle honored: A Stata Center wing and celebratory event mark their achievements and the next generation of linguistics research at MIT. https://t.co/FwJPvJKFmM https://t.co/L5i3nN6QQK","date":"Tue Jun 14 06:00:41 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Boston Globe reporter Brittany Bowker spotlights the work of Amy Brand, director and publisher of the MIT Press, which is celebrating its 60th anniversary this month. https://t.co/y1PGpUPE6F","date":"Mon Jun 13 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT chapter of the Phi Beta Kappa Society inducts 82 students from the Class of 2022: “Love of wisdom is the helmsman of life.” https://t.co/7kBapp2rz7 https://t.co/LulRIvLgiY","date":"Mon Jun 13 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"DUSP PhD student Jungwoo Chun makes surprising discoveries about sustainability initiatives by zooming in on local communities. By working to unpack stakeholder relationships, he helps local renewable energy projects move forward. https://t.co/NK0J1e2GMl https://t.co/CB5GlBRtZ7","date":"Mon Jun 13 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Daniel Anderson, a professor of chemical engineering at MIT and a member of MIT’s Koch Institute for Integrative Cancer Research and Institute for Medical Engineering and Science, has spent many years working on ways to package and deliver mRNA. https://t.co/wZ1C8KmZ7B https://t.co/IMKrA8L2GC","date":"Sun Jun 12 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New research suggests that training an artificial intelligence model with mathematically \"diverse\" teammates improves its ability to collaborate with other AI it has never worked with before. https://t.co/j1mpdWhXJk https://t.co/CSWa0gzmDN","date":"Sat Jun 11 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A passion for science and music: Fieldwork campfire jam sessions and geology lessons helped inspire senior Zoe Levitt to pursue songwriting full time. https://t.co/VhRtAsOdk8 https://t.co/SWlgybSZTE","date":"Fri Jun 10 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT has offered military training since 1865. Today, it hosts Air Force, Army, and Naval ROTC programs. “It’s really inspiring to be around a group of people that is so motivating,” says AeroAstro senior and Navy ROTC Midshipman Juliana Silldorff.\n\nVideo: Melanie Gonick/MIT https://t.co/dR5QD50HXT","date":"Fri Jun 10 18:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers from MIT and Brigham and Women’s Hospital have developed a gel that can be mixed into medicine to make it easier to swallow, reports CBS Boston. https://t.co/YpqHZcKwbN","date":"Fri Jun 10 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Three distinct brain circuits in the thalamus contribute to Parkinson’s symptoms: Targeting these circuits could offer a new way to reverse motor dysfunction and depression in Parkinson’s patients. https://t.co/YV76HtoLP3 https://t.co/HseaxxuAhB","date":"Fri Jun 10 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"PhD student Magdelena S. Allen is developing a next-generation PET scanner to help answer fundamental questions in neuroscience and particle physics. She just wrapped up a term as chief of MIT EMS. https://t.co/R0lWCKcNKu https://t.co/195C0AM8rJ","date":"Fri Jun 10 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Mining valuable insights from diamonds: A drive to understand natural science phenomena ignited MIT graduate student Changhao Li’s love of quantum physics. https://t.co/EGx8X2BO1t https://t.co/6GtuSvOc6Q","date":"Fri Jun 10 06:01:48 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Next spring, the Stratton Student Center is set to undergo significant renovations, which will include “refreshing the physical space inside and outside the building,” Chancellor Melissa Nobles explains. https://t.co/eMkSTkdznv https://t.co/qXRvjHRKPz","date":"Thu Jun 09 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT Chancellor Melissa Nobles is one of four guest editors who will advise on a new series of @Nature issues addressing racism in science. https://t.co/rfGwBi63ff","date":"Thu Jun 09 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"QS ranks MIT the world’s No. 1 university for 2022-23: Earning the top spot for the 11th straight year, the Institute also places first in 12 subject areas. https://t.co/TDVN0uDs9a https://t.co/MY5kUErIYC","date":"Thu Jun 09 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"CSAIL researchers analyzed an example of a machine-learning-assisted cyberattack and uncovered a security vulnerability that can reveal the website a user is browsing. Then, they developed new techniques that can thwart this attack. https://t.co/ULTO8Jw2p8 https://t.co/1oD6gjxlUP","date":"Thu Jun 09 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Eleanor Freund is an MIT PhD candidate in security studies and international relations, with a focus on Chinese statecraft and security policy. https://t.co/clH3oZbyYr https://t.co/6MRo5IIKjp","date":"Thu Jun 09 06:01:14 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Faster computing results without fear of errors: Researchers developed a new system that can make computer programs run faster, while guaranteeing accuracy. https://t.co/YT7EQoiAlq https://t.co/ITSNlCaMIF","date":"Wed Jun 08 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The new Wright Brothers Wind Tunnel replaces a campus landmark that dated to 1938 — and is now the most advanced wind tunnel in U.S. academia. “Our goal was to bring our vintage tunnel into the 21st century and beyond, and we did that,” Mark Drela says. https://t.co/GUOjpCi9Qh https://t.co/ABYcdZOpMH","date":"Wed Jun 08 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"For the first time, researchers have described how the tiny crystalline grains that make up most solid metals actually form. https://t.co/st3tEs74sM https://t.co/Ccnk0IbKoN","date":"Wed Jun 08 06:00:51 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“It’s exciting to really change the aesthetics of technology,” says Yoel Fink, who teaches the course, \"Computing Fabrics,\" to students from MIT and elsewhere. The class explores the history and future of fabrics, including next-gen textiles.\n\nVideo: Melanie Gonick/MIT https://t.co/oglcI2SKAR","date":"Tue Jun 07 17:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Migration Summit addresses education and workforce development in displacement: MIT Refugee Action Hub event convene learners, activists, and educators from around the world in storytelling and collaboration. https://t.co/mHutE3xVI1 https://t.co/F6ILeq1E42","date":"Tue Jun 07 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Molecules found in mucus can thwart fungal infection; harnessing their strength could help researchers develop new antifungal drugs. “Mucus displays an extensive small-molecule library with lots of virulence inhibitors,” Katharina Ribbeck says. https://t.co/L6pTG624rh https://t.co/XomDm7sksu","date":"Tue Jun 07 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT Simmons Hall as an interactive canvas: Student project “116 x 31” transforms an iconic building on MIT’s campus with a large-scale interactive installation. https://t.co/7D0C0G35Un https://t.co/RBCvCY0ucw","date":"Tue Jun 07 06:00:46 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"We are proud.\n\nImage: Jose-Luis Olivares/MIT https://t.co/iWuU9uEtNA","date":"Mon Jun 06 19:56:14 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New York Times columnist Peter Coy spotlights Professor Nancy Leveson and Elizabeth White Baker SM ’22 and their work on detecting and preventing errors in medicine administration. https://t.co/gurKCwd4L8","date":"Mon Jun 06 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Helping dairy farmers raise healthy cows: Labby has developed an optical milk scanner based on materials-sensing technology that dairy farmers can use to measure the health of their cows https://t.co/uSpLKnuuWl https://t.co/IFrnIU2MCK","date":"Mon Jun 06 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT PRIMES mentors high schoolers in math research. For rising MIT sophomore Jakin Ng, it was “a taste of what professional mathematicians do — instead of just learning about results other people have already achieved, actually creating new knowledge.” https://t.co/xoYMqj3ypc https://t.co/QL3XwIh7UD","date":"Mon Jun 06 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed a trajectory-planning system for autonomous vehicles that enables them to travel from a starting point to a target location even when there are many different uncertainties in the environment. https://t.co/Vy0MhN7qc9 https://t.co/Hqi6XAC4uA","date":"Mon Jun 06 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Provost Cynthia Barnhart on MIT's community of excellence https://t.co/vD3hsnD7pN https://t.co/cj2GYZTLA9","date":"Sun Jun 05 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Is it topological? A new materials database has the answer: Searchable tool reveals more than 90,000 known materials with electronic properties that remain unperturbed in the face of disruption. https://t.co/L2CFIULhJQ https://t.co/9pip3Tu1DT","date":"Sat Jun 04 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"It's the weekend. Enjoy, everyone. https://t.co/hLxQ29iudJ","date":"Fri Jun 03 20:25:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Assistant Professor Erin Kara speaks about the data sonification of the black hole at the center of the Perseus Galaxy. Kara notes that data sonification is “a really exciting way to hear the universe and think about it in a new way.” https://t.co/wyXmWjbGHM","date":"Fri Jun 03 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Linguistics luminaries Noam Chomsky and Morris Halle honored: A Stata Center wing and celebratory event mark their achievements and the next generation of linguistics research at MIT. https://t.co/tmNU6of3DL https://t.co/qTUJ6ceSrx","date":"Fri Jun 03 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Making data visualization more accessible for blind and low-vision individuals: Researchers have created prototypes that enable screen-reader users to quickly and easily navigate through multiple levels of information in an online chart. https://t.co/EJufALdrdF https://t.co/6TEZhcNatm","date":"Fri Jun 03 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"RT @MIT_CIS: MIT celebrates the achievements of its linguistics luminaries Noam Chomsky and Morris Halle.\n\nhttps://t.co/0gZqW7Pcya\n\n#noamchomsky @JGHalle  @MITphilosophy @JohnTirman  @MIT_SHASS https://t.co/n74CeWC6yy","date":"Thu Jun 02 20:01:17 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"RT @MIT_SHASS: 20 Faculty, All 5 MIT Schools: In this series, MIT faculty offer insights — from many fields and perspectives — on one of the most consequential issues of our time. @MIT_SCC https://t.co/x4kSKK6PaY https://t.co/JC6hEFL8CG","date":"Thu Jun 02 18:01:44 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A voice for change — in Spanish: Postbac Jessica Chomik-Morales hopes to inspire the next generation of Spanish-speaking scientists with her podcast, “Mi Ultima Neurona.” https://t.co/pfylU3bbtz https://t.co/LSkxv3Bmtv","date":"Thu Jun 02 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT engineers boost signals from fluorescent sensors: The advance allows the particles to be placed deeper within biological tissue, which could aid with cancer diagnosis or monitoring. https://t.co/M93DQRq8eR https://t.co/RoxuppwSPH","date":"Thu Jun 02 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Fieldwork campfire jam sessions and geology lessons helped inspire senior Zoe Levitt to pursue songwriting full time. https://t.co/jjCO7yWs5h https://t.co/p8WM8btu48","date":"Thu Jun 02 15:01:31 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Astronomers have snapped the first image of Sagittarius A*, the supermassive black hole at the heart of the Milky Way. “The result is a milestone in our understanding of black holes,” says Colin Lonsdale of @MITHaystack. https://t.co/UWtOVVO9JU https://t.co/FCq4A8l7AU","date":"Thu Jun 02 06:00:43 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT celebrated the classes of 2020 and 2021 during a special ceremony that featured an address by Kealoha Wong ’99, Hawaii’s first poet laureate. “...Most likely, our most significant impact will be in our communities and in our families,” Kealoha said. https://t.co/76CjH0kZQ1","date":"Wed Jun 01 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Is diversity the key to collaboration? New AI research suggests so: A new training approach yields artificial intelligence that adapts to diverse play-styles in a cooperative game, in what could be a win for human-AI teaming. https://t.co/8Ct197ImPI https://t.co/4s5l5a1CgD","date":"Wed Jun 01 16:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“Zoom out”: Kealoha Wong ’99 calls on MIT graduates to consider their lives within the enormity of the universe: Hawaii's first poet laureate spoke at an on-campus celebration for the classes of 2020 and 2021. https://t.co/r245eOVzaK https://t.co/LyiLOhUGtl","date":"Wed Jun 01 13:20:32 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Living better with algorithms: Graduate student Sarah Cen explores the interplay between humans and artificial intelligence systems, to help build accountability and trust. https://t.co/C3tCJSr8Ml https://t.co/O6kJKhWl3H","date":"Wed Jun 01 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"On the road to cleaner, greener, and faster driving: Researchers use artificial intelligence to help autonomous vehicles avoid idling at red lights. https://t.co/LLIk1iVA5b https://t.co/s6A4jfQNRF","date":"Tue May 31 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chancellor Melissa Nobles' address to MIT seniors: “Never forget that you are often stronger and more resilient than you think you are,” Nobles told the undergraduate Class of 2022. https://t.co/nIt1bwoV5d https://t.co/OzRXQsurGa","date":"Tue May 31 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A passion to understand how nature works ignited NSE PhD student Changhao Li’s love of quantum physics. “The basic principles of this world are beautiful and can explain many interesting phenomena,” he says. “This allows me to explore the universe.” https://t.co/EGx8X2BO1t https://t.co/qtSQUJC5Sk","date":"Tue May 31 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"We honor the women and men who died while serving in the country's armed forces. #MemorialDay https://t.co/HkKBgikYoV","date":"Mon May 30 13:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The Special Ceremony honoring the Classes of #MIT2020 and #MIT2021 is happening now: https://t.co/poSdONaGr4 https://t.co/VMgHTokVhh","date":"Sat May 28 14:01:47 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“The world needs your smarts, your skills,” Ngozi Okonjo-Iweala tells MIT’s Class of 2022: Head of the World Trade Organization urges graduates to embrace opportunities to serve others. https://t.co/axLZro65Ix https://t.co/acKc6BaKpY","date":"Fri May 27 21:12:17 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The Undergraduate Commencement Ceremony is happening now: https://t.co/poSdONaGr4 #MIT2022 https://t.co/VkVcgrlSVG","date":"Fri May 27 18:02:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"That moment when Temi Omitoogun, President, Class of 2022, pauses to take a video during the OneMIT Ceremony. 🤳🏾 #MIT2022 https://t.co/LMy7RgIpg4","date":"Fri May 27 16:29:01 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"You did it, MIT graduates! We're so proud of you. #MIT2022 https://t.co/yuOXxDMgZN","date":"Fri May 27 15:30:15 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"\"So now, go out there. Join the world. Find your calling. Solve the unsolvable. Invent the future. Take the high road. Try always to share your bananas! And you will continue to make your family, including your MIT family, proud.\" — President Rafael Reif #MIT2022 https://t.co/Fxg8F1hIqQ","date":"Fri May 27 15:16:29 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"\"Make the world a little more like MIT: More daring and more passionate. More rigorous, inventive and ambitious. More humble, more respectful, more generous, more kind.\"   — President Rafael Reif #MIT2022 https://t.co/M3dApSYafZ","date":"Fri May 27 15:10:11 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"\"I am so extremely grateful to have all of you here on Killian Court, on this wonderful day, for this tremendously important occasion.\"  — President Rafael Reif #MIT2022 https://t.co/FiQXjKx0ej","date":"Fri May 27 15:05:50 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"\"To the parents and families of today’s graduates, here and everywhere: A huge 'Congratulations' to you as well! This day is the joyful result of your loving support and sacrifice. And for that, you have our deepest respect and admiration.\" — President Rafael Reif #MIT2022 https://t.co/TizKDQqhBv","date":"Fri May 27 15:00:56 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Congratulations, new alumni! #MIT2022 https://t.co/ISPQ8uBA8y","date":"Fri May 27 14:56:37 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"DYK, 18% of the Class of 2022 are first generation college students. #MIT2022 https://t.co/MbhUlcL3ev","date":"Fri May 27 14:15:40 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The OneMIT Ceremony for all members of the Class of #MIT2022 is happening now: https://t.co/poSdONaGr4 https://t.co/9pIaFF24vW","date":"Fri May 27 13:50:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"DYK, there are 1,099 students in the Class of 2022. They represent 48 countries and 47 U.S. states. #MIT2022 https://t.co/kjg9XALcMu","date":"Fri May 27 13:00:46 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A joyful, welcome sight — at last! #MIT2022 https://t.co/oludrDpNYv","date":"Fri May 27 12:24:43 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Kealoha Wong ’99, Hawaii’s first poet laureate, shares his excitement at being selected to deliver the keynote address at the graduation celebration for the classes of 2020 and 2021. “It’s a huge honor,” says Kealoha. https://t.co/xnLbSwB5dG","date":"Thu May 26 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"What have this year’s graduates gained from MIT? As Commencement nears, some say: “Courage in tackling the unknown.” “Selective ambition.” “I am better at failing and recovering.” “I no longer strive for perfection.” “I can do so much more.” #MIT2022\n\nVideo: MIT News Office https://t.co/ndvg4qOeJP","date":"Thu May 26 13:34:51 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"\"This afternoon, the Killian Court flags fly at half-staff. We do this with a profound sense of discouragement and sorrow for all the victims of mass gun violence, recently and over years – so many of them children.​\" — MIT President Rafael Reif","date":"Wed May 25 20:32:34 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Ultrathin fuel cell uses the body’s own sugar to generate electricity: Engineers have developed a glucose power source that could fuel miniature implants and sensors. https://t.co/u2WwugtQpw https://t.co/kDMy5von7g","date":"Wed May 25 17:06:15 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers unveil a secret of stronger metals: Study shows what happens when crystalline grains in metals reform at nanometer scales, improving metal properties. https://t.co/st3tEs74sM https://t.co/wi10GLzOv8","date":"Wed May 25 16:00:47 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"It’s known on campus as “The Sponge.” But junior Karyn Nakamura recently transformed Simmons Hall’s iconic façade into an interactive canvas. “In Karyn we have an artist who is a peer,” says Joshua Higgason, a technical instructor in theater arts. https://t.co/7D0C0G35Un https://t.co/tepqaC1jnI","date":"Wed May 25 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"In class 2.788 (Mechanical Engineering and Design of Living Systems) students explore how mechanics, structure, and materials intersect with biological systems by studying butterflies at every stage of their metamorphosis. https://t.co/2xfKEfatvN https://t.co/Hfolxqbxg1","date":"Wed May 25 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Joseph Coughlin, director of the @MIT_AgeLab, explores the impact Baby Boomer and Gen X retirement could have on the increasing labor shortage in the United States. https://t.co/Z2f1miLhoe","date":"Tue May 24 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Charting a safe course through a highly uncertain environment: A new technique can safely guide an autonomous robot without knowledge of its environmental conditions or the size, shape, or location of obstacles it might encounter. https://t.co/Vy0MhN7qc9 https://t.co/U7uevNtiGl","date":"Tue May 24 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Postbac researcher Jessica Chomik-Morales hopes to inspire a new generation of Spanish-speaking neuroscientists with her podcast, “Mi Última Neurona.” Postdoc Arturo Deza says: “Even if you’re not a scientist, it’s really going to captivate you.” https://t.co/pfylU3bbtz https://t.co/x0vTT7AsTx","date":"Tue May 24 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Study finds cells take out the trash before they divide: Cells may use this strategy to clear out toxic byproducts and give their offspring a clean slate. https://t.co/wxsSqd6htG https://t.co/MuUS5NDpe6","date":"Tue May 24 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Tiffany Chu ’10, chief of staff for Boston Mayor Michelle Wu, discusses her goals for creating a more inclusive Boston and her Asian American and Pacific Islander heritage. https://t.co/5Bo07SIGSI","date":"Mon May 23 17:05:01 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Eleanor Freund receives Jeanne Guillemin Prize: Awarded by the Center for International Studies, the prize will help support the PhD candidate's dissertation research on Chinese foreign and security policy. https://t.co/clH3oZbyYr https://t.co/yAWnvQ8qOq","date":"Mon May 23 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new study has found that artificial intelligence can identify patients’ self-reported race from medical images that contain no indicators detectable by human experts. https://t.co/go0Q6DSuW6 https://t.co/FWThVucu98","date":"Mon May 23 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Springing people from the poverty trap: Field experiment in Bangladesh shows the poor simply lack opportunities to gain wealth — but a one-time boost can make a major difference. https://t.co/pJ7EiLYlmd https://t.co/vA2qoFUUKw","date":"Mon May 23 06:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT professor of physics Richard Milner, Jefferson Laboratory physicists Rolf Ent and Rik Yoshida, MIT documentary filmmakers Chris Boebel and Joe McMaster, and Sputnik Animation’s James LaPlante have teamed up to depict the subatomic world in a new way. https://t.co/orZY7marB7 https://t.co/qNwBKjZtfB","date":"Mon May 23 03:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Astronomers are seeking echoes from black hole X-ray binaries — where a star orbits a black hole — to reconstruct a black hole’s immediate vicinity. Their discovery of new sources of these echoes may help scientists trace black hole evolution. https://t.co/gBrcaasObQ https://t.co/3JQcwHx58D","date":"Sat May 21 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Provost Cynthia Barnhart talks about the connection between diversity and excellence: https://t.co/1kbGG56TqR https://t.co/UOODGo8V0U","date":"Fri May 20 18:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Markus Buehler and his research group have been studying the sonification of molecules by capturing their vibrations and using computers to turn the vibrations into audible sounds. https://t.co/pLTgMYCzUj","date":"Fri May 20 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Thirteen from MIT awarded 2022 Fulbright Fellowships: Fulbright US Student Program funds opportunities for research, graduate study, and teaching abroad. https://t.co/iSWan1sMvT https://t.co/6NMAJxX5o7","date":"Fri May 20 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"What will it take to make electronics smarter, faster, and more resilient? One idea is to build them from “topological” materials that retain core properties even when deformed or disrupted. Physicists have now identified more than 90,000 such materials. https://t.co/L2CFIULhJQ https://t.co/NgvK1IFgNW","date":"Fri May 20 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The winner of this year’s MIT Water Innovation Prize, Mesophase, has developed a surface coating designed to improve the efficiency of condensers used in power plants around the world. https://t.co/HnhfbaBae6 https://t.co/ldMgeN7Yjq","date":"Fri May 20 06:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The Boston Globe honored a number of MIT faculty and alumni in their Tech Power Players 50 list, which celebrates the “most influential — and interesting — people in the Massachusetts technology scene.” https://t.co/aJ84L8iE0l","date":"Thu May 19 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Connecting MIT students with women leading in semiconductors: Global Semiconductor Alliance’s Women’s Leadership Initiative highlights career opportunities for women in hard technology. https://t.co/goftyKPfNV https://t.co/QMP6dWj1ps","date":"Thu May 19 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Aerospace engineer Tiera Fletcher ’17 has helped bring to life one of the most powerful rockets ever built — NASA’s Space Launch System — while also mentoring kids from underrepresented groups in STEM. https://t.co/DqVxmsVN24 https://t.co/idE2x132tP","date":"Thu May 19 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The flashing of a nearby star has drawn MIT astronomers to a new and mysterious system 3,000 light years from Earth. https://t.co/pSsNspXIMr https://t.co/twm9ySOMbK","date":"Thu May 19 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have solved a geometry problem on equiangular lines that explores how to divide n-dimensional spaces into theoretically equal slices. https://t.co/HU4czaY48K","date":"Wed May 18 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Daniel Anderson on the progress of mRNA vaccines: Following the successful development of vaccines against Covid-19, scientists hope to deploy mRNA-based therapies to combat many other diseases. https://t.co/wZ1C8KmZ7B https://t.co/AV3PmtIYJp","date":"Wed May 18 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Aiming to build fairness, safety, and accountability into artificial intelligence, LIDS graduate student Sarah Cen is exploring algorithm design. “Engineering systems are not divorced from the social systems on which they intervene,” she says. https://t.co/dHEkung9Db https://t.co/dH9CXlwhJH","date":"Wed May 18 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT Students 📢","date":"Wed May 18 13:00:20 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Unpacking black-box models: Researchers create a mathematical framework to evaluate explanations of machine-learning models and quantify how well people understand them. https://t.co/Q2AHMBVYFO https://t.co/6auNoJufaA","date":"Wed May 18 06:00:46 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT has offered military training since 1865. Today, it hosts Air Force, Army, and Naval ROTC programs. “It’s really inspiring to be around a group of people that is so motivating,” says AeroAstro senior and Navy ROTC Midshipman Juliana Silldorff.\n\nVideo: Melanie Gonick/MIT https://t.co/nCXDgEXRHl","date":"Tue May 17 18:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Desiree Plata’s research group developed a new compound using zeolite and copper that has the “potential to greatly reduce the amount of methane in the atmosphere and slow warming temperatures on the planet.” https://t.co/gbbCUSeMG1","date":"Tue May 17 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Three from MIT elected to the National Academy of Sciences for 2022: Faculty members Angela Belcher, Pablo Jarillo-Herrero, and Ronitt Rubinfeld elected by peers for outstanding contributions to research. https://t.co/jEBduan1RK https://t.co/8YGgBcnZcz","date":"Tue May 17 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"No one likes sitting at a red light, or wasting fuel and producing emissions while idling. What if motorists could pace themselves to arrive when the light is green? A LIDS team’s new machine-learning approach could keep traffic flowing smoothly. https://t.co/LLIk1iVA5b https://t.co/4qtCpE2mT1","date":"Tue May 17 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Soft assistive robotic wearables get a boost from rapid design tool: Scientists have created a design and fabrication tool for soft pneumatic actuators for integrated sensing, which can power personalized health care, smart homes, and gaming. https://t.co/t908bCmHZ5 https://t.co/ZncEpLyiIf","date":"Tue May 17 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers from the Event Horizon Telescope team, including MIT scientists, unveiled the first picture of the supermassive black hole at the heart of the Milky Way. https://t.co/FXadHf4lWl","date":"Mon May 16 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT expands research collaboration with Commonwealth Fusion Systems to build net energy fusion machine, SPARC: New five-year agreement will support SPARC science, increase graduate students and postdocs, and support interdisciplinary work. https://t.co/R5ycyLNCw0 https://t.co/GhpZQUfpT3","date":"Mon May 16 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Glucose fuels every cell in our bodies. Could it also power medical implants? A DMSE team thinks so: They’ve designed a fuel cell that converts glucose directly into electricity. The device is only about 1/100 the width of a human hair. https://t.co/u2WwugLrh4 https://t.co/B7bMKFyfhw","date":"Mon May 16 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have used the Rendering-Invariant State Predictor (RISP) method to predict the action sequence, joint stiffness, or movement of an articulated hand. https://t.co/YHAlmNg1GV https://t.co/OaPL1h77iX","date":"Mon May 16 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Approaching human cognition from many angles: Senior Keith Murray combines his interests in neuroscience, computation, and philosophy to better understand human behavior. https://t.co/f0CIzz1TSr https://t.co/b53bQgMd1o","date":"Sun May 15 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have developed a system that enables a robot to learn a new pick-and-place task based on only a handful of human examples. https://t.co/AgrYOFJVgW https://t.co/MQm4TLoxgU","date":"Sat May 14 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"PhD student and violinist Lillian “Lily” Tsai recently performed in a benefit concert for the Newton Food Pantry and Community Freedge, raising over $1,000. https://t.co/YylBtZburJ","date":"Fri May 13 18:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Good luck with final exams, @MITstudents! The cat wizard is with you. https://t.co/tZIcpUocW2","date":"Fri May 13 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Astronomers have snapped the first image of Sagittarius A*, the supermassive black hole at the heart of the Milky Way. “The result is a milestone in our understanding of black holes,” says Colin Lonsdale of @MITHaystack. https://t.co/UWtOVVO9JU https://t.co/isli8cofPC","date":"Fri May 13 16:05:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT students and postdocs advocate for increased federal support of scientific research on Capitol Hill: Students and postdocs from MIT's Science Policy Initiative meet with lawmakers on science-engineering-technology Congressional Visit Days 2022. https://t.co/2oz5j9xnNU https://t.co/UyzXd4n7k5","date":"Fri May 13 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Tackling chemical synthesis and advocacy: PhD student Azin Saebi develops chemical tools for bioconjugation and works to improve diversity and inclusion at MIT. https://t.co/PEwTE3lgad https://t.co/aWGF1CwLi7","date":"Fri May 13 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Julie Chen ’86, SM ’88, PhD ’91 has been named the next chancellor of UMass Lowell. “Chen is considered one of the region’s leading experts in nanotechnology, earning her the nickname ‘nanoqueen.’” https://t.co/gquaIpWGbg","date":"Thu May 12 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Six from MIT Named 2022 Knight-Hennessy Scholars: Fellowship funds graduate studies at Stanford University. https://t.co/53AkU9EqIP https://t.co/OQsbOKecwo","date":"Thu May 12 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Astronomers snap first-ever image of supermassive black hole Sagittarius A*: The image reveals a glowing, donut-shaped ring at the Milky Way’s heart. https://t.co/UWtOVVO9JU https://t.co/fTJdcSyZqE","date":"Thu May 12 15:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Global MIT launches the Africa Distinguished Visitors Program: The program’s inaugural honoree, Professor Mohamed H. A. Hassan, president of the World Academy of Sciences, recently visited MIT. https://t.co/518JzEgXtZ https://t.co/9PuG14e1PK","date":"Thu May 12 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A study co-authored by Professor Pierre Azoulay finds that per capita, foreign-born residents have started more businesses than people born in the U.S. “[Immigrants] create more firms that will grow up to be very large,” explains Azoulay. https://t.co/957Gl0ZTcA","date":"Wed May 11 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT class journeys to fascinating places where mechanical engineering affects biology: For students in 2.788 (Mechanical Engineering and Design of Living Systems), newly discovered phenomena present opportunities for exploration and discovery. https://t.co/2xfKEfatvN https://t.co/0Vc6sSve9d","date":"Wed May 11 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Before cells start to divide, they tidy up, tossing out molecules they may not need anymore. Cells lose about 4 percent of their mass at this stage, which may help give their offspring a “fresh start,” without accumulated junk from the parent cell. https://t.co/wxsSqd6htG https://t.co/TZOb4PBXuC","date":"Wed May 11 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A long-term study from Bangladesh shows it’s mainly a lack of resources that keeps the very poor from improving their circumstances. But acquiring even a single cow can help spring people from the poverty trap. https://t.co/OU2txQJ4Z7 https://t.co/YZfJFmt0Wl","date":"Tue May 10 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers in MIT’s Computer Science and Artificial Intelligence Laboratory developed a robotic arm equipped with a sensorized soft brush that can untangle hair. https://t.co/o0sIDx75pT","date":"Tue May 10 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Poet Kealoha Wong ’99 to speak at the MIT Classes of 2020 and 2021 Graduation Celebration: MIT to honor pandemic online graduates with on-campus event. https://t.co/IAvtUFwX9u https://t.co/lrKthpt6IC","date":"Tue May 10 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT engineers introduce the Oreometer: Mechanical engineers put an Oreo’s cream filling through a battery of tests to understand what happens when two wafers are twisted apart. https://t.co/qKDmxP8qGy https://t.co/hsRFAaobLd","date":"Tue May 10 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Robots constructed by 32 students competed in the annual 2.007 Robot Competition, which was held in person for the first time in three years. https://t.co/TRXrEC3fXV","date":"Mon May 09 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Surface coating designed to improve power plant efficiency wins 2022 Water Innovation Prize: The student pitch competition included a variety of solutions addressing water access, usage, and maintenance. https://t.co/5R6St1WtCF https://t.co/SKoHRdMjK4","date":"Mon May 09 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Immigrants to the U.S. are more likely to start businesses than native-born Americans are, according to a new study. “Immigrants, relative to natives and relative to their share of the population, found more firms of every size,” says Pierre Azoulay. https://t.co/NyqaeAoxEd https://t.co/pPLtkBlUSr","date":"Mon May 09 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Better Conforming Medical Devices: Canan Dagdeviren works to adapt technology to the human body. https://t.co/N7ekXhR5Fl https://t.co/CfGtm08wzI","date":"Sun May 08 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Bringing “cultural diplomacy” to the classics: Wiebke Denecke, an expert in East Asian literature, wants to add to the international, interdisciplinary study of the humanities at MIT. https://t.co/CGS8oLb7rw https://t.co/Z0q4NU2jCF","date":"Sat May 07 14:01:39 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Sanjay Sarma to step down as vice president for open learning: Following nine years leading MIT’s work on digital learning, the longtime faculty member will focus on teaching, research, writing, and entrepreneurship. https://t.co/29E4mf406S https://t.co/p1ag5Kw5ZK","date":"Fri May 06 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT astronomers detected what appears to be a “black widow” binary with the shortest orbital period ever recorded. “It behaves exactly like a black widow in many, many ways,” says postdoc Kevin Burdge, “but it also does a few new things.” https://t.co/ZeTbosIrNP","date":"Fri May 06 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A multidisciplinary group of graduate students led an effort to infuse one of MIT’s largest machine learning courses with material related to ethical computing, data and model bias, and fairness in machine learning. https://t.co/Tt20RBfrXQ https://t.co/VTm9v8eDTr","date":"Fri May 06 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Senior Keith Murray combines his interests in neuroscience, computation, and philosophy to better understand human behavior. “I’m trying to blend different approaches together to understand the complexities of human cognition,” he says. https://t.co/8HoeYEZCCX https://t.co/dnuAMarYBa","date":"Fri May 06 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new heat engine with no moving parts is as efficient as a steam turbine: The design could someday enable a fully decarbonized power grid, researchers say. https://t.co/ERAYvNtAtL https://t.co/9WvA9cWb2S","date":"Fri May 06 06:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Embracing ancient materials and 21st-century challenges: An early interest in archaeology led senior Sophia Mittman to explore many facets of materials science, from restoring artwork to making mining more sustainable. https://t.co/TtmutJfFI2 https://t.co/tCjEFspbFs","date":"Thu May 05 18:01:54 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Associate Professor Jared Curhan has found that “breakthroughs in negotiations occurred nearly twice as frequently after a conversational lapse of between 3.5 and 9.5 seconds as they did at any other point in the conversation.” https://t.co/pdvyyiOuP9","date":"Thu May 05 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Secret superheroes of @MITEECS: Lecturers ensure the technology, curriculum, and instructional delivery of MIT’s classroom education keep up with the dizzying pace of its research. https://t.co/FXZtvUvPWF https://t.co/Yv6n2U5GLD","date":"Thu May 05 16:02:54 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"With a new framework, researchers can evaluate explanations of machine-learning models and quantify how well people grasp them. “Understandability needs to be another metric for evaluating our explanations,” says Yilun Zhou. https://t.co/Q2AHMBVYFO https://t.co/rFzXXjsKLV","date":"Thu May 05 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers engineered a strain of bacteria that can help protect the natural flora of the human digestive tract from antibiotics and prevent opportunistic infections from developing. https://t.co/Tyb8crMKHZ https://t.co/8reHNcVGGU","date":"Thu May 05 06:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Astronomers discover a rare “black widow” binary, with the shortest orbit yet: The system is orbited by third stellar companion and may have originated near the center of the Milky Way. https://t.co/pSsNspXIMr https://t.co/S0Rlw3rHlX","date":"Wed May 04 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"CSAIL scientists have created a rapid design and fabrication tool to produce soft pneumatic actuators for integrated sensing. These devices are a critical backbone in applications such as assistive wearables, robotics, and rehabilitative technologies. https://t.co/ShkGHJlFyC https://t.co/85S7s3Tvsj","date":"Wed May 04 15:19:18 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"You never know who you're going to run into on campus. Happy Star Wars Day! #Maythe4thBeWithYou https://t.co/HFX7dmBPKu","date":"Wed May 04 13:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new heat engine with no moving parts is as efficient as a steam turbine: The design could someday enable a fully decarbonized power grid, researchers say. https://t.co/S2lg2ypvyJ https://t.co/V8KStc4Rz7","date":"Wed May 04 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A portable, solar-powered desalination device developed by MIT researchers can create potable drinking water with the push of a button. https://t.co/geDHpxRg7g","date":"Tue May 03 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A one-up on motion capture: A new neural network approach captures the characteristics of a physical system’s dynamic motion from video, regardless of rendering configuration or image differences. https://t.co/YHAlmNg1GV https://t.co/xht9FMHBio","date":"Tue May 03 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"As he pursues space research at MIT — and the dream of becoming an astronaut — Alvin Harvey SM ’20 also aims to advance Indigenous perspectives in space policy. https://t.co/X1V80BZUnX https://t.co/1NBNxSN0up","date":"Tue May 03 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT biological engineers have devised a way to perform large-scale screens of how T cells recognize specific pathogens. https://t.co/wcZh2PzXTE https://t.co/pQYdUM68FY","date":"Tue May 03 06:00:37 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Asst. Prof. Anna Stansbury discusses a new working paper she co-authored examining the lack of socioeconomic diversity in the field of economics. “Economists are really influencing policy and the public debate on all sorts of important subjects,” she says. https://t.co/ftpfDja3rr","date":"Mon May 02 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Search reveals eight new sources of black hole echoes: The findings will help scientists trace a black hole’s evolution as it feeds on stellar material. #BlackHoleWeek https://t.co/gBrcaasObQ https://t.co/rkWI4wHYFg","date":"Mon May 02 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"For decades, the dynamics of how and when a wave breaks have been too complex to predict. But now, mechanical engineers have found a new way to model how waves break, using machine learning along with data from wave-tank experiments. https://t.co/mt8teNSSXC https://t.co/AYj66EYcwN","date":"Mon May 02 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"#MIT2022 Graduates 📢","date":"Mon May 02 13:03:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"For individuals who communicate using a single switch, a new interface learns how they make selections, and then self-adjusts accordingly. https://t.co/Fd1Ezp1L8n https://t.co/uIC0Dezhxx","date":"Mon May 02 06:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Fighting discrimination in mortgage lending: A new technique for removing bias in datasets can enable machine-learning models to make loan approval predictions that are both fair and accurate. https://t.co/qlkmFpfXjN https://t.co/jMx5dFkJ4t","date":"Sun May 01 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Study reveals the dynamics of human milk production: A new analysis shows how milk-producing cells change over time in nursing mothers. https://t.co/jIqfViD5oc https://t.co/tyg2K1zGqx","date":"Sat Apr 30 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Does this artificial intelligence think like a human?: A new technique compares the reasoning of a machine-learning model to that of a human, so the user can see patterns in the model’s behavior. https://t.co/OdCqH6vBEH https://t.co/2FOHO26YuW","date":"Fri Apr 29 19:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers develop a paper-thin loudspeaker: The flexible, thin-film device has the potential to make any surface into a low-power, high-quality audio source. https://t.co/SLNbAAT7MO https://t.co/F5pCq9ydMi","date":"Fri Apr 29 18:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Institute Professor Robert Langer spoke at the 2022 Imagine Solutions Conference about applying his chemical engineering background to his research in the health sciences. https://t.co/lj9M61Wf8W","date":"Fri Apr 29 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Seven from MIT elected to American Academy of Arts and Sciences for 2022: Prestigious honor society announces more than 250 new members. https://t.co/62sHEK6VjZ https://t.co/YPkamwrImG","date":"Fri Apr 29 16:02:48 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Rise Bionics creates custom prosthetics and orthotics for patients in India, at a fraction of the cost of comparable devices. The goal: to make these devices “affordable and accessible to all,” says founder and MIT D-Lab Scale Ups Fellow Arun Cherian. https://t.co/kHVsMec8as https://t.co/Jv0k1GoHGm","date":"Fri Apr 29 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed an ultrathin speaker that can transform any rigid surface into an audio source. “The applications for the thin-film speaker material are endless.” https://t.co/BHOSu1CHXh","date":"Thu Apr 28 17:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Are supply chains stuck in detention?: Washington is recognizing that the American truck driver shortage might have been misdiagnosed. https://t.co/RMPPgRQlrf https://t.co/nIAK0JrPtM","date":"Thu Apr 28 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":".@RLEatMIT researchers have built a portable desalination unit that generates clear, clean drinking water without filters or high-pressure pumps. The suitcase-sized device requires less power than a cell phone charger and can run on a small solar panel. https://t.co/EXOqxrCRwM https://t.co/OG3f4Wjw7k","date":"Thu Apr 28 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Cheyenne Hua ’19 (seated) served as captain of MIT Motorsports during her time as an undergraduate. She now works at SpaceX as a structures engineer. https://t.co/20ZDtByFXN https://t.co/hhHJOLQYO9","date":"Thu Apr 28 06:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"How to weigh your options: In Killian Lecture, MIT’s Robert Merton explained the thinking behind his foundational finance work — and its applicability to everyday life. https://t.co/0Oy0GNVKK0 https://t.co/r3xJ708txk","date":"Wed Apr 27 17:52:56 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed an algorithm for identifying images that is a “vast improvement over the conventional method of ‘teaching’ an algorithm to spot and classify objects in pictures and videos.” https://t.co/30nvptcZOu","date":"Wed Apr 27 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"An easier way to teach robots new skills: Researchers have developed a technique that enables a robot to learn a new pick-and-place task with only a handful of human demonstrations. https://t.co/AgrYOFJVgW https://t.co/llFF3gC72p","date":"Wed Apr 27 16:03:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Converging trends have led to “an imbalance of power at work that needs to be addressed,” says Thomas Kochan. But a new social contract can guide companies to develop working models that deliver for shareholders, employees, and global communities. https://t.co/O9TDKEdsgK https://t.co/rIHSWi3Ugx","date":"Wed Apr 27 15:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Bloomberg News reporter Janet Wu speaks with President L. Rafael Reif and Special Presidential Envoy for Climate John Kerry during the Institute’s Climate Grand Challenges showcase event. via @business https://t.co/g39iAQ192z https://t.co/cKCaV3Dh4f","date":"Tue Apr 26 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“Visualizing the Proton” through animation and film: An art-science collaboration tests the limits of visual technologies. https://t.co/orZY7marB7 https://t.co/M2hidsnvnX","date":"Tue Apr 26 16:02:39 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new paper-thin loudspeaker can turn any surface into an active audio source. It produces sound with minimal distortion and weighs about as much as a dime. https://t.co/IvAVXuHGpz https://t.co/O3NT8vf667","date":"Tue Apr 26 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT Sloan Black Business Students Association launched a four-episode educational podcast series that tells the stories of four talented Black at Sloan students and alumni across the student journey, from application to the alumni experience. https://t.co/GkCRH0Apip https://t.co/zAvjpdhVUJ","date":"Tue Apr 26 06:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Lecturer Susan Murcott and graduate student Imane Ait Mbiriq discuss the MIT Climate Clock, a creation from the D-Lab that will be projected on the Green Building through May 27. https://t.co/UQik82M3dP","date":"Mon Apr 25 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"At Climate Grand Challenges showcase event, an exploration of how to accelerate breakthrough solutions: Special Presidential Envoy for Climate John Kerry calls the initiative “classic MIT.” https://t.co/cdwCnMYtsX https://t.co/wJbmqSyvMG","date":"Mon Apr 25 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chemistry PhD student Azin Saebi is developing tools to modify biomolecules — specifically proteins. In her future work, she says, “I want to be somewhere that I can see the impact of my work on patients’ lives and health care more immediately.” https://t.co/PEwTE3lgad https://t.co/WqmaWlrZ4O","date":"Mon Apr 25 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“Diverse people lead to diverse ideas:” As he works toward a career in aerospace engineering, senior Devin Johnson uplifts others along the way. https://t.co/Ts930tZJJD https://t.co/nsJEhop3GS","date":"Sun Apr 24 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT, SUNY, and RPI co-hosted a virtual workshop that gathered stakeholders from across the country to address the growing gap in the transition from lab to market for new semiconductor and microelectronics technology in the United States. https://t.co/jFaXvQrz5v https://t.co/sOuxWGP49c","date":"Sat Apr 23 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"We hope everyone is enjoying #EarthDay 🌍 🌱 https://t.co/OIRjqUbWOQ","date":"Fri Apr 22 19:01:11 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"James Arthur Jemison II MCP ’94 has been appointed Boston’s first planning chief by Boston Mayor Michelle Wu. “I’m incredibly grateful to Mayor Wu for the opportunity to bring my passion for equitable development back to Boston,” Jemison says. https://t.co/xQQ4kdqpKl","date":"Fri Apr 22 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Solving the challenges of robotic pizza-making: A new technique could enable a robot to manipulate squishy objects like pizza dough or soft materials like clothing. https://t.co/XQQLUmMpYL https://t.co/901WNun339","date":"Fri Apr 22 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"At Vicarious Surgical, Adam Sachs ’13 and Sammy Khalifa ’12 are developing small robots to make minimally invasive surgery available to more patients. https://t.co/tfoFyvpWJP https://t.co/rerr5nkIzY","date":"Fri Apr 22 15:02:39 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Fighting discrimination in mortgage lending: A new technique for removing bias in datasets can enable machine-learning models to make loan approval predictions that are both fair and accurate. https://t.co/sULz3PpilE https://t.co/OOEEyvCYty","date":"Fri Apr 22 13:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Alberto Rodriguez is a roboticist specializing in tactile sensing. https://t.co/MegNgIAsPq https://t.co/OmMtbaQABc","date":"Fri Apr 22 06:00:43 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new working paper by researchers from MIT and Yale finds that “80 percent of Americans think social media companies should take action to reduce the spread of misinformation,” reports Rachel Kraus for Mashable. https://t.co/eMNbNlSbPZ","date":"Thu Apr 21 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Global MIT launches the Africa Distinguished Visitors Program: The program’s inaugural honoree, Professor Mohamed H. A. Hassan, president of the World Academy of Sciences, recently visited MIT. https://t.co/518JzEgXtZ https://t.co/XoBJJpS41u","date":"Thu Apr 21 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new book examines how game-theory logic underpins many of our decisions. “Things that at first seem irrational, once you dig a little and think about what is being signaled, and ask the right questions, become a lot less puzzling,” Erez Yoeli says. https://t.co/uedORkyE4U https://t.co/8Ybp5FqKK8","date":"Thu Apr 21 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Empowering people to adapt on the frontlines of climate change: A new platform will unite climate models, impact predictions, random control trial evaluations, and humanitarian services to bring cutting-edge tools to Bangladeshi communities. https://t.co/lMykze2EUo https://t.co/JsO2p3Zlb4","date":"Thu Apr 21 13:10:12 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"@Oreo And a tasty one at that! 😋","date":"Wed Apr 20 20:17:56 +0000 2022","user_id":"15460048"},{"handle":"mit","text":".@MIT_AgeLab researchers are designing “prototypes of ‘smart homes’ for older residents, equipped with social robots, voice-activated speakers that give medication reminders, motion sensors embedded in carpets to detect falls, and intelligent doorbells.” https://t.co/X1mm1fPMds","date":"Wed Apr 20 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT engineers introduce the Oreometer: Mechanical engineers put an @Oreo’s cream filling through a battery of tests to understand what happens when two wafers are twisted apart. https://t.co/qKDmxP8qGy https://t.co/k9LQ54HwNf","date":"Wed Apr 20 16:02:47 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Canan Dagdeviren and her team work to develop “mechanically adaptive” electronics that can flex and fit with any surface of the body, inside or out. https://t.co/N7ekXi8H3V https://t.co/yeGWkG97y6","date":"Wed Apr 20 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"An early diagnosis sparks a lifelong interest in science and medicine: Senior Isha Mehrotra works to discover more about autoimmune diseases, aiming for a future in which patients can be treated effectively or avoid the conditions altogether. https://t.co/RwRl6yl34F https://t.co/4SKQnKJlkz","date":"Wed Apr 20 06:00:40 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Using plant biology to address climate change: A Climate Grand Challenges flagship project aims to reduce agriculture-driven emissions while making food crop plants heartier and more nutritious. https://t.co/18EUTvLi6j https://t.co/bM04r1qm2w","date":"Tue Apr 19 19:40:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT students 📢","date":"Tue Apr 19 18:05:28 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Antoinette Schoar and University of Chicago Professor Steven Kaplan developed a public-market-equivalent (PME) method known as the Kaplan-Schoar approach to compare fund performance with stock market benchmarks. https://t.co/GUw8yMTA5r","date":"Tue Apr 19 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT students Bhav Jain and Liberty Ladd named 2022 Truman Scholars: Fellowship provides funding for graduate school and recognizes future public service leaders. https://t.co/4W0XQgiFUR https://t.co/sJLN4aDvzA","date":"Tue Apr 19 16:02:42 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“To create more equal societies in the present, we need to create more equality for other places and other pasts — and learn from all the riches and lessons they have to offer,” says Wiebke Denecke, who advocates a broad view of the humanities. https://t.co/CGS8oLb7rw https://t.co/TU1Edc5CVU","date":"Tue Apr 19 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Good luck to all #BostonMarathon runners! May your feet carry you swiftly through every smoot. 👏 https://t.co/M2Lj6YrvCM","date":"Mon Apr 18 13:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The MIT Caving Club teaches students and campus community members the basics of vertical caving. They meet twice a month in the stairwells of MIT with the aim of taking their stairwell rappelling skills into actual caves.\n\nVideo: Christopher Harting for MIT News https://t.co/SVttp47Tex","date":"Sun Apr 17 14:01:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Advocating for vaccine equity: Postdoc Digbijay Mahat became a cancer researcher to improve health care in Nepal, but the Covid-19 pandemic exposed additional resource disparities. https://t.co/l12YgNK3Nd https://t.co/MDk10egqdt","date":"Sat Apr 16 14:01:38 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Looking forward to forecast the risks of a changing climate: To better inform local policy in the face of changing weather extremes, MIT researchers seek to advance the modeling of long-term weather risks. https://t.co/OAb0bmNegS https://t.co/ahL3d8RZTo","date":"Fri Apr 15 17:52:10 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A team of researchers from MIT and the National Renewable Energy Laboratory successfully reached a 30% jump in thermophotovoltaic (TPV) efficiency. “[TPV] is a semiconductor structure that concerts photons emitted from a heat source to electricity.” https://t.co/kFL5QeQwwV https://t.co/cO8fBpsuvE","date":"Fri Apr 15 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Assisted by a team of SERC Scholars, students in one of MIT’s largest machine-learning courses now study both the ethical and technical dimensions of computing. “Let’s build up that muscle of being able to pause and ask tough questions,” says David Kaiser. https://t.co/Tt20RBfrXQ https://t.co/ICfkOvvLHK","date":"Fri Apr 15 15:05:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers designed this quipu-inspired device that can be used to measure pressure inside the digestive tract and diagnose a variety of gastrointestinal disorders. https://t.co/ExJNsCEiSP https://t.co/OSKTG1v4Ms","date":"Fri Apr 15 06:00:39 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Developing electricity-powered, low-emissions alternatives to carbon-intensive industrial processes: The Center for Electrification and Decarbonization of Industry unites MIT climate researchers to create scalable clean energy solutions under one roof. https://t.co/V0squgFH3K https://t.co/3A5Ysc3C9Y","date":"Thu Apr 14 20:40:37 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT announced five projects “targeting the world's toughest climate riddles” that were selected as part of the Institute’s Climate Grand Challenges following a rigorous two-year competition. via @BosBizJournal https://t.co/aTVFcG9PFR https://t.co/3i8qQihK4j","date":"Thu Apr 14 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Joystick-operated robot could help surgeons treat stroke remotely: The system could provide teleoperated endovascular treatment to patients during the critical time window after a stroke begins. https://t.co/4v7CKTYoCa https://t.co/N2kRuEpjPr","date":"Thu Apr 14 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Engineers have designed a heat engine with no moving parts that converts heat to electricity with over 40 percent efficiency — better than that of traditional steam turbines. The design could someday enable a fully decarbonized power grid, they say. https://t.co/S2lg2ypvyJ https://t.co/wz89tNfRII","date":"Thu Apr 14 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Could we make cars out of petroleum residue?: A new way to make carbon fiber could turn refinery byproducts into high-value, ultralight structural materials for cars, aircraft, and spacecraft. https://t.co/S4yvxhHLYI https://t.co/HLDwKKylbK","date":"Thu Apr 14 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Engineered bacteria could help protect “good” gut microbes from antibiotics: Microbes that safely break down antibiotics could prevent opportunistic infections and reduce the spread of antibiotic resistance. https://t.co/Tyb8crMKHZ https://t.co/TfMekNZctw","date":"Wed Apr 13 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Computing our climate future: To put global climate modeling at the fingertips of local decision-makers, some scientists think it’s time to rethink the system from scratch. https://t.co/AMUJmXvu8U https://t.co/XwQzNGpS8J","date":"Wed Apr 13 16:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Embracing ancient materials and 21st-century challenges: An early interest in archaeology led senior Sophia Mittman to explore many facets of materials science, from restoring artwork to making mining more sustainable. https://t.co/TtmutJfFI2 https://t.co/0avKkdfKPk","date":"Wed Apr 13 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"By day, AeroAstro grad student Evan Kramer works on a new concept for a space telescope. By night, he points his cameras at the sky to uncover the beauty of the cosmos.\n\nVideo: Melanie Gonick/MIT https://t.co/gg9tL2xqjH","date":"Wed Apr 13 07:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“You may never have had a chance to actually deploy your research on the International Space Station,” says Ariel Ekblaw, dir. of the MIT Space Exploration Initiative. “But now, we might do three or four missions to the ISS within that time.” https://t.co/HO3DfSBb1D","date":"Tue Apr 12 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Bringing together the next generation of quantum coders: MIT iQuHACK gave teams from across the country time and experience on real quantum computers. https://t.co/gIfwdl9B5D https://t.co/04xatgX6iz","date":"Tue Apr 12 16:02:30 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New tool reveals how immune cells find their targets: MIT biological engineers have developed a simple way to identify B or T cells that interact with viral or bacterial proteins. https://t.co/wcZh2PzXTE https://t.co/hUpYqvxRbw","date":"Tue Apr 12 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Five newly announced flagship projects will drive the MIT Climate Grand Challenges research program, “a whole-of-MIT drive to develop game-changing advances to confront the escalating climate crisis, in time to make a difference,” says President Reif. https://t.co/M012DdVzYG","date":"Tue Apr 12 13:48:21 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Reversing hearing loss with regenerative therapy: MIT spinout Frequency Therapeutics’ drug candidate stimulates the growth of hair cells in the inner ear. https://t.co/LN8Te0C5zq https://t.co/WGpDnFcHgu","date":"Tue Apr 12 07:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT announces five flagship projects in first-ever Climate Grand Challenges competition: The portfolio of multiyear projects focuses on delivering breakthrough solutions. https://t.co/WaLLermIRY https://t.co/AuRUgtDlVF","date":"Mon Apr 11 19:18:56 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The MIT AI Hardware Program seeks to bring together researchers from academia and industry to “examine each step of designing and manufacturing the hardware behind AI-powered technologies.” https://t.co/jZ2kAA89ix https://t.co/uSxSXZCr0c","date":"Mon Apr 11 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New England renewables + Canadian hydropower: Power flowing both ways across the border offers a pathway to clean electricity in 2050. https://t.co/cmxWPFcSa3 https://t.co/336vhZJiMe","date":"Mon Apr 11 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT architecture students and alumni entered a competition to develop a sustainable structure in a remote Nevada desert. Their winning design envisions an architecture centered not only on human needs, but also those of the broader ecosystem. https://t.co/tCCpEFPvFq https://t.co/EF7ShucOKR","date":"Mon Apr 11 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Learning to fly: Veteran and PhD student Andrea Henshall has used MIT Open Learning to soar from the Air Force to multiple aeronautics degrees. https://t.co/DTGVSB80tu https://t.co/8afxEPxoJF","date":"Sun Apr 10 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT has been ranked as the No. 1 university in the world by QS World University Rankings for 10 straight years. https://t.co/ogLMBIlCUZ https://t.co/nswZYzYeJ6","date":"Sat Apr 09 15:01:20 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chiamaka Agbasi-Porter, K-12 STEM outreach coordinator at MIT Lincoln Lab, discusses her work aimed at inspiring young people to pursue STEM interests through the Lincoln Laboratory Radar Introduction for Student Engineers (LLRISE) program. https://t.co/GbzyWaRyAr","date":"Fri Apr 08 18:01:33 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Climate Grand Challenges finalists on using data and science to forecast climate-related risk: Faculty leaders highlight innovations that can close longstanding knowledge gaps and reimagine how the world responds to the climate crisis. https://t.co/5R1DI3bHBS https://t.co/mgVWXhpSkL","date":"Fri Apr 08 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Roots Studio, founded by Rebecca Hui SM ’17, helps rural communities license their art to brands around the world. As a result, endangered heritage art has been adapted onto clothes, backpacks, and more, with artists collecting royalties on every sale.\nhttps://t.co/7gnXRenQ27 https://t.co/gvLAcVMbvW","date":"Fri Apr 08 15:13:34 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Physicists in the MIT-Harvard Center for Ultracold Atoms (CUA) have developed a new approach to control the outcome of chemical reactions. https://t.co/6a9T0K1eSS https://t.co/VPIu8rMoh7","date":"Fri Apr 08 07:13:34 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New research by Professor Erik Demaine, lecturer Zachary Abel, robotics engineer Martin Demaine and their colleagues explores whether it is possible to “take any polyhedral (or flat-sided) shape that’s finite and fold it flat using creases.”  https://t.co/eKz2t2V4Tu","date":"Thu Apr 07 17:02:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Letter regarding graduate student unionization election: Melissa Nobles and Ian Waitz write to share the results of an independent unionization election held on MIT’s campus. https://t.co/F3sWzFpj9I https://t.co/K8aSfkHfSI","date":"Thu Apr 07 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers have performed the first large-scale study of the cells in breast milk, allowing them to track how these cells change over time in nursing mothers. The findings may someday inform efforts to boost milk production or improve infant formula. https://t.co/jIqfViD5oc https://t.co/ffgjoLulNs","date":"Thu Apr 07 15:05:09 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"We're partial to beavers here at MIT. 😄  #InternationalBeaverDay https://t.co/NNRjVotgXI","date":"Thu Apr 07 13:26:50 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Caption:Around 2.3 billion years ago, oxygen began building up in the atmosphere, eventually reaching the life-sustaining levels we breathe today. A new hypothesis proposed by MIT scientists suggests a mechanism for how this may have happened. https://t.co/oujR2znyGc https://t.co/FeZt3eH6UR","date":"Thu Apr 07 07:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"@MITGradUnion We congratulate the members of the MIT GSU on their dedicated work that led to this election. MIT’s representatives expect to meet with MIT GSU and UE leaders to begin good-faith negotiations over the terms and conditions of employment for the members of this bargaining unit.","date":"Wed Apr 06 17:53:58 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers and two high school seniors have developed DualFair, a new technique for removing bias from mortgage lending datasets. https://t.co/BkvF5Np233","date":"Wed Apr 06 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"QS World University Rankings rates MIT No. 1 in 12 subjects for 2022: The Institute also ranks second in two subject areas. https://t.co/ogLMBIlCUZ https://t.co/p39ZqOJ8XY","date":"Wed Apr 06 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new technique compares the reasoning of a machine-learning model to that of a human. This information can help users — such as a doctor using AI to analyze medical images — decide whether the model is trustworthy. https://t.co/OdCqH6vBEH https://t.co/5c3yRdsyWx","date":"Wed Apr 06 15:02:30 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chiamaka Agbasi-Porter: Inspiring futures in STEM: Lincoln Laboratory's K–12 outreach coordinator opens doors to opportunities and instills lasting confidence in students. https://t.co/iaXW2bael1 https://t.co/i02byBPWKg","date":"Wed Apr 06 13:38:37 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Research Experience in Biopharma, a for-credit class provides late-stage doctoral students with hands-on experience in the biopharma industry. https://t.co/Et5Lqqxp3k https://t.co/gr31aORbsj","date":"Wed Apr 06 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“If each of those cubes can pivot with respect to their neighbors you can actually reconfigure your first 3D structure into any other arbitrary 3D structure,” explains graduate student Martin Nisser. https://t.co/RjwHUtUSUt","date":"Tue Apr 05 17:07:56 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"At MIT, women take the lead on student teams: Women strengthen MIT Edgerton Center rocketry, motorsports, and solar vehicle teams with diverse perspectives. https://t.co/20ZDtByFXN https://t.co/S2yNPrzlDh","date":"Tue Apr 05 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new system makes it easier for severely motor-impaired individuals who communicate using a single switch to select letters or words from an interface. The technology is more flexible than other options and could be also used for tasks like drawing. https://t.co/5fsGmQnG7n https://t.co/xjhdySAeTx","date":"Tue Apr 05 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT Morningside Academy for Design created as a new hub for cross-disciplinary education, research, and innovation: Supported by a $100 million founding gift, the academy will deepen the integration of design across the Institute and beyond. https://t.co/GLfe1FgVaB https://t.co/uMe1OLfBcN","date":"Tue Apr 05 07:01:18 +0000 2022","user_id":"15460048"},{"handle":"mit","text":".@MIT_CSAIL researchers developed a system that could enable robots to handle squishy objects like pizza dough. https://t.co/el8sXKrfGP","date":"Mon Apr 04 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Kickback Series: A Black at MIT Sloan experience: MIT Sloan Black Business Students Association (BBSA) launches a four-part podcast series chronicling the stories of four Black at Sloan students and alumni.\nhttps://t.co/veXBxOAVdn https://t.co/COOmxXrWC5","date":"Mon Apr 04 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Dan Huttenlocher, inaugural dean of the MIT Schwarzman College of Computing, works to bring disciplines together in the advancement of computing. Social impacts and ethical implications “need to be considered from the very beginning,\" he says. https://t.co/PRa0I3g7By https://t.co/JGAVBGPcmP","date":"Mon Apr 04 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers created a tool that enables people to make highly accurate predictions using multiple time-series data with just a few keystrokes. https://t.co/fhwQVq9eJg https://t.co/OTgwXhmZsg","date":"Sun Apr 03 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT’s graduate program in engineering has again earned a No. 1 spot in U.S. News and Word Report’s annual rankings, a place it has held since 1990, when the magazine first ranked such programs. https://t.co/Y3rn72g0Dg https://t.co/Ilj9KKVJpv","date":"Sat Apr 02 15:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new book by Professor Andrew Lo and Professor Stephen Foerster of the University of Western Ontario, “provides historical perspective on the development of modern investment theory and practice.” https://t.co/4Bkk53Xcy5","date":"Fri Apr 01 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"How molecular biology could reduce global food insecurity: Mary Gehring is using her background in plant epigenetics to grow climate-resilient crops. https://t.co/HeHLsZ4KtV https://t.co/51RMXYWnBY","date":"Fri Apr 01 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Working toward an aerospace engineering career, senior Devin Johnson uplifts others along the way. “I care a lot about the community that I'm in and the people that I'm around.” he says. https://t.co/Ts930tZJJD https://t.co/BZHofXfEnT","date":"Fri Apr 01 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New maps show airplane contrails over the U.S. dropped steeply in 2020: The computer-vision technique behind these maps could help avoid contrail production, reducing aviation’s climate impact. https://t.co/qfwiUjvV7f https://t.co/jDg4OCbekc","date":"Fri Apr 01 07:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Alex Bergan PhD ’17 and Greg Horning PhD ’17 have opened Aquatic Brewing Co., a brewing co. and restaurant in Falmouth, Mass. “Whatever you get is going to be good, it’s going to be fresh, and I think that’s what makes our place special,” says Bergan. https://t.co/pQB59xEAKg","date":"Thu Mar 31 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Workshop tackles a critical gap slowing the development of new hardware technologies: MIT, RPI, and SUNY convene a national conversation on semiconductor tech translation and hard-tech startups. https://t.co/jFaXvQrz5v https://t.co/GInfqgrtV9","date":"Thu Mar 31 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New research can help a robot manipulate deformable objects like pizza dough to execute tasks that require many tools and take a long time to complete. “Our framework provides a novel way for robots to acquire new skills,” says Xingyu Lin. https://t.co/KCNusd4UBm https://t.co/avUnutJlCH","date":"Thu Mar 31 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Anne White @anne_wave, head of @mit_nse and an expert in nuclear fusion, is featured in Science World magazine highlighting groundbreaking contributions of women in science. https://t.co/auN9CI1znd https://t.co/ODiPVgMCv5","date":"Thu Mar 31 06:00:33 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Yossi Sheffi explains that increasing customer demand is the driving force behind supply chain bottlenecks impacting the global delivery network. https://t.co/nAz2ewXtrs","date":"Wed Mar 30 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Alberto Rodriguez on teaching a robot to find your keys: Associate professor and principal investigator with the MIT Schwarzman College of Computing’s Science Hub discusses the future of robotics and the importance of industry-academia collaborations. https://t.co/MegNgIAsPq https://t.co/kpjXf2DiIT","date":"Wed Mar 30 16:02:17 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"When racial biases bleed into machine-learning models used by mortgage lenders, it can have far-reaching consequences. A new method removes bias in the datasets used to train these models, to enable loan-approval predictions that are more fair. https://t.co/qlkmFpfXjN https://t.co/bKJENP8eY2","date":"Wed Mar 30 15:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Yen-Jie Lee probes particle collision data for clues to the universe’s origins: The excitement of making discoveries on the global stage is “so much bigger than the pressure,” says the particle physicist. https://t.co/dOqVP9dYeD https://t.co/zhMcmQYyWR","date":"Wed Mar 30 07:00:57 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed a simulation of the early universe, shedding light onto the period when the first stars were formed. https://t.co/IBgHVISwmx","date":"Tue Mar 29 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT graduate engineering, business, economics programs ranked highly by U.S. News for 2022: Graduate engineering and economics programs are No. 1 in the nation; MIT Sloan is No. 5. https://t.co/Y3rn72g0Dg https://t.co/RI8RUBIBAp","date":"Tue Mar 29 16:02:12 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT spinout @frequencytx is seeking to reverse hearing loss — not with hearing aids or implants, but with a new kind of regenerative therapy. The method, now in clinical trials, uses small molecules to stimulate the growth of hair cells in the inner ear. https://t.co/LN8Te0C5zq https://t.co/UTmFq7sdgc","date":"Tue Mar 29 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"These discs were used for testing the researchers’ processing method for solid-electrolyte batteries. https://t.co/oRMvUnntWL https://t.co/E9jmJOjIef","date":"Tue Mar 29 07:00:53 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Associate Professor Ruonan Han and Professor Qing Hu discuss their research with terahertz waves. “There’s a laundry list of potential applications,” says Hu of their promise. https://t.co/FdWLGTnHfF","date":"Mon Mar 28 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Climate Grand Challenges finalists on new pathways to decarbonizing industry: Faculty leaders detail promising technologies, materials, and methods that could help unlock a low-carbon future in sectors where emissions are hardest to cut. https://t.co/JnfBA5SOnU https://t.co/NTLF0Lg8fl","date":"Mon Mar 28 16:02:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A tool for predicting the future: Researchers design a user-friendly interface that helps nonexperts make forecasts using data collected over time. https://t.co/1PtrcOXvCm https://t.co/yohAANJVWj","date":"Mon Mar 28 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The 2022-23 undergraduate financial aid program will include enhancements to make MIT tuition-free for families who have typical assets and whose incomes are below $140,000. https://t.co/mJd5b6Yik6 https://t.co/q3KXcGFX0q","date":"Mon Mar 28 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The MIT Caving Club teaches students and campus community members the basics of vertical caving. They meet twice a month in the stairwells of MIT with the aim of taking their stairwell rappelling skills into actual caves.\n\nVideo: Christopher Harting for MIT News https://t.co/OOC63qZXFh","date":"Sun Mar 27 15:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT’s mini cheetah, using a model-free reinforcement learning system, broke the record for the fastest run recorded. https://t.co/zFlXbfkkR9 https://t.co/7VYIx1CHvc","date":"Sat Mar 26 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"With masking and distancing in place, NFL stadium openings in 2020 had no impact on local Covid-19 infections: The findings may inform decisions on holding large outdoor gatherings amid future public health crises. https://t.co/zrRxBOTZBo https://t.co/Ol5yEWYH40","date":"Fri Mar 25 16:02:23 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Senior Isha Mehrotra was diagnosed with celiac disease at a young age. Today, she studies autoimmune disorders, seeking a future in which patients can be treated effectively or avoid the conditions altogether.\nhttps://t.co/RwRl6yl34F https://t.co/jYIp5qxEzw","date":"Fri Mar 25 15:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have developed a technique that induces fairness directly into the model, no matter how unbalanced the training dataset was, which can boost the model’s performance on downstream tasks. https://t.co/0FPJ3Oy1yw https://t.co/XgYGxYwoOe","date":"Fri Mar 25 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A simple diagnostic tool for gastrointestinal disorders: Inspired by an ancient technology, engineers design a sensor that can measure pressure inside the digestive tract. https://t.co/rlm0VBdyk1 https://t.co/JnfSmx3NDi","date":"Thu Mar 24 16:02:18 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"By day, AeroAstro grad student Evan Kramer works on a new concept for a space telescope. By night, he points his cameras at the sky to uncover the beauty of the cosmos.\n\nVideo: Melanie Gonick/MIT https://t.co/i881Fc69FU","date":"Thu Mar 24 15:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"How a Vision for a Solar Car Sparked a Career — and MIT’s Solar Electric Vehicle Team. https://t.co/ihWUc877fu https://t.co/R94WtjEMvg","date":"Thu Mar 24 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed a way to create carbon fibers that are stronger and lighter than steel, using leftover waste from crude oil processing. “The new findings could usher in an age of heavy-duty cars that consume less fuel ...” https://t.co/F3UyvlF5Dq","date":"Wed Mar 23 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"You can watch and cheer on @nadege_aoki, an @eapsMIT @WHOI PhD student, tonight on Jeopardy! Good luck, Nadège! https://t.co/m1e0TOHWTp","date":"Wed Mar 23 17:22:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"This #NationalPuppyDay we celebrate the beloved pooches of MIT. 😍 https://t.co/d9o1zWQoiY","date":"Wed Mar 23 16:15:50 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The MIT campus is built to connect people. But a study comparing researchers’ email traffic and their physical proximity reveals that some places are better than others at sparking communication. (Hint: Eateries help.) https://t.co/42S7GedlZa https://t.co/XY9AGbSHyM","date":"Wed Mar 23 15:02:31 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"People from across MIT gathered outside the Student Center on March 3 for a candlelight rally to support MIT’s Ukrainian community and condemn attacks on Ukraine by Russian forces. https://t.co/msrtWYsM7L https://t.co/Ym9NPrfjvO","date":"Wed Mar 23 07:00:29 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"How the MIT mini cheetah learns to run: CSAIL scientists came up with a learning pipeline for the four-legged robot that learns to run entirely by trial and error in simulation. https://t.co/zFlXbfkkR9 https://t.co/FYIoH6qA6S","date":"Tue Mar 22 16:02:10 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Yukiko Yamashita has spent much of her career exploring how asymmetrical cell divisions occur, producing one differentiated cell along with another stem cell. Her research has shed light on the immortality of germline cells and the function of “junk DNA.” https://t.co/KyZgMr8nZu https://t.co/tao8fISkvb","date":"Tue Mar 22 15:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Finding joy through art and advocacy: Senior Tanner Bonner creates connections across MIT to give voice to first-generation and low-income students. https://t.co/F3CKnMJiSs https://t.co/M6WuTO3Zux","date":"Tue Mar 22 07:00:27 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Climate Grand Challenges finalists on accelerating reductions in global greenhouse gas emissions: Faculty leaders describe their efforts to develop potentially game-changing tools. https://t.co/Lc6D57Uwnb https://t.co/fCsj3TjY69","date":"Mon Mar 21 20:18:27 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Agustín Rayo, dean of the School of Humanities, Arts, and Social Sciences, discusses his goals, the importance of SHASS subjects, and his plans for advancing the school’s DEI efforts. https://t.co/SBnWbJ4Pb2","date":"Mon Mar 21 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Congrats to Raja Chari SM ’01 for completing his first spacewalk!","date":"Mon Mar 21 17:31:12 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Pandemic mood: Much worse than a bad Monday: Study uses social media to measure how much sentiment has been affected by the Covid-19 crisis, worldwide. https://t.co/KofHL8QvKu https://t.co/eO3TemSan6","date":"Mon Mar 21 16:02:12 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new method turns byproducts from petroleum refining into lightweight carbon fiber. This material has compressional strength, so it could be useful for load-bearing applications, such as in cars, aircraft, or spacecraft. https://t.co/S4yvxhHLYI https://t.co/04T0XjThKw","date":"Mon Mar 21 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Study reveals chemical link between wildfire smoke and ozone depletion: If wildfires become larger and more frequent, they might stall ozone recovery for years. https://t.co/NfvIqnMZaJ https://t.co/OcaEM2JQ5N","date":"Mon Mar 21 07:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"How to clean solar panels without water: A new cleaning method could remove dust on solar installations in water-limited regions, improving overall efficiency. https://t.co/76bfTtNXPi\n\nVideo: Melanie Gonick/MIT https://t.co/DLqakCTTYR","date":"Sun Mar 20 14:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"For the second time in the history of the annual William Lowell Putnam Mathematical Competition, all five of the top spots in the contest, known as Putnam Fellows, came from a single school — MIT. https://t.co/8zVRsr0VVD https://t.co/dCbPVnoMLD","date":"Sat Mar 19 15:01:33 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT recently announced the creation of a new multidisciplinary center, Morningside Academy for Design, that aims to serve as a “focal point for design research, education, and entrepreneurship.” https://t.co/WMRKL8L5l0","date":"Fri Mar 18 17:02:21 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT announces increase to undergraduate financial aid for 2022–23 academic year: Financial aid support remains strong, and free tuition guarantee is increased. https://t.co/RFbNfclmqM https://t.co/v1HlzdLDlZ","date":"Fri Mar 18 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Postdoc Digbijay Mahat became a cancer researcher to improve health care in Nepal. But when the Covid-19 pandemic exposed a new level of resource disparities, he leapt in to help his homeland navigate Covid testing and vaccine rollouts. https://t.co/l12YgNK3Nd https://t.co/g0bx9TcdOq","date":"Fri Mar 18 15:02:43 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Bridging the worlds of research and industry: PhD student Nidhi Juthani has built a deep foundation in science to inform a career in the private sector. https://t.co/4jZs0uo3KW https://t.co/QQYCexRKnb","date":"Fri Mar 18 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Sculptor Matthew Angelo Harrison and artist Raymond Boisjoly will both have art installations on display at the MIT List Visual Center for the Arts this upcoming spring. https://t.co/g2eg6puRv2","date":"Thu Mar 17 17:02:33 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Historic entrepreneurship course shows no signs of slowing down: New Enterprises, possibly the oldest entrepreneurship course in the country, has made its mark throughout the greater Boston community. https://t.co/BzLPHMV2Y0 https://t.co/VMgvETFnqG","date":"Thu Mar 17 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Having trouble hearing? Just turn up your shirt. That’s the idea behind a new “acoustic fabric,” inspired by the human ear, that converts sounds into electrical signals. The fabric can capture sounds ranging from a quiet library to heavy traffic. https://t.co/ymbQ5jzOZA https://t.co/q0jde4Z4Mh","date":"Thu Mar 17 15:05:11 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"☘️ Happy St. Patrick's Day! https://t.co/2e8eIVZuTs","date":"Thu Mar 17 14:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Institute Professor Robert Langer, whose “innovations have helped create more than 100 products from artificial skin to messenger RNA vaccines,” discusses the inspiration for his work and offers advice to young people interested in an engineering career. https://t.co/Tmi4WtRz3h","date":"Wed Mar 16 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Microbes and minerals may have set off Earth’s oxygenation: Scientists propose a new mechanism by which oxygen may have first built up in the atmosphere. https://t.co/bJLACHcg3f https://t.co/CKBDFQsjTo","date":"Wed Mar 16 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Veteran and PhD student Andrea Henshall has used MIT Open Learning to soar from the Air Force to multiple aeronautics degrees. “My trajectory would be so different if MITx and OCW didn’t exist,” she says. “MIT was the first and it’s still the best.” https://t.co/4bcD24FCKp https://t.co/ddV0HNmpdG","date":"Wed Mar 16 15:03:35 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Training STEM teachers to uncover students’ full potential: The Practical Education Network cultivates a version of MIT’s hands-on teaching methodology in low-resource communities. https://t.co/PwmNkg2yE5 https://t.co/EIoFacfvpr","date":"Wed Mar 16 07:00:30 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed a technique that uses static electricity to remove dust from solar panels, which could save some 45 billion liters of water annually. https://t.co/YN640ahdFB","date":"Tue Mar 15 17:02:09 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Physicists steer chemical reactions by magnetic fields and quantum interference: New research provides insights into how quantum mechanics can control ultracold chemistry. https://t.co/wLraKx21At https://t.co/q3Ql0ClXMC","date":"Tue Mar 15 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT has created the Morningside Academy for Design, a major interdisciplinary center for education, research, thinking, and entrepreneurship, which will amplify the Institute’s strengths in design-focused work. https://t.co/GLfe1FgVaB https://t.co/lyrZaIr3Pt","date":"Tue Mar 15 15:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"As students code, experiment, and build systems, being able to ask questions and make sense of hard problems involving social and ethical responsibility is as important as the technology they’re studying and developing. https://t.co/Y3ymMk7lRy https://t.co/HeiXF7z9wO","date":"Tue Mar 15 07:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT Regular Action decisions for the class of #MIT2026 are now available. Best of luck!\n\nWritten, directed, and animated by Angela ’24, Emily ’22, and Audrey ’24. Music by Karthik ’22.\nWatch the entire video: https://t.co/vQXSOvYmQ8 https://t.co/HqdyWdG1ld","date":"Mon Mar 14 22:28:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Jonathan Gruber discusses the economics of sanctions and whether they have been an effective tool to deter Russia. “The integrated world economy has made these sanctions so much more powerful,” says Gruber. https://t.co/u3TdLSGpe8","date":"Mon Mar 14 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"https://t.co/aPnsy9rGvp https://t.co/4yaFJ5z8qW","date":"Mon Mar 14 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Mechanical engineers have devised a way to automatically clean solar panels using a waterless, no-contact system. Their method could benefit solar arrays in desert areas, where dust accumulations can reduce output by 30 percent in just one month. https://t.co/76bfTu5zdS https://t.co/ACgOeh7cHq","date":"Mon Mar 14 15:03:31 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Happy birthday, Albert Einstein! You had us at E = mc².\n\nAnimation: Jose-Luis Olivares/MIT https://t.co/oA7WGqzVJh","date":"Mon Mar 14 14:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"It's one of our favorite days of the year. Happy #PiDay, everyone!\n\nimage: Jose-Luis Olivares/MIT https://t.co/E5rbKxIlBT","date":"Mon Mar 14 13:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Using nature’s structures in wooden buildings: A new approach enables architects to use discarded tree forks as load-bearing joints in their structures. https://t.co/Qp2CcpYbQL https://t.co/tOClgUJItv","date":"Mon Mar 14 07:00:30 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Nurturing human communities and natural ecosystems: Senior Heidi Li strives to help local communities understand how they can influence policymaking to achieve a more sustainable future. https://t.co/S5CEgjoI8T https://t.co/fM93pf0u7F","date":"Sun Mar 13 15:01:20 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"This winter, seven new faculty members join the MIT School of Science in the departments of Biology and Brain and Cognitive Sciences. https://t.co/PzAhsCW1SP https://t.co/PJCcJJZxCG","date":"Sat Mar 12 16:01:51 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Research Fellow Maham Javaid writes about the impact TikTok has played in the Russian invasion of Ukraine. “TikTok is undoubtedly playing multiple roles in this war,” writes Javaid. https://t.co/2NkgcOm4wQ","date":"Fri Mar 11 18:02:35 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"From bench to biotech: Life sciences class brings biotech industry experience into the classroom with part-time internships for graduate students. https://t.co/Haqih0tAtJ https://t.co/KNzwCJb2RV","date":"Fri Mar 11 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Yen-Jie Lee probes particle collision data for clues to the universe’s origins. Analyzing highly anticipated results can be intense, but the excitement of making discoveries on the global stage is “so much bigger than the pressure,” he says. https://t.co/fQCLHOEMnn https://t.co/wdiNzAFE1p","date":"Fri Mar 11 16:03:14 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A life-changing fertilizer for rural farmers in Kenya: MIT spinout Safi Organics uses farmers’ crop residue to make an organic fertilizer that can increase yields and improve soil health. https://t.co/TyD4r7kCU3 https://t.co/Eq7aVxkNHy","date":"Fri Mar 11 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Ngozi Okonjo-Iweala to speak at MIT’s 2022 Commencement: Director-General of the World Trade Organization and MIT alumna will address the Class of 2022 on May 27. https://t.co/xdG8cmTiXv https://t.co/1Hhlq19MuT","date":"Thu Mar 10 20:29:22 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Anne White @anne_wave, head of @mit_nse and an expert in nuclear fusion, is featured in Science World magazine highlighting groundbreaking contributions of women in science. #WHM https://t.co/auN9CI1znd https://t.co/A9cPU88Q0m","date":"Thu Mar 10 18:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Toward batteries that pack twice as much energy per pound: A method for stabilizing the interfaces in solid-state lithium-ion batteries opens new possibilities. https://t.co/mj1XWIlyBJ https://t.co/BkfxdDcRrn","date":"Thu Mar 10 17:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"An impromptu conversation with Professor Harold “Doc” Edgerton led to an offer of lab space where James Worden ’89 developed a race-ready solar car with help from friends and collaborators. From there, the popular Solar Electric Vehicle Team was born. https://t.co/yXyjfbekQN https://t.co/1IPVFIRyRu","date":"Thu Mar 10 16:03:16 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Good luck, everyone with today's #MIT24 Hour Challenge!","date":"Thu Mar 10 14:36:22 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"An explorer in the sprawling universe of possible chemical combinations: Heather Kulik embraces computer models as “the only way to make a dent” in the vast number of potential materials that could solve important problems. https://t.co/VQ6Fp6JnNG https://t.co/hpMDS31H9J","date":"Thu Mar 10 08:00:59 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The Climate Grand Challenges competition launched in July 2020 with the goal of mobilizing the entire MIT research community around transformative projects that have the potential to make major advances in effective global climate response. https://t.co/voNq3KVK9i https://t.co/r24kLokZqy","date":"Thu Mar 10 08:00:57 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT community stands with Ukraine at candlelight rally: Hundreds gather in solidarity with MIT’s Ukrainian community while MIT offers support. https://t.co/sEMiuMGGAi https://t.co/MMtkJ9E8AZ","date":"Wed Mar 09 21:24:58 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Popular Science reporter Tatyana Woodall writes that @MIT_CSAIL researchers have developed electromagnetic bot blocks that can reconfigure into various shapes and could potentially help astronauts build in space. https://t.co/b3L4MPf5d4","date":"Wed Mar 09 18:02:44 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Understanding the war in Ukraine: At a recent seminar, MIT faculty analyzed Russia's invasion of Ukraine. https://t.co/f3WmSnijeq https://t.co/uD5c9d4cur","date":"Wed Mar 09 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Caitlin Mueller’s group is developing a strategy for “upcycling” discarded tree forks to use as structural components in construction. “The greatest value you can give to a material is to give it a load-bearing role in a structure,” she says. https://t.co/OMZdiAxPQt https://t.co/0IAjMJJnNb","date":"Wed Mar 09 16:03:08 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT and Harvard University scientists recently conducted the largest-ever brain imaging study to evaluate the relationship between white matter brain structure and reading ability. https://t.co/z9NlSBCvC3 https://t.co/MlyvwYcp2N","date":"Wed Mar 09 08:00:57 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"In celebration of International Women's Day here is a look at 10 pioneering women in STEM from the @mitlibraries rare books collection: https://t.co/zvwWtMMuGG #IWD2022 https://t.co/abrPW2igyn","date":"Tue Mar 08 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Lincoln Laboratory’s ​​Chiamaka Agbasi-Porter has cultivated an educational ecosystem that impacts hundreds of students every year. Her work opens possibilities for kids who may not otherwise have the resources to pursue STEM interests. https://t.co/iaXW2bael1 https://t.co/YWTRqixxEZ","date":"Tue Mar 08 16:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Architect Maria (Kivisild) Ogrydziak ’69 was one of ~50 women in her class of 1,000 – and the 1st woman elected Undergraduate Association president. “It was a big part of my MIT experience to break through what I perceived as being the same old, same old.” #IWD https://t.co/AJucEnYNny","date":"Tue Mar 08 14:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"While the nascent field of quantum computing can feel flashy and futuristic, quantum computers have the potential for computational breakthroughs in classically unsolvable tasks and computational physics and chemistry. https://t.co/0YpGBMgIkq https://t.co/JPB0B7Vb13","date":"Tue Mar 08 08:01:23 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"OPT Industries, an MIT spinoff, has created a 3D-printed nasal swab that is “up to 20 times more effective in bacterial sample elution.” https://t.co/0bVMHHuhJs","date":"Mon Mar 07 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new resource for teaching responsible technology development: The Social and Ethical Responsibilities of Computing publishes a collection of original pedagogical materials developed for instructional use on MIT OpenCourseWare. https://t.co/Y3ymMk7lRy https://t.co/68jcdEn8nQ","date":"Mon Mar 07 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New maps show the production of jet contrails — which contribute to global warming — dropped sharply during the Covid-19 pandemic. The computer-vision technique behind these maps could be used to direct air traffic in a way that reduces contrail formation. https://t.co/qfwiUjvV7f https://t.co/fTro36KHIl","date":"Mon Mar 07 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Dendrites may help neurons perform complicated calculations: Different types of these branch-like projections process incoming information in different ways before sending it to the body of the neuron. https://t.co/yYu017UAR8 https://t.co/zKBvKMeXli","date":"Mon Mar 07 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A creative desire, and the grit to get it done: Senior Laura Rosado settled on her major while designing a flying car. https://t.co/OLAYTCja7O https://t.co/aLBo9PsKMy","date":"Sun Mar 06 16:01:24 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Size matters in particle treatments of traumatic injuries: A new analysis offers guidance on the size of nanoparticles that could be most effective at stopping internal bleeding. https://t.co/6Ym2I2BJRf https://t.co/ukwUSsFf9Q","date":"Sat Mar 05 16:01:42 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Climate Grand Challenges finalists on building equity and fairness into climate solutions: Faculty leaders discuss the opportunities and obstacles in developing, scaling, and implementing their work rapidly. https://t.co/gxUnIiM3Vf https://t.co/AyRmQcaguA","date":"Fri Mar 04 21:39:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Form Energy, a startup co-founded by MIT scientists, is focused on developing a low-cost way to transform the global electric system. The company has created batteries that are powered by rust. https://t.co/RJjCH1PvJ1","date":"Fri Mar 04 18:02:34 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Injecting fairness into machine-learning models: A new technique boosts models’ ability to reduce bias, even if the dataset used to train the model is unbalanced. https://t.co/0FPJ3Oy1yw https://t.co/0wAA4nnyG9","date":"Fri Mar 04 17:01:49 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Senior Tanner Bonner is an ardent advocate for first-generation and low-income students at MIT. “I love to think about systems and society, and how we work together and make the best use of what we have, to ensure what we have is given equitably,” he says. https://t.co/CIbe4NzgNu https://t.co/B4rxsWri8o","date":"Fri Mar 04 16:03:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New book celebrates trailblazing MIT physicist Mildred Dresselhaus: “Carbon Queen” explores how the Institute Professor transformed our understanding of the physical world and made science and engineering more accessible to all. https://t.co/NLq3p0G4SI https://t.co/PJUKFglV7T","date":"Fri Mar 04 14:28:59 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have developed an “electronically steerable terahertz antenna array, which operates like a controllable mirror.” The new device “may enable higher-speed communications and vision systems that can see through foggy or dusty environments.” https://t.co/DK6yMX8eD8","date":"Thu Mar 03 19:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The Practical Education Network cultivates an MIT-derived teaching approach in low-resource settings. Hands-on learning “can have a really deep impact on the way students see themselves,” says founder Heather Beem PhD ’15.  https://t.co/PwmNkg2yE5 https://t.co/4V0QtGusZR","date":"Thu Mar 03 16:03:24 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"With MIT’s outstanding academics and a home on the Charles River, the MIT crew is an ideal place for aspiring collegiate rowers.\n\nWatch entire video by Jean Dunoyer/MIT Video Productions: https://t.co/HbaWLIWWnY https://t.co/p2lW7G7XPl","date":"Thu Mar 03 08:04:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have discovered that specific neurons in the brain respond to singing, but not to sounds such as road traffic and speaking. “This work suggests there’s a distinction in the brain between instrumental music and vocal music.” https://t.co/U8dJetAYJc","date":"Wed Mar 02 18:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"School of @MITEngineering welcomes new faculty: Seventeen new professors join the MIT community, with research areas ranging from robotics and machine learning to health care and agriculture. https://t.co/QsFprrURKr https://t.co/jMdy5aetH3","date":"Wed Mar 02 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Perhaps computer vision and human vision have more in common than meets the eye? New research has found similarities between how some computer-vision systems process images and how humans see out of the corners of our eyes. https://t.co/408DbB9uqW https://t.co/gPQ9486qMM","date":"Wed Mar 02 16:02:51 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Following seven years as chancellor, Cynthia Barnhart will assume the Institute’s senior academic post. “As I step into the role of provost, I am energized by the exciting prospects that lie ahead,” Barnhart says. https://t.co/ntt3V2gG5v https://t.co/7GSyoS9nAu","date":"Wed Mar 02 15:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"From modeling quantum devices to political systems: Senior Sihao Huang uses his background in physics and complex systems to inform his interdisciplinary approach to political science. https://t.co/RE43nrbiXV https://t.co/AQQ1FtGdFE","date":"Wed Mar 02 08:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Assessing connections in the brain’s reading network: State-of-the-art analysis of brain images from nearly 700 children has turned up surprisingly few links between white matter structure and reading ability. https://t.co/ygxE52KpUf https://t.co/qWALCtngX6","date":"Tue Mar 01 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Atmospheric chemists have found that smoke from recent wildfires set off chemical reactions in the stratosphere that contributed to the destruction of ozone. The study is the first to establish a chemical link between wildfires and ozone depletion. https://t.co/ooJ6lrxUQ3 https://t.co/KXSaUwu5YD","date":"Tue Mar 01 16:03:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The sound of a sunset: The Digital Humanities Lab unveils its Sonification Toolkit, which enables conversion of almost anything — from data to drawings — into sound. https://t.co/fnGGuT4wbc https://t.co/OjeU21iBV2","date":"Tue Mar 01 08:01:19 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Dan Harlow, associate professor in the MIT Center for Theoretical Physics, and his son Alexander built a snow cat this weekend on Killian Court. https://t.co/hB4FZ7Xix2","date":"Mon Feb 28 19:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Carol R. Saivetz, a senior advisor for MIT’s Security Studies Program, discusses the Russian invasion of Ukraine. “The claims that this was all about NATO expansion are really false,” says Saivetz. “I think it’s much more about Putin’s imperial ambitions.” https://t.co/drAWw9uzLo","date":"Mon Feb 28 18:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Jordan Harrod: Brain researcher and AI-focused YouTuber: The PhD student uses machine learning as a tool for studying pain and consciousness — and as subject matter for her popular videos. https://t.co/8atmU6vrDT https://t.co/XKVCK6vn9Z","date":"Mon Feb 28 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Not content with one degree, Nidhi Juthani decided to earn two via MIT’s PhD CEP program, pursuing a doctorate and an MBA. “It’s so specifically geared for people who want to go into business out of a PhD that it just made sense for me,” she says. https://t.co/LUHl0L4WUB https://t.co/AfG8VcVoCZ","date":"Mon Feb 28 16:03:08 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new woody composite, engineered by a team at MIT, is tough as bone and hard as aluminum, and it could pave way for naturally-derived plastics.  https://t.co/DS3qvolPH4 https://t.co/kNTWD8YmPG","date":"Mon Feb 28 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Equidock, the machine learning system researchers developed, can directly predict a protein complex like this in a matter of seconds. https://t.co/9Kto28KMaT https://t.co/j8c0TFA9YY","date":"Sun Feb 27 16:01:33 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers are working on making the path taken by cells as predictable as the arc of a baseball. Rather than looking at how cells move through space, they are considering how cells change with time.  https://t.co/a5K1lblPtz https://t.co/V0tRMMQzfp","date":"Sat Feb 26 16:01:54 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"RT @MIT_SHASS: Snow day in Cambridge 02139 today! \nOptions: fun, snowshoes, cozy, reading, fireplace, cocoa, snow fort, photos, tromping, snow angel, warming up, baking, more reading, awaiting l'heure bleu.... https://t.co/5XFjzt0aoe","date":"Fri Feb 25 21:00:50 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Assia Boundaoui, a fellow at the MIT Open Documentary Lab, writes for The Los Angeles Times about her experience as a Muslim American filmmaker. https://t.co/2I0DjLyRX4","date":"Fri Feb 25 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new, inexpensive catalyst speeds the production of oxygen from water: The material could replace rare metals and lead to more economical production of carbon-neutral fuels. https://t.co/cmooBaeEhm https://t.co/gLqwst86gs","date":"Fri Feb 25 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Using artificial intelligence to find anomalies hiding in massive datasets: A new machine-learning technique could pinpoint potential power grid failures or cascading traffic bottlenecks in real time. https://t.co/V8qkdlxG9J https://t.co/TAvjeB7oqa","date":"Fri Feb 25 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Mussie Demisse ’21 says @MITOCW wasn’t the first time his interests had led him to MIT. But it was the final push he needed to apply to the school that he’d long set his heart on. https://t.co/NI66OugHc3 https://t.co/fItCjdx05P","date":"Fri Feb 25 14:05:09 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A computational study shows that dozens of mutations help the virus’ spike protein evade antibodies that target SARS-CoV-2. https://t.co/9wCeAyPAQU https://t.co/m8jrP9kygX","date":"Fri Feb 25 08:01:08 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"One year after NASA’s Perseverance rover successfully landed on Mars, scientists are preparing to investigate a dried-up river delta along the west rim of the Jezero crater to search for rocks and microscopic fossils. https://t.co/Tm6V4CWbUo","date":"Thu Feb 24 18:15:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Physicists observe an exotic “multiferroic” state in an atomically thin material https://t.co/knGD5Ygk4X https://t.co/ZuGqf0d7vN","date":"Thu Feb 24 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Mentorship and medicine: MIT senior Daniel Zhang aims to provide hope for young patients and support to young students. https://t.co/ASDNSdp1TE https://t.co/OwX2Vibeuo","date":"Thu Feb 24 16:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The laws of physics and the physics of law: Obiageli Nwodoh ’21 repurposed her STEM skills to pave a pre-law path at MIT and pursue social justice. says. https://t.co/zTvCdJLf2W https://t.co/frbWhzsDZD","date":"Thu Feb 24 14:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New lightweight material is stronger than steel: The new substance is the result of a feat thought to be impossible: polymerizing a material in two dimensions. https://t.co/52lO5kYLZD https://t.co/Myg59PKvmm","date":"Thu Feb 24 08:01:22 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"RT @MITAthletics: Congrats to the members of the @MITSwimDive men's team for being named to the NEWMAC Academic All-Conference Team! #RollTech\n\nRelease: https://t.co/cXcdqdrh6Y https://t.co/4U4b5a8Xhs","date":"Wed Feb 23 21:00:47 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"RT @MITMechE: Sophomore Audrey Chen and her team, Arcturus\n — a newly formed @MITEdgerton team — are in the process of building an autonomous boat to compete at the 15th annual RoboBoat Competition this June. https://t.co/BHRTTOXNOk","date":"Wed Feb 23 20:02:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Boston Globe Magazine spotlights MIT startup Biobot Analytics, co-founded by Mariana Matus ’18 and Newsha Ghaeli ’17, for using their wastewater and sewage tracking technology to identify Covid -19 in communities across the United States. https://t.co/qcnH4TKd3O","date":"Wed Feb 23 18:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Singing in the brain: MIT neuroscientists have identified a population of neurons in the human brain that respond to singing but not other types of music. https://t.co/WdhAytoE06 https://t.co/CSPlgsaIkk","date":"Wed Feb 23 17:01:42 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A “hot Jupiter’s” dark side is revealed in detail for first time: The planet’s night side likely hosts iron clouds, titanium rain, and winds that dwarf Earth’s jetstream. https://t.co/0agqrC12Jg","date":"Wed Feb 23 16:07:45 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Investigating pathogens and their life cycles, for the benefit of society: Senior Desmond Edwards has an insatiable curiosity about how the human body works — and how diseases stop it from working. https://t.co/bUI31gfH9C https://t.co/DXSVNVBJ3P","date":"Wed Feb 23 14:03:14 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The Space Foundation, a nonprofit organization that advocates for space exploration and space-inspired industries, has awarded OSIRIS-REx with the prestigious 2022 John L. \"Jack\" Swigert Jr. Award for Space Exploration. https://t.co/sRLZXNUWlM https://t.co/Qnr9N4d2yj","date":"Wed Feb 23 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Seen at MIT this morning: #Twosday celebration for 2/22/22 https://t.co/3RB4nHLe1x","date":"Tue Feb 22 19:10:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Scientists from MIT and Princeton University find hurricanes that cause both extreme high tides and heavy rain will become much more frequent by the end of the century, especially for the northeastern U.S. https://t.co/sXA5ACT7AV","date":"Tue Feb 22 18:02:46 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Toward a stronger defense of personal data: Engineers build a lower-energy chip that can prevent hackers from extracting hidden information from a smart device. https://t.co/E2jI4nBwjH https://t.co/IvbLEIas1C","date":"Tue Feb 22 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"On a mission to alleviate chronic pain: Fan Wang’s studies of how the brain controls pain may one day lead to new treatments that could help millions of people. https://t.co/HsP0olZmNG @mcgovernmit @mitbrainandcog https://t.co/wc81nFCkWs","date":"Tue Feb 22 16:02:48 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"When Janelle Wellons ’16 isn’t working at NASA’s Jet Propulsion Laboratory, she shares her story with kids who might not think of careers in aerospace. “There was never a younger version of me that thought one day I could work for NASA,” she says. https://t.co/L7qEEZaeIf https://t.co/XZpea5zUrB","date":"Tue Feb 22 14:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"As dean for digital learning at MIT, Cynthia Breazeal will lead corporate education efforts, helping to grow the existing portfolio of online professional courses, content libraries, and bootcamps. https://t.co/dbj8ZatsVx https://t.co/tNRaE1L00w","date":"Tue Feb 22 08:01:21 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Jacopo Buongiorno, Elina Teplinsky of Pillsbury Winthrop Shaw Pittman, and Jessica Lovering of Good Energy Collective make the case for nuclear power playing an important role in the transition to clean energy. https://t.co/EvYWKvZZwu","date":"Mon Feb 21 18:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chemist and MLK Jr. Scholar Robert Gilliard explores new frontiers in synthetic chemistry: MIT visiting scholar is motivated by foundational science at the edges of the periodic table. https://t.co/oOE5mIcmzs https://t.co/3H5p24kuYK","date":"Mon Feb 21 14:03:57 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Why are comet heads green — but not their tails https://t.co/PIO3FeJgIM https://t.co/TN1IOygwrd","date":"Mon Feb 21 08:01:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new upper limit on the mass of neutrinos: Researchers with the KATRIN experiment determine that neutrinos are lighter than 0.8 eV/c2. https://t.co/KzXQF26R7E https://t.co/TQ88P6EY3p","date":"Sun Feb 20 16:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Enjoy the February palindromes!\n\n2/20/22\n2/21/22\n2/22/22\n2/23/22\n2/24/22\n2/25/22\n2/26/22\n2/27/22\n2/28/22\n\nImage: Christine Daniloff/MIT https://t.co/nOThcX1A39","date":"Sun Feb 20 15:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"With MIT’s outstanding academics and a home on the Charles River, the MIT crew is an ideal place for aspiring collegiate rowers.\n\nWatch the entire video by Jean Dunoyer/MIT Video Productions: https://t.co/HbaWLIWWnY https://t.co/jZQgPnuLmx","date":"Sat Feb 19 16:05:00 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT research finds that mediation apps may have benefits for users in reducing anxiety and depression. “Access to the app reduced the share of participants with moderate or severe anxiety by 13 percentage points, or 50%, compared to the control group.\" https://t.co/H3NClxd0rd","date":"Fri Feb 18 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Seven new faculty join the MIT School of Science: Departments of Biology and Brain and Cognitive Sciences welcome new professors. https://t.co/j00L4ldPJi https://t.co/WiD2Zyi96n","date":"Fri Feb 18 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Neuroscientists have learned how dendrites may help neurons perform complicated calculations: Different types of these branch-like projections process incoming information in different ways before sending it to the body of the neuron. https://t.co/yYu017UAR8 https://t.co/R6GZC02jGa","date":"Fri Feb 18 16:03:14 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT experts test technical research for a hypothetical central bank digital currency: Collaboration with Federal Reserve Bank of Boston yields progress in understanding how a digital currency might be developed in the future. https://t.co/w6wv3Az4tS https://t.co/LC813X5d5Q","date":"Fri Feb 18 08:01:11 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new approach to curbing cocaine use: MIT researchers find activating a specific acetylcholine receptor in the brain reduces cocaine use in rodents. https://t.co/AOM2mxho4p https://t.co/ySUjrDrmuV","date":"Thu Feb 17 19:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers have developed a solar-powered desalination system that “avoids salt buildup and could provide a family with continuous drinking water for only $4.” https://t.co/48Lmxhx5HL","date":"Thu Feb 17 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New changes to MIT’s Covid-19 strategy: Cecilia Stuopis, Peko Hosoi, and Ian Waitz describe a shift in policy that aims for a gradual return to normalcy. https://t.co/tuuK7SGtsd https://t.co/NW84F5rvwG","date":"Thu Feb 17 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Safi Organics uses local crop residue to make organic fertilizer for rural farmers in Kenya. The company, founded by Kevin Kung SM '13, PhD '17, is helping increase crop yields and reverse acidification in soils. https://t.co/DOFQeNyDiu https://t.co/JallLkdGAq","date":"Thu Feb 17 16:03:24 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Ngozi Okonjo-Iweala to speak at MIT’s 2022 Commencement: Director-General of the World Trade Organization and MIT alumna will address the Class of 2022 on May 27. https://t.co/xdG8cmBHyV https://t.co/zmZ9vWctL8","date":"Thu Feb 17 15:05:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"President L. Rafael Reif, who was \"instrumental in leading [MIT] to convert its science into innovation, especially in the areas of life sciences, energy, materials, and machine learning and AI,” has announced he will step down at the end of 2022. https://t.co/ztSBh7OPJO","date":"Wed Feb 16 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Student-led MIT course provides an inside look at K-pop: Artists and industry professionals including AleXa join the online course, offering insights into Korean pop music. https://t.co/aHCDsOIKMU https://t.co/qA51Cbkkq4","date":"Wed Feb 16 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chemical engineers have performed the first systematic study of how different-sized polymer nanoparticles circulate in the body and interact with platelets to promote blood clotting. https://t.co/6Ym2I2BJRf https://t.co/YaQrLvhjvc","date":"Wed Feb 16 16:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Building technological tools for nuclear disarmament: Associate Professor Areg Danagoulian credits mentorship with helping him establish a path through nuclear physics. https://t.co/3Ptts8eRpG https://t.co/W64zeuu68G","date":"Wed Feb 16 14:02:51 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Amrita Saigal ’10 has created Kudos Diapers, a sustainable disposable diaper that allows a baby’s skin to touch nothing but pure cotton. https://t.co/wyYRGURO5D","date":"Tue Feb 15 18:02:41 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Light could boost performance of fuel cells, lithium batteries, and other devices: With many devices depending on the motion of ions, light could be used as a switch to turn ion motion on and off. https://t.co/fbRRjdIF4s https://t.co/5omdOYYOcr","date":"Tue Feb 15 17:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"DMSE senior Heidi Li strives to help local communities influence policymaking to achieve a more sustainable future. She also hopes to empower younger generations to develop solution-minded approaches to environmentalism. https://t.co/JIDUa3Mnna https://t.co/hMJALsWEVL","date":"Tue Feb 15 16:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT biologists drilled down into how proteins recognize and bind to one another, informing drug treatments for cancer. https://t.co/7qa5MhXkxq https://t.co/F8mVFlLHiW","date":"Tue Feb 15 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Susan M. Collins PhD ’84 has been selected as the next president of the Federal Reserve Bank of Boston, “the first woman of color selected to lead one of the 12 regional Fed branches since the central bank system was created in 1914.” https://t.co/bSgVb85HyR","date":"Mon Feb 14 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"First-ever Climate Grand Challenges recognizes 27 finalists: A subset of the finalists will be announced as multiyear flagship projects this spring. https://t.co/xAzpfRreU3 https://t.co/rJN7VYMWAv","date":"Mon Feb 14 17:05:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Phyllis A. Wallace, the first woman granted tenure at MIT Sloan, spent her career fighting against systems that kept, and still keep, marginalized groups from thriving in the labor market. https://t.co/6TkQ9ab8eL https://t.co/ZTdiaXQvM9","date":"Mon Feb 14 16:03:44 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"We would feel out of order without you ♥️. Happy Valentine's Day!\n\nImage: Margaret Zheng '23/big_dijkstra_energy on Instagram https://t.co/qptEQ2F67k","date":"Mon Feb 14 14:05:08 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers created a technique that can automatically describe the roles of individual neurons in a neural network with natural language. https://t.co/zFfeDqG2Ny https://t.co/C3eWsnSgDZ","date":"Mon Feb 14 08:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A group of MIT researchers argue that the country’s strategy for reasserting its place as a semiconductor superpower must heavily involve universities, which are uniquely positioned to pioneer new technology and train a highly skilled workforce. https://t.co/iTLO7YY646 https://t.co/VJJ8ubojSw","date":"Sun Feb 13 16:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Scientists discover a mysterious transition in an electronic crystal: Thermal span in a layered compound promises applications in next-generation electrical switches and nonvolatile memory. https://t.co/o0trNBTUDe https://t.co/Wj5euUvIgE","date":"Sat Feb 12 16:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Quaise Energy, a startup out of MIT’s Plasma Science and Fusion Center, is focused on making geothermal power more accessible. The company has developed a millimeter wave drilling system to access layers of rock that reach over 700 degrees Fahrenheit. https://t.co/H3SIvPXKhA","date":"Fri Feb 11 18:02:43 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Cynthia Barnhart named MIT provost: Following seven years as chancellor, Barnhart will assume the Institute’s senior academic post. https://t.co/IXHbAnqmvB https://t.co/T0BQAjlvnE","date":"Fri Feb 11 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Mechanical engineers have developed a material based on cellulose — nature’s most abundant polymer — that is tough as bone and hard as aluminum. The material might pave the way for more sustainable, naturally derived plastics. https://t.co/DS3qvolPH4 https://t.co/AnbKI27NA1","date":"Fri Feb 11 16:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Fast-tracking the search for energy-efficient materials: Doctoral candidate Nina Andrejević combines spectroscopy and machine learning techniques to identify novel and valuable properties in matter. https://t.co/ikhNMBM4I3 https://t.co/MDCq572pyL","date":"Fri Feb 11 08:01:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new MIT study could help designers create voice-user interfaces that are more engaging and more likely to be used by members of a family in the home, while also improving the transparency of these devices. https://t.co/GQQMNpIdkq https://t.co/jqJgS07iDc","date":"Thu Feb 10 18:02:42 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"L. Rafael Reif today announced his plan to step down as MIT president. For a decade, Reif’s bold vision led the Institute to dynamic growth and increased stature on the world stage. https://t.co/pU2WmmrriJ https://t.co/kldyuzLNVR","date":"Thu Feb 10 17:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A study of the Tsimane’ people of Bolivia suggests that words are needed to think about numbers. The researchers found a relationship between Tsimane’ individuals’ counting ability and their success at matching tasks that involve numbers up to about 25. https://t.co/tsN229r9jH https://t.co/AdD4xHKI7S","date":"Thu Feb 10 16:05:09 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Emery Brown has big plans for anesthesiology: In stepping down as co-director of the Harvard-MIT Program in Health Sciences and Technology, Brown will work to develop a new center for anesthesiology research. https://t.co/NKf49R1RC6 https://t.co/DHJkX4tojM","date":"Thu Feb 10 14:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new video game, \"A Lab of One’s Own,\" creates an immersive environment in which players discover archival materials that tell the stories of women from MIT’s history. https://t.co/33CXKtFeV4 https://t.co/gp2RB5Y963","date":"Thu Feb 10 08:01:09 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Sara Seager discusses the Venus Life Finder missions, which will carry a robotic space payload partially funded by MIT alumni to Venus to search for signs of life in the planet’s atmosphere. https://t.co/VycSaCmJz5","date":"Wed Feb 09 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Artificial intelligence system rapidly predicts how two proteins will attach: The machine-learning model could help scientists speed the development of new medicines. https://t.co/9Kto28KMaT https://t.co/NFJfSmexPW","date":"Wed Feb 09 17:01:56 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"What does a sunset sound like? The Digital Humanities Lab’s Sonification Toolkit enables conversion of almost anything — from data to drawings — into sound that is aesthetically satisfying and analytically illuminating. https://t.co/D7yyJxD87a https://t.co/99vyflwaUk","date":"Wed Feb 09 16:03:21 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Assistant Professor Wim van Rees and his team have developed simulations of self-propelled undulatory swimmers to better understand how fish-like deformable fins could improve propulsion in underwater devices.  https://t.co/TxjWnqV7FS https://t.co/6MrmRBcwpR","date":"Wed Feb 09 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT researchers developed a material that is two times stronger than steel with just one-sixth the material bulk. “The material has implications for everything from how we build the gadgets we hold in our hands to the buildings we live in.” https://t.co/BZuZV5AZSb","date":"Tue Feb 08 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"New computational tool predicts cell fates and genetic perturbations: The technique can help predict a cell’s path over time, such as what type of cell it will become. https://t.co/a5K1lblPtz https://t.co/NbNSDAQ0LD","date":"Tue Feb 08 17:05:05 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"When Sihao Huang arrived at MIT, he began studying physics and engineering. He soon realized that, for him, the most intriguing systems were found not in the natural sciences, but in the social sciences. https://t.co/WcLeW3sXD6 https://t.co/Ga7VRUEZbB","date":"Tue Feb 08 16:03:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Merging design, tech, and cognitive science: Senior Ibuki Iwasaki seeks creative ways to design technology that considers the human user. https://t.co/n6x7pLm9r3 https://t.co/fqIIvXEJwu","date":"Tue Feb 08 08:01:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Olympian Alexis Sablone ’16 will be the head coach for the United States women’s skateboarding team in the 2024 Olympic Games. Sablone “has one of the most decorated careers of any female street skater.” https://t.co/wY0PGDPaH1","date":"Mon Feb 07 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Probing how proteins pair up inside cells: MIT biologists drilled down into how proteins recognize and bind to one another, informing drug treatments for cancer. https://t.co/iZol1fr32w https://t.co/bsp6NAWTcl","date":"Mon Feb 07 17:02:45 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Heather Kulik is an explorer in the vast universe of possible chemical combinations. She embraces computer models as “the only way to make a dent” in the huge number of potential materials that could solve important problems. https://t.co/VQ6Fp6JnNG https://t.co/Bccof11mkC","date":"Mon Feb 07 16:03:11 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"After completing his degree in electrical engineering and computer science next spring, Adedolapo Adedokun will travel to Ireland to undertake a MSc in intelligent systems at Trinity College Dublin as MIT’s fourth student to be named a Mitchell Scholar. https://t.co/taudCNbULO https://t.co/q3zUWBE3iL","date":"Mon Feb 07 14:08:35 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"When should someone trust an AI assistant’s predictions?: Researchers have created a method to help workers collaborate with artificial intelligence systems. https://t.co/R8qBm0B6Vl https://t.co/NHj1OZRarE","date":"Mon Feb 07 08:01:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Seeing the natural world through a mathematical lens: Senior David Darrow’s love of math fuels other passions such as mentoring and learning new languages. https://t.co/U0MesWA6Qm https://t.co/wRdPd73i3V","date":"Sun Feb 06 16:01:20 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Energizing communities in Africa: MIT senior Ayomikun Ayodeji seeks to expand access to reliable, affordable energy in his home country of Nigeria, and beyond. https://t.co/cKUHLznJut https://t.co/YVbXNkWN81","date":"Sat Feb 05 16:01:43 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT engineers have developed a transparent, degradable medical dressing that could be used to help gut wounds heal more quickly and efficiently. https://t.co/FdEBwlg2hK","date":"Fri Feb 04 18:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Demystifying machine-learning systems: A new method automatically describes, in natural language, what the individual components of a neural network do. https://t.co/JesAlyjcsU https://t.co/DKuM8HYjyN","date":"Fri Feb 04 17:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT experts test technical research for a hypothetical central bank digital currency: Collaboration with Federal Reserve Bank of Boston yields progress in understanding how a digital currency might be developed in the future. https://t.co/kA2qhuqI0M https://t.co/yiLkZPVksd","date":"Fri Feb 04 16:03:14 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Babies can tell who has close relationships based on one clue, saliva: Sharing food and kissing are among the signals babies use to interpret their social world, according to a new study. https://t.co/hpmJdAO8hN https://t.co/uiHsJRZtV2","date":"Fri Feb 04 08:01:10 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Assaf Biderman, associate director of the MIT @SenseableCity Lab, discusses MIT startup Superpedestrian, a transportation robotics company whose electric scooters are available in over 60 cities across the world. https://t.co/39sgUXpVmU","date":"Thu Feb 03 18:07:46 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"OSIRIS-REx mission carrying MIT student experiment wins Space Foundation award: John L. \"Jack\" Swigert, Jr. Award for Space Exploration honors project team’s success harvesting a sample from asteroid Bennu. https://t.co/sRLZXNUWlM https://t.co/wkXQ4QC0wq","date":"Thu Feb 03 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Chemical engineers have created a material that is stronger than steel, as light as plastic, and easily manufactured. It could be used as a durable coating for car parts or cell phones, or even as a building material for bridges or other structures. https://t.co/52lO5kYea5 https://t.co/cHjIFjCrMt","date":"Thu Feb 03 16:03:10 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"How Omicron escapes from antibodies: A computational study shows that dozens of mutations help the virus’ spike protein evade antibodies that target SARS-CoV-2. https://t.co/9wCeAyPAQU https://t.co/JCjtt79g7Z","date":"Thu Feb 03 08:01:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"David Rush ‘07 holds over 200 Guinness World Records, and set 52 new records in 2021 alone, reports Nick Mordowanec for Newsweek. https://t.co/tTBof3YW7C","date":"Wed Feb 02 18:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Closing the Gap for Black Business Owners: Burunda Prince ’83 is working with her team to build infrastructure to help Black entrepreneurs build their companies. The nonprofit is part incubator, part accelerator, and part makerspace. https://t.co/Vf3AsNfD8O https://t.co/bQS8Tf66W4","date":"Wed Feb 02 17:04:35 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Landfills are a major source of methane, a potent greenhouse gas. Loci Controls, founded by MIT alumni, has developed a solar-powered system that helps landfill operators capture methane so it can be converted into fuel. https://t.co/NRSvtl4E7Y https://t.co/WYoKFWoUIi","date":"Wed Feb 02 16:00:21 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"It's a palindrome Groundhog Day!\n\nImage: Jose-Luis Olivares/MIT https://t.co/op2VDonOmv","date":"Wed Feb 02 14:06:42 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Researchers can now treat a surface so that a droplet of mercury spreads out on it, instead of beading up. https://t.co/wflKcKS80h https://t.co/A3DRuGEcIP","date":"Wed Feb 02 08:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Professor Yossi Sheffi notes that “just-in-time” (JIT) supply chains can help improve product quality and manufacturing processes, leading to reduced inefficiency. https://t.co/VZsXPOerO1","date":"Tue Feb 01 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Why are comet heads green — but not their tails?: An accidental discovery and a love of spectroscopic perturbations leads to the solution of a 90-year-old puzzle. https://t.co/PIO3FeJOyk https://t.co/RQf84ER6IK","date":"Tue Feb 01 17:05:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Senior Ayomikun Ayodeji seeks to increase access to reliable, affordable energy in his home country of Nigeria, and beyond. “I hope to expand my problem-solving toolkit so that, one day, it can be useful in electrifying communities back home,” he says.  https://t.co/cKUHLznJut https://t.co/d0rpn4q2AF","date":"Tue Feb 01 16:03:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"To mark the beginning of Black History Month, we look back on the history of the MIT Black Students’ Union (BSU), founded in 1968 to provide students with a forum for community and advocacy that continues today. https://t.co/WOWu4CULLt","date":"Tue Feb 01 14:03:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Clean room as classroom: Undergraduate classes provide hands-on introduction to nanotechnology and nanoengineering at @MIT_nano. https://t.co/wIAXUDztic https://t.co/25ZxNBKOzK","date":"Tue Feb 01 08:01:12 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Seen January 30, 2022, #MIThenge. Twice a year, in January and November, the setting sun aligns perfectly with MIT’s 825-foot-long Infinite Corridor.\n\nPhoto: @Moataz_Sheha https://t.co/nlUUHjWhd5","date":"Mon Jan 31 20:15:16 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"“No biometric technologies should be adopted by the government to police access to services or benefits,” writes Joy Buolamwini @jovialjoy, a @medialab researcher who recently completed her PhD. https://t.co/lj0V1q6byi","date":"Mon Jan 31 18:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A new language for quantum computing: Twist is an MIT-developed programming language that can describe and verify which pieces of data are entangled to prevent bugs in a quantum program. \nhttps://t.co/tP48JSQMBX https://t.co/UoJfHohrz1","date":"Mon Jan 31 17:05:04 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Aiming to produce energy-saving technologies, PhD student Nina Andrejević combines spectroscopy and machine learning to identify novel properties in matter. “We must first know which materials make good candidates for these applications,” she says. https://t.co/ikhNMBM4I3 https://t.co/sH9QMn7gKx","date":"Mon Jan 31 16:03:13 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Reducing food waste to increase access to affordable foods: MIT alumni-founded Spoiler Alert matches major food brands with discount grocers to sell perishable products. https://t.co/tcOQk9YKrI https://t.co/HjPCX714qT","date":"Mon Jan 31 14:04:34 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"A team of researchers at MIT has come up with a promising approach to controlling methane emissions and removing it from the air, using an inexpensive and abundant type of clay called zeolite. https://t.co/CFUHrjKfY5 https://t.co/UAZQ0Vb16R","date":"Mon Jan 31 08:05:02 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"The 2021 class of AAAS Fellows includes 564 scientists, engineers, and innovators spanning 24 scientific disciplines who are being recognized for their scientifically and socially distinguished achievements. https://t.co/1zMShviiX4","date":"Sun Jan 30 16:05:01 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"MIT engineers are working on an app that identifies and quantifies food content, which can aid in carbohydrate counting for people with diabetes. https://t.co/UkrKaUhbyJ https://t.co/22KFzUrFIB","date":"Sat Jan 29 16:01:50 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Stay safe and warm, everyone.\n\nPhoto: @allisyn https://t.co/zHZTDU9Otf","date":"Fri Jan 28 22:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"TESS, a NASA mission led and operated by MIT, has identified over 5,000 planet candidates outside of our solar system. https://t.co/WNNqYQlrJT","date":"Fri Jan 28 18:05:03 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Immersive video game explores the history of women at MIT: \"A Lab of One’s Own\" invites players to engage with archival materials in a virtual environment. https://t.co/7vLoJICecg https://t.co/3VYgT0r2CB","date":"Fri Jan 28 17:05:07 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Senior Laura Rosado has followed her many varied interests during four years at MIT. The competitive swimmer and double-major in MechE and creative writing has designed a flying car, studied train automation, and is now writing a novel. https://t.co/BDHEHgQxLT https://t.co/6DBCK2jQdo","date":"Fri Jan 28 16:03:59 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Physicists in RLE have discovered a new quantum bit, or “qubit,” in the form of vibrating pairs of atoms called fermions. It appears highly robust, even in the midst of environmental noise, offering a possible foundation for future quantum computers. https://t.co/FTKW8yUBxH https://t.co/elFO80MEWi","date":"Fri Jan 28 08:01:06 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Scientists discovered X particles in the aftermath of collisions produced at the Large Hadron Collider. “X particles can yield broader insights about the type of environment that existed in those searing and turbulent moments after the Big Bang.” https://t.co/zn5XEbOmnJ","date":"Thu Jan 27 18:02:23 +0000 2022","user_id":"15460048"},{"handle":"mit","text":"Five MIT faculty elected 2021 AAAS Fellows: Dincă, Feng, Hunter, Shoemaker, and Wang are recognized for their efforts to advance science. https://t.co/QDrqlOrXeR https://t.co/iwghWu7i7i","date":"Thu Jan 27 17:05:05 +0000 2022","user_id":"15460048"}]